{
  "profile_url": "https://www.moffitt.org/research-science/researchers/ahmad-tarhini/",
  "last_updated": "2025-11-21T22:50:22.322070",
  "researcher_id": "24764",
  "degrees": [
    "MD",
    "PhD"
  ],
  "title": "",
  "primary_program": "cutaneous oncology",
  "research_program": "molecular medicine, immuno-oncology",
  "overview": "As a clinical and translational physician-scientist, a major objective of Dr Tarhini's research has been the pursuit of studies that test novel targeted therapeutic strategies selected on the basis of a continuously deepening understanding of the molecular circuitry and immune biology of melanoma. This is in addition to a research focus upon the testing of predictors of response to immunotherapeutic agents and prognostic biomarkers of disease outcome. He has also been interested in health economics and outcomes research. He achieved independence early on in his career through novel investigator-initiated clinical and translational studies, leadership of national US Cooperative Group studies and NIH-funded translational projects that he heavily invested within the University of Pittsburgh's Skin Spore Grant where he has served for 10 years as Project Co-leader of the Biomarker Skin Spore Project. He also served as the principal investigator of the Experimental Therapeutics Clinical Trials Network (ETCTN) grant at Case Comprehensive Cancer Center. His original work on immunotherapy of melanoma and biomarkers of disease prognosis and therapeutic benefit has been published in high-impact, peer-reviewed journals and presented at leading national/international meetings. He currently serves as a chair/co-chair on several cooperative group trials, including U.S. Intergroup clinical trials E1609, S1404, EA6141, E3612, E3611, NCI8628, NCI10061 and EA6194. His efforts were awarded by being presented the University of Pittsburgh Cancer Institute Junior Scholar Award in Clinical Research, the Eastern Cooperative Oncology Group (ECOG) Research and Education Foundation Young Investigator Award and the H. Lee Moffitt Cancer Center and Research Institute Top Publication Award. Board certified in medical oncology, Dr. Tarhini’s clinical interests include melanoma (cutaneous, uveal and mucosal) and other skin cancers. He served as a Track Leader of ASCO's Cancer Education Committee Melanoma/Skin Cancers Track and a member of the Scientific Committee. He served as an Organizer of the Society for Immunotherapy of Cancer (SITC) annual meeting. Dr Tarhini also serves as Chair, Scientific Committee, Oncology Research Information Exchange Network (ORIEN) and Chair, ORIEN ImmunoOncology Research Subcommittee. Moffitt Cancer Center",
  "research_interests": [
    "As a clinical and translational physician-scientist, a major objective of Dr Tarhini's research has been the pursuit of studies that test novel targeted therapeutic strategies selected on the basis of a continuously deepening understanding of the molecular circuitry and immune biology of melanoma. This is in addition to a research focus upon the testing of predictors of response to immunotherapeutic agents and prognostic biomarkers of disease outcome. He has also been recently interested in health economics and outcomes research. He achieved independence early on in his career through novel investigator-initiated clinical and translational studies, leadership of national US Cooperative Group studies and NIH-funded translational projects that he heavily invested within the University of Pittsburgh's Skin Spore Grant where he has served for 10 years as Project Co-leader of the Biomarker Skin Spore Project. He also served as the principal investigator of the Experimental Therapeutics Clinical Trials Network (ETCTN) grant at Case Comprehensive Cancer Center. His original work on immunotherapy of melanoma and biomarkers of disease prognosis and therapeutic benefit has been published in high-impact, peer-reviewed journals and presented at leading national/international meetings. He currently serves as a chair/co-chair on several cooperative group trials, including U.S. Intergroup clinical trials E1609, S1404, EA6141, E3612, E3611, NCI8628, NCI10061 and EA6194. His efforts were awarded by being presented the University of Pittsburgh Cancer Institute Junior Scholar Award in Clinical Research, the Eastern Cooperative Oncology Group (ECOG) Research and Education Foundation Young Investigator Award and the H. Lee Moffitt Cancer Center and Research Institute Top Publication Award. Board certified in medical oncology, Dr. Tarhini’s clinical interests include melanoma (cutaneous, uveal and mucosal) and other skin cancers. He has recently served as a Track Leader of ASCO's Cancer Education Committee Melanoma/Skin Cancers Track and a member of the Scientific Committee. He served as an Organizer of the Society for Immunotherapy of Cancer (SITC) annual meeting. Dr Tarhini also serves as Chair, Scientific Committee, Oncology Research Information Exchange Network (ORIEN) and Chair, ORIEN ImmunoOncology Research Subcommittee. Moffitt Cancer Center \n  *"
  ],
  "associations": [
    "Cutaneous Oncology",
    "Immunology",
    "Melanoma & Skin Cancer Center of Excellence",
    "Molecular Medicine Program",
    "Immuno-Oncology Program"
  ],
  "education": [
    {
      "type": "Medical School",
      "institution": "Lithuanian University of Health Sciences",
      "degree": "MD"
    },
    {
      "type": "Medical School",
      "institution": "University of Pittsburgh School of Medicine",
      "degree": "PhD"
    },
    {
      "type": "Residency",
      "institution": "University of Pittsburgh Medical Center",
      "position": "Intern",
      "specialty": "al Medicine"
    },
    {
      "type": "Fellowship",
      "institution": "University of Pittsburgh Medical Center",
      "specialty": "Hematology and Oncology"
    }
  ],
  "publications": [
    {
      "title": "Neoadjuvant PD-1 and LAG-3-targeting bispecific antibody and other immune checkpoint inhibitor combinations in resectable melanoma: the randomized phase 1b/2 Morpheus-Melanoma trial",
      "pubmed_id": "40993242",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Long GV, Nair N, Marbach D, Scolyer RA, Wilson S, Cotting D, Staedler N, Amaria RN, Ascierto PA, Tarhini AA, Robert C, Hamid O, Gaudy-Marqueste C, Lebbe C, Munoz-Couselo E, Menzies AM, Pages C, Curigliano G, Mandala M, Jessop N, Bader U, Perdicchio M, Teichgräber V, Muecke M, Markert C, Blank C",
      "journal": "Nat Med"
    },
    {
      "title": "A retrospective cohort study of physical activity and survival in patients treated with immune checkpoint inhibitors",
      "pubmed_id": "40971247",
      "pmc_id": "PMC12579459",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Parker NH, Ramos JD, Tarhini AA, Schell MJ, Egan KM, Kanetsky PA",
      "journal": "Cancer Epidemiol Biomarkers Prev"
    },
    {
      "title": "Monoclonal antibodies as adjuvant therapies for resected melanoma",
      "pubmed_id": "40125987",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Eljilany I, Garcia JR, Jamal B, Tarhini AA",
      "journal": "Expert Opin Biol Ther"
    },
    {
      "title": "Primary tumor microbiomes predict distant metastasis of colorectal cancer",
      "pubmed_id": "40661479",
      "pmc_id": "PMC12258887",
      "year": "2025",
      "publication_date": "2025 Jun",
      "authors": "Parajuli B, Midya V, Kiddle R, De Jager N, Eggers S, Spakowicz D, Hoyd R, Salhia B, Chan CHF, Churchman ML, Rounbehler RJ, Yao S, Rutkowski MR, Tarhini AA, Mudaranthakam DP, Masood A, Bocklage TJ, Lentz RW, Hatoum H, Ilozumba MN, Hardikar S, Ulrich CM, Round JL, Riedlinger G, Shriver CD, Bosch DE",
      "journal": "bioRxiv"
    },
    {
      "title": "Cancer immunotherapy clinical trials to support urgently needed access in low- and middle-income countries: a report from the SITC global access and impact committee",
      "pubmed_id": "40550565",
      "pmc_id": "PMC12184393",
      "year": "2025",
      "publication_date": "2025 Jun",
      "authors": "Dent J, Jorge M, Sobrevilla N, Uldrick TS, Adoubi I, Bajpai J, Burotto M, Bulhan H, Dosunmu GT, Ekpo L, Gopal S, Espinoza-Gutarra MR, Homian NM, Kingham TP, Mathias C, Ngwa W, Niyonzima N, Nkegoum B, Olopade OI, Odeny TA, Posey AD, Sahebjam S, Switzer R, Tarhini AA, Vanderpuye V, Kaufman DR",
      "journal": "J Immunother Cancer"
    },
    {
      "title": "Effector T cells under hypoxia have an altered transcriptome similar to tumor-stressed T cells found in non-responsive melanoma patients",
      "pubmed_id": "40010774",
      "year": "2025",
      "publication_date": "2025 Feb",
      "authors": "Nagy MZ, Plaza-Rojas LB, Boucher JC, Kostenko E, Austin AL, Tarhini AA, Chen Z, Du D, Ojwang' AME, Davis J, Obermayer A, Rejniak KA, Shaw TI, Guevara-Patino JA",
      "journal": "J Immunother Cancer"
    },
    {
      "title": "ShinyEvents: harmonizing longitudinal data for real world survival estimation",
      "pubmed_id": "40799741",
      "pmc_id": "PMC12340904",
      "year": "2025",
      "publication_date": "2025 Aug",
      "authors": "Obermayer A, Davis J, Talada DP, Teng M, Eschrich S, Yin V, Spakowicz D, Dhrubo D, Rounbehler RJ, Churchman ML, Tarhini AA, Wang X, Gupta S, Markowitz J, Goecks J, Li R, Rodriguez-Pessoa R, Manley BJ, Tan AC, Grass GD, Chen DT, Shaw TI",
      "journal": "Res Sq"
    },
    {
      "title": "Integrative Immune Signature of Complementary Circulating and Tumoral Biomarkers Maximizes the Predictive Power of Adjuvant Immunotherapeutic Benefits in High-risk Melanoma",
      "pubmed_id": "40392969",
      "pmc_id": "PMC12316551",
      "year": "2025",
      "publication_date": "2025 Aug",
      "authors": "Tarhini AA, Obermayer A, Lee SJ, LaFramboise WA, Hodi FS, Karunamurthy AD, Eljilany I, Chen DT, Hwu P, El Naqa IM, Streicher H, Sondak VK, Storkus WJ, Butterfield LH, Shaw TI, Kirkwood JM",
      "journal": "Clin Cancer Res"
    },
    {
      "title": "Durability of response to immune checkpoint blockade following treatment discontinuation and efficacy of rechallenge in advanced Merkel cell carcinoma",
      "pubmed_id": "39242118",
      "pmc_id": "PMC11381633",
      "year": "2024",
      "publication_date": "2024 Sep",
      "authors": "Ramadoss T, Nichols M, Palacios C, Eroglu Z, Markowitz J, Karapetyan L, Tarhini AA, Wuthrick EJ, Sondak VK, Khushalani NI, Tsai KY, Brohl AS",
      "journal": "J Immunother Cancer"
    },
    {
      "title": "Tenascin-C in the early lung cancer tumor microenvironment promotes progression through integrin αvβ1 and FAK",
      "pubmed_id": "39345541",
      "pmc_id": "PMC11429853",
      "year": "2024",
      "publication_date": "2024 Sep",
      "authors": "Samson SC, Rojas A, Zitnay RG, Carney KR, Hettinga W, Schaelling MC, Sicard D, Zhang W, Gilbert-Ross M, Dy GK, Cavnar MJ, Furqan M, Browning RF, Naqash AR, Schneider BP, Tarhini A, Tschumperlin DJ, Venosa A, Marcus AI, Emerson LL, Spike BT, Knudsen BS, Mendoza MC",
      "journal": "bioRxiv"
    }
  ],
  "grants": [
    {
      "description": "Title: Predictors of Immunotherapeutic Benefits in Patients with Advanced Solid Tumors Treated with Immune Checkpoint Inhibitors  \nAward Number: N/A  \nSponsor: COMMUNITY FOUNDATION OF TAMPA  \nTarhini, A. (PD/PI)",
      "title": "Predictors of Immunotherapeutic Benefits in Patients with Advanced Solid Tumors Treated with Immune Checkpoint Inhibitors",
      "sponsor": "COMMUNITY FOUNDATION OF TAMPA",
      "investigators": [
        {
          "name": "Tarhini, A.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Inherited genetic variation as a predictor of the risk of immune related adverse events and the likelihood of clinical benefit  \nAward Number: 23B09  \nSponsor: Florida Department of Health  \nTarhini, A. (PD/PI)",
      "title": "Inherited genetic variation as a predictor of the risk of immune related adverse events and the likelihood of clinical benefit",
      "award_number": "23B09",
      "sponsor": "Florida Department of Health",
      "investigators": [
        {
          "name": "Tarhini, A.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "participating_trials": [
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-20494/",
      "trial_id": "20494",
      "title": "A Phase II Study of High Dose Bolus IL2 in Combination with Low Dose Ipilimumab Followed Sequentially by Nivolumab in Patients with Inoperable Stage III or Stage IV Melanoma Who Have Failed Prior Anti-PD1 Immunotherapy",
      "condition": "Cutaneous",
      "intervention": "Aldesleukin (Interleukin-2); BMS-936558 (Nivolumab); IL-2 (Interleukin-2); Interleukin-2 (); Ipilimumab (); Nivolumab (Opdivo); Proleukin (Interleukin-2); Yervoy (Ipilimumab)",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-21239/",
      "trial_id": "21239",
      "title": "Randomized Phase II/III Study of Nivolumab plus Ipilimumab plus Sargramostim versus Nivolumab plus Ipilimumab in Patients with Unresectable Stage III or Stage IV Melanoma",
      "condition": "Cutaneous",
      "intervention": "BMS-936558 (Nivolumab); Ipilimumab (); Nivolumab (Opdivo); Sargramostim (); Yervoy (Ipilimumab)",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-21341/",
      "trial_id": "21341",
      "title": "A Phase II Study of Cemiplimab plus Ziv-Aflibercept for Subjects with Metastatic Uveal Melanoma",
      "condition": "Cutaneous",
      "intervention": "Cemiplimab (); REGN2810 (Cemiplimab); Ziv-aflibercept ()",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-22574/",
      "trial_id": "22574",
      "title": "Neoadjuvant and Adjuvant Anti-PD1 or Combinations for Locoregionally Advanced Melanoma",
      "condition": "Cutaneous",
      "intervention": "BMS-936558 (Nivolumab); BMS-986016 (Relatlimab); Ipilimumab (); Nivolumab (Opdivo); Relatlimab (); Yervoy (Ipilimumab)",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23240/",
      "trial_id": "23240",
      "title": "A Phase 1, Open Label Single-Arm Two-Part Study to Investigate Safety, Pharmacokinetics, and Preliminary Efficacy Of Pan-RAF/MEK Glue NST-628 Oral Tablets in Subjects with Solid Tumors Harboring Genetic Alterations in the MAPK Pathway And With Other Solid Tumors",
      "condition": "Cutaneous",
      "intervention": "NST-628 ()",
      "status": "OPEN (SUSPENDED)"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23460/",
      "trial_id": "23460",
      "title": "A Multicenter Phase I/Ib Dose Escalation Study of WTX-124 as Monotherapy and in Combination with Pembrolizumab in Patients with Selected Advanced or Metastatic Solid Tumors",
      "condition": "Cutaneous",
      "intervention": "Pembrolizumab (Keytruda)",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23475/",
      "trial_id": "23475",
      "title": "A Phase 1/2 Study of OR502 Alone and in Combination with other Anti-cancer Agents in Subjects with Advanced Malignancies",
      "condition": "Cutaneous",
      "intervention": "Cemiplimab (); OR502 (); REGN2810 (Cemiplimab)",
      "status": "Open"
    }
  ],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/TarhiniAhmad_24764.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=24764"
  },
  "content_hash": "e117e8f601f1113536a4a2ebdcde4186fdfc8541223e722f5f48c708140393b2",
  "researcher_name": "ahmad tarhini",
  "department": "immunology"
}