{
  "profile_url": "https://www.moffitt.org/research-science/researchers/aleksandra-karolak",
  "last_updated": "2025-10-19T00:28:47.395051",
  "researcher_id": "16049",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "Machine Learning",
  "research_program": "Molecular Medicine Program",
  "overview": "Dr. Karolak’s background includes application and development of tools from the fields of computational and biophysical chemistry, structural biology, mathematical oncology, machine learning, and information theory. Her interests focus on understanding cancer development, progression, and variability in the response to treatment using models that can be translated into the clinic. She will be leading the application of machine learning in computational biology and drug discovery as part of the Molecular Medicine Program.",
  "research_interests": [
    "Dr. Karolak’s background includes application and development of tools from the fields of computational and biophysical chemistry, structural biology, mathematical oncology, machine learning, and information theory. Her interests focus on understanding cancer development, progression, and variability in the response to treatment using models that can be translated into the clinic. She will be leading the application of machine learning in computational biology and drug discovery as part of the Molecular Medicine Program.\n  *"
  ],
  "associations": [
    "Machine Learning",
    "Gastrointestinal Oncology",
    "Molecular Medicine Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of South Florida, PhD"
    },
    {
      "type": "Graduate",
      "institution": "Adam Mickiewicz University, MSc"
    }
  ],
  "publications": [
    {
      "title": "Davis EW, Park MA, Basinski TL, Arnoletti JP, Bloomston M, Carson TL, Biachi De Castria T, Chen DT, Cortizas EM, Crowder SL, Genilo-Delgado M, Douglas WG, Huguet KL, Jiang K, Hodul PJ, Karolak A, Kim DW, Koomen JM, Menon AA, Mo Q, Mok SR, Molina-Vega MA, Moreno-Urazan L, Ahmed S, Parker NH, Pimiento JM, Rasool G, Sparks LM, Stewart PA, Tassielli AF, Teer JK, Trevino JG, Velanovich V, Wang X, Whelan CJ, Judge SM, Judge AR, Fleming JB, Malafa MP, Jeong D, Permuth JB. The Impact of Edema on Skeletal Muscle Changes among Patients with Pancreatic Ductal Adenocarcinoma. Cancer Epidemiol Biomarkers Prev",
      "pubmed_id": "40553455",
      "year": "2025",
      "journal": "34(9):1609-1617",
      "authors": ""
    },
    {
      "title": "Nguyen T, Karolak A. Transformer graph variational autoencoder for generative molecular design. Biophys J",
      "pubmed_id": "39885689",
      "year": "2025",
      "authors": ""
    },
    {
      "title": "Wojtulewski A, Sikora A, Dineen S, Raoof M, Karolak A. Using artificial intelligence and statistics for managing peritoneal metastases from gastrointestinal cancers. Brief Funct Genomics",
      "pubmed_id": "39736152",
      "pmc_id": "PMC11735730",
      "year": "2025",
      "journal": "24",
      "authors": ""
    },
    {
      "title": "Karolak A, Urbaniak K, Monastyrskyi A, Duckett DR, Branciamore S, Stewart PA. Structure-independent machine-learning predictions of the CDK12 interactome. Biophys J",
      "pubmed_id": "38762754",
      "pmc_id": "PMC11393676",
      "year": "2024",
      "journal": "123(17):2910-2920",
      "authors": ""
    },
    {
      "title": "Sikora A, Sullivan KM, Dineen S, Raoof M, Karolak A. Emerging therapeutic approaches for peritoneal metastases from gastrointestinal cancers. Mol Ther Oncol",
      "pubmed_id": "38596287",
      "pmc_id": "PMC10873742",
      "year": "2024",
      "journal": "32(1):200767",
      "authors": ""
    },
    {
      "title": "Mukund A, Afridi MA, Karolak A, Park MA, Permuth JB, Rasool G. Pancreatic Ductal Adenocarcinoma (PDAC): A Review of Recent Advancements Enabled by Artificial Intelligence. Cancers (Basel)",
      "pubmed_id": "38927945",
      "pmc_id": "PMC11201559",
      "year": "2024",
      "journal": "16(12)",
      "authors": ""
    },
    {
      "title": "Park MA, Gumpper-Fedus K, Krishna SG, Genilo-Delgado MC, Brantley S, Hart PA, Dillhoff ME, Gomez MF, Basinski TL, Mok SR, Luthra AK, Fleming JB, Mohammadi A, Centeno BA, Jiang K, Karolak A, Jeong D, Chen DT, Stewart PA, Teer JK, Cruz-Monserrate Z, Permuth JB. Molecular Pathway and Immune Profile Analysis of IPMN-Derived Versus PanIN-Derived Pancreatic Ductal Adenocarcinomas. Int J Mol Sci",
      "pubmed_id": "39684873",
      "pmc_id": "PMC11642437",
      "year": "2024",
      "journal": "25(23)",
      "authors": ""
    },
    {
      "title": "El Naqa I, Karolak A, Luo Y, Folio L, Tarhini AA, Rollison D, Parodi K. Translation of AI into oncology clinical practice. Oncogene",
      "pubmed_id": "37684407",
      "year": "2023",
      "journal": "42(42):3089-3097",
      "authors": ""
    },
    {
      "title": "Schöning V, Khurana A, Karolak A. Editorial: Spotlight on artificial intelligence in experimental pharmacology and drug discovery. Front Pharmacol",
      "pubmed_id": "37711179",
      "pmc_id": "PMC10498275",
      "year": "2023",
      "journal": "14:1261141",
      "authors": ""
    },
    {
      "title": "Shaw TI, Zhao B, Li Y, Wang H, Wang L, Manley B, Stewart PA, Karolak A. Multi-omics approach to identifying isoform variants as therapeutic targets in cancer patients. Front Oncol",
      "pubmed_id": "36505834",
      "pmc_id": "PMC9730332",
      "year": "2022",
      "journal": "12:1051487",
      "authors": ""
    }
  ],
  "grants": [
    {
      "description": "Title: Cancer AIKG: a Web-scale Trustworthy AI-Knowledge Graph-LLM hybrid on Cancer, Constructed and Interrogated for Bias using Deep-Learning  \nAward Number: 25C06  \nSponsor: Florida State University (FSU)  \nKarolak, A. (PD/PI)"
    },
    {
      "description": "Title: Multi-omic Evaluation of Ovarian Cancer Responses to Heated Intraperitoneal Chemotherapy (HiPEC)  \nAward Number: HT9425-21-1-0342  \nSponsor: Department of Defense (DOD)  \nKarolak, A. (PD/PI)",
      "source": "DOD",
      "period": "9425-21"
    },
    {
      "description": "Title: CancerAIKG: A Web-scale Trustworthy AI-Knowledge Graph-LLM hybrid on Cancer, Constructed and Interrogated for Bias Using Deep-Learning  \nAward Number: MOABG  \nSponsor: Florida State University (FSU)  \nKarolak, A. (PD/PI)"
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/KarolakAleksandra_16049.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=16049"
  },
  "content_hash": "0ad21f5b06108d3a86ddca24e47e804dbe3ce306cc5820c70be14f500be215da",
  "researcher_name": "Aleksandra Karolak",
  "department": "Machine Learning"
}