{
  "profile_url": "https://www.moffitt.org/research-science/researchers/aleksandr-lazaryan",
  "last_updated": "2025-10-21T16:40:02.740702",
  "researcher_id": "20944",
  "degrees": [
    "MD",
    "PhD"
  ],
  "title": "",
  "primary_program": "Blood and Marrow Transplant and Cellular Immunotherapy",
  "research_program": "Immuno-Oncology Program",
  "overview": "Dr. Lazaryan has clinical and research expertise in complications of Blood and Marrow Transplantation (BMT) such as chronic graft-vs-host disease (GVHD) and Cellular Immunotherapy of lymphoid malignancies (non-Hodgkin and Hodgkin Lymphomas) with focus on Post-Transplant Lymphoproliferative Disease (PTLD) and toxicities of CAR T cell therapy. His research efforts focus on developing safer and more effective approaches for CAR T-cell utilization and exploring new therapies for chronic GVHD and post-transplant lymphoproliferative disorders (PTLD). In recognition of his work, Dr. Lazaryan has secured funding from prestigious organizations, including the NIH's Chronic GVHD Consortium and the US Department of Defense, which awarded him a grant to study immune responses in aggressive lymphomas and PTLD.",
  "research_interests": [
    "Dr. Lazaryan completed his post-graduate medical training in Internal Medicine and Hematology/Medical Oncology at the Cleveland Clinic Foundation, Ohio followed by the faculty appointment in Blood and Marrow Transplantation and hematological malignancies at the University of Minnesota. He also obtained Masters and PhD in Public Health from the State University of NY at Albany and University of Alabama in Birmingham, respectively. Since joining Moffitt in 2018, Dr. Lazaryan has been focusing his clinical and research expertise in managing complex patients with lymphoma who are in need for BMT and/or cellular immunotherapy such as CAR T cell therapy. Dr. Lazaryan has been the recipient of a research grant from the US Department of Defense to study immune responses in patients with aggressive lymphomas including recipients of solid organ transplant. He has published over 100 peer-reviewed research manuscripts in leading professional journals.\n  *"
  ],
  "associations": [
    "Blood and Marrow Transplant and Cellular Immunotherapy",
    "Immunology",
    "Immuno-Oncology Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of Alabama at Birmingham (UAB), PhD"
    },
    {
      "type": "Graduate",
      "institution": "State University of New York (SUNY), MPH"
    },
    {
      "type": "Medical School",
      "institution": "Yerevan State Medical University",
      "degree": "MD"
    },
    {
      "type": "Residency",
      "institution": "Cleveland Clinic Foundation",
      "position": "Intern",
      "specialty": "al Medical"
    },
    {
      "type": "Residency",
      "institution": "University Medical Center, YSMU",
      "specialty": "Plastic & Reconstructive Surgery"
    },
    {
      "type": "Fellowship",
      "institution": "Taussig Cancer Institute, Cleveland Clinic",
      "specialty": "Hematology and Medical Oncology"
    }
  ],
  "publications": [
    {
      "title": "Role of Donor Cytomegalovirus Serostatus in Cytomegalovirus-Seronegative Recipients of Unrelated Donor Hematopoietic Cell Transplantation with Post-Transplant Cyclophosphamide Prophylaxis",
      "pubmed_id": "40379049",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Mehta RS, Aljawai YM, Al-Juhaishi T, Saultz J, Milano F, Kanakry JA, Kanakry CG, Lazaryan A",
      "journal": "Transplant Cell Ther"
    },
    {
      "title": "Phase II Trial of Reduced-Intensity Fludarabine, Melphalan, and Total Body Irradiation Conditioning With Haploidentical Donor Peripheral Blood Stem Cell Transplant",
      "pubmed_id": "40492500",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Elmariah H, Kim J, Gonzalez R, DiMaggio E, Sansil S, Mishra A, Faramand R, Perez L, Lazaryan A, Mirza AS, Khimani F, Liu H, Ochoa-Bayona JL, Nieder M, Perna F, Figura N, Robinson TJ, Nishihori T, Anasetti C, Pidala JA, Bejanyan N",
      "journal": "Am J Hematol"
    },
    {
      "title": "Elephantiasis nostra verrucosa in sclerodermatous chronic graft-versus-host disease",
      "pubmed_id": "39936157",
      "pmc_id": "PMC11810717",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Mammadova J, Glass L, LaFave D, Pidala J, Lazaryan A",
      "journal": "JAAD Case Rep"
    },
    {
      "title": "Impact of Donor Age and Donor Cytomegalovirus Serostatus on Outcomes After Related Donor Allogeneic Hematopoietic Stem Cell Transplantation",
      "pubmed_id": "40071498",
      "year": "2025",
      "publication_date": "2025 Jun",
      "authors": "Mehta RS, Choe H, Saultz J, Gong Z, Sharma P, Al-Juhaishi T, Petitto GS, Lazaryan A, Singh A, Xue E, Dimitrova D, Hyder M, McCurdy S, Im A, Huber B, Aljawai YM, Kanakry J, Milano F, Kanakry CG",
      "journal": "Am J Hematol"
    },
    {
      "title": "Letermovir reduces cytomegalovirus in HLA-matched and mismatched allogeneic hematopoietic cell transplant patients receiving post-transplant cyclophosphamide",
      "pubmed_id": "40617898",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Schmitz J, Gaskill E, Price S, Cao B, Kim J, Baluch A, Klinkova O, Faramand R, Mishra A, Perez L, Khimani F, Lazaryan A, Ochoa-Bayona JL, Liu H, Mirza AS, Nieder M, Anasetti C, Nishihori T, Pidala JA, Bejanyan N, Elmariah H",
      "journal": "Bone Marrow Transplant"
    },
    {
      "title": "Sarcopenia and Skeletal Muscle Loss after CAR T-cell Therapy in Diffuse Large B-cell Lymphoma",
      "pubmed_id": "40238583",
      "pmc_id": "PMC12213223",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Jhaveri K, Thapa R, Ercan D, Saha A, Noble J, Singh P, Fahrmann J, Saini N, Wu R, Dennison JB, Hanash S, Jenq RR, Modi K, Figura N, Chavez J, Shah B, Nishihori T, Lazaryan A, Khimani F, Bachmeier C, Gage K, Mishra A, Perna F, Davila ML, Spiegel J, Rejeski K, Subklewe M, Locke FL, Freeman C, Parker N, Jain MD",
      "journal": "Clin Cancer Res"
    },
    {
      "title": "Itacitinib for the prevention of IEC therapy-associated CRS: results from the 2-part phase 2 INCB 39110-211 study",
      "pubmed_id": "40090005",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Frigault MJ, Maziarz RT, Park JH, Lazaryan A, Shah NN, Svoboda J, Lekakis LJ, Reshef R, Phillips CL, Burke L, Lei J, Pratta M, Morariu-Zamfir R, DiPersio JF",
      "journal": "Blood"
    },
    {
      "title": "Comparison of Outcomes of Haploidentical Peripheral Blood Stem Cell Transplantation with Post-Transplant Cyclophosphamide in Older Versus Younger Patients",
      "pubmed_id": "39858092",
      "pmc_id": "PMC11763395",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Adoncecchi G, Kumar A, Mogili K, Faramand R, Liu H, Khimani F, Mishra A, Nieder M, Nishihori T, Hansen D, Jain M, Lazaryan A, Perez L, Pidala J, Locke F, Anasetti C, Bejanyan N, Elmariah H",
      "journal": "Cancers (Basel)"
    },
    {
      "title": "Efficacy and Safety of Belumosudil as Compared with Best Available Therapy for the Treatment of cGVHD in the US",
      "pubmed_id": "40875591",
      "year": "2025",
      "publication_date": "2025 Aug",
      "authors": "Hall K, Lazaryan A, Der Laan MV, Lee CJ, Logan AC, Gruber S, Kabadi S, Khan I, Nicholls C, Rota LM, Nikai E, Ponomareva E, Koumas A, Waller EK",
      "journal": "Blood Adv"
    },
    {
      "title": "Intravenous Immunoglobulin (IVIG) for Patients with Severe Neurotoxicity Associated with Chimeric Antigen Receptor T-Cell (CAR-T) Therapy",
      "pubmed_id": "40332772",
      "pmc_id": "PMC12028060",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Mokhtari S, Asquith JM, Kareem SS, Bachmeier CA, Pina Y, Faramand RG, Kim Y, Peguero EN, Sahebjam S, Jaffer MH, Iacono DP, Jain MD, Vogelbaum MA, Davila ML, Forsyth PA, Locke FL, Lazaryan A",
      "journal": "Int J Mol Sci"
    }
  ],
  "grants": [
    {
      "description": "Title: Promoting an Effective Immune Response in Lymphoma  \nAward Number: W81XWH1810651  \nSponsor: Department of Defense (DOD)  \nLazaryan, A. (PD/PI)",
      "title": "Promoting an Effective Immune Response in Lymphoma",
      "award_number": "W81XWH1810651",
      "sponsor": "Department of Defense (DOD)",
      "source": "DOD",
      "investigators": [
        {
          "name": "Lazaryan, A.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers/LazaryanAleksandr_20944.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=20944"
  },
  "content_hash": "4df42b128730a642ce66474b821262d7205c6d93b8ab07336a212f00ca88c8af",
  "researcher_name": "Aleksandr Lazaryan",
  "department": "Immunology"
}