{
  "profile_url": "https://www.moffitt.org/research-science/researchers/alicia-best/",
  "last_updated": "2025-11-21T22:50:22.492340",
  "researcher_id": "16587",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "",
  "research_program": "health outcomes & behavior",
  "overview": "",
  "research_interests": [
    "Dr. Alicia Best is an Assistant Professor in the Department of Community and Family Health in the College of Public Health at the University of South Florida (USF). She is a socio-behavioral researcher and certified health education specialist (CHES) with academic training and experience in health education and promotion, health communications, and cancer-related health disparities. Dr. Best earned an MPH in Health Education and Health Promotion from Morehouse School of Medicine, as well as a PhD in Health Promotion, Education, and Behavior and a Certificate of Graduate Study in Health Communications from the University of South Carolina’s Arnold School of Public Health. She also received postdoctoral training in behavioral research with a focus on cancer disparities at the American Cancer Society. Dr. Best conducts original research focused on the role of social and cultural factors in health cognitions, health behaviors, and health-related quality of life. She is also interested in the use of communication strategies to better reach marginalized groups. To this end, her work has focused on mechanisms through which spiritualty impacts the effectiveness of breast cancer screening messages among African American women, as well as how spirituality influences self-rated health among cancer survivors. Her research extends beyond measuring health disparities to the actual implementation and evaluation of interventions designed to improve the health of underserved communities. Prior to joining USF, Dr. Best served as Director of Research and Community Health at a Federally Qualified Health Center (FQHC) in one of Metropolitan Atlanta’s most disadvantaged neighborhoods. She has extensive experience in community health education, community-engaged research, and health promotion program implementation and evaluation within underserved communities.\n  *"
  ],
  "associations": [
    "Health Outcomes & Behavior Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "Morehouse School of Medicine, MPH"
    },
    {
      "type": "Graduate",
      "institution": "University of South Carolina Arnold School of Medicine, PhD"
    }
  ],
  "publications": [
    {
      "title": "Understanding Disclosure Decisions and Communication About HPV-Related Cancer: A Qualitative Exploration of Stigma and Social Support",
      "pubmed_id": "40361744",
      "pmc_id": "PMC12071953",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Villalona S, Sanchez J, Mangkalard P, Best AL",
      "journal": "Healthcare (Basel)"
    },
    {
      "title": "Racial, Lifestyle, and Healthcare Contributors to Perceived Cancer Risk among Physically Active Adolescent and Young Adult Women Aged 18-39 Years",
      "pubmed_id": "37174256",
      "pmc_id": "PMC10177863",
      "year": "2023",
      "publication_date": "2023 May",
      "authors": "Brown JA, Alalwan MA, Absie S, Korley ND, Parvanta CF, Meade CM, Best AL, Gwede CK, Ewing AP",
      "journal": "Int J Environ Res Public Health"
    },
    {
      "title": "Rethinking the Moral Authority of Experience: Critical Insights and Reflections from Black Women Scholars",
      "pubmed_id": "36595006",
      "year": "2023",
      "publication_date": "2023 Jan",
      "authors": "Fletcher FE, Lapite FC, Best A",
      "journal": "Am J Bioethics"
    },
    {
      "title": "Understanding Cancer Screening Intention Among Physically Active Adults Ages 18-49",
      "pubmed_id": "35112296",
      "year": "2023",
      "publication_date": "2023 Apr",
      "authors": "Ewing AP, Alalwan MA, Best AL, Parvanta CF, Coughlin EC, Dorn JM, Levin BL, Meade CD, Gwede CK",
      "journal": "J Cancer Educ"
    },
    {
      "title": "Anti-Black Racism and Power: Centering Black Scholars to Achieve Health Equity",
      "pubmed_id": "35470882",
      "year": "2022",
      "publication_date": "2022 Mar",
      "authors": "Best AL",
      "journal": "Hastings Cent Rep"
    },
    {
      "title": "Structural Racism and Cancer: Calls to Action for Cancer Researchers to Address Racial/Ethnic Cancer Inequity in the United States",
      "pubmed_id": "35642391",
      "pmc_id": "PMC9306268",
      "year": "2022",
      "publication_date": "2022 Jun",
      "authors": "Best AL, Roberson ML, Plascak JJ, Peterson CE, Rogers CR, Hastert TA, Molina Y",
      "journal": "Cancer Epidemiol Biomarkers Prev"
    },
    {
      "title": "Physically fit with a higher cancer risk? Influences of cervical cancer screening among a sample of physically active women ages 21-49 living in the United States",
      "pubmed_id": "36157713",
      "pmc_id": "PMC9494240",
      "year": "2022",
      "publication_date": "2022 Dec",
      "authors": "Ewing AP, Alalwan MA, Brown JA, Adekunle TE, Korley ND, Nafiu TC, Coughlin EC, Parvanta CP, Meade CD, Gwede CK, Best AL",
      "journal": "Prev Med Rep"
    },
    {
      "title": "Improve the Quality of Life Related to HIV and the Black Community: HIV and AIDS Inequity in the Black Community: Proximal Solutions to Distal Determinants",
      "pubmed_id": "36818206",
      "pmc_id": "PMC9930518",
      "year": "2021",
      "publication_date": "2021 Nov",
      "authors": "Best AL, Wynn A, Ogbu CE, Nixon S",
      "journal": "J Healthc Sci Humanit"
    },
    {
      "title": "Antiracist Praxis in Public Health: A Call for Ethical Reflections",
      "pubmed_id": "33840102",
      "pmc_id": "PMC9009418",
      "year": "2021",
      "publication_date": "2021 Mar",
      "authors": "Fletcher FE, Jiang W, Best AL",
      "journal": "Hastings Cent Rep"
    },
    {
      "title": "Institutional Distrust among African Americans and Building Trustworthiness in the COVID-19 Response: Implications for Ethical Public Health Practice",
      "pubmed_id": "33678683",
      "pmc_id": "PMC7988507",
      "year": "2021",
      "publication_date": "2021 Feb",
      "authors": "Best AL, Fletcher FE, Kadono M, Warren RC",
      "journal": "J Health Care Poor Underserved"
    }
  ],
  "grants": [],
  "participating_trials": [],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=16587"
  },
  "content_hash": "319835117420f38bdd375526fd86f5ee9e2f7f956d5127705875468219eca3d6",
  "researcher_name": "alicia best",
  "department": ""
}