{
  "profile_url": "https://www.moffitt.org/research-science/researchers/amir-alishahi-tabriz/",
  "last_updated": "2025-11-21T22:50:22.600506",
  "researcher_id": "27667",
  "degrees": [
    "MD",
    "PhD"
  ],
  "title": "",
  "primary_program": "health outcomes and behavior",
  "research_program": "health outcomes & behavior",
  "overview": "Dr Alishahi is a physician, implementation scientist, and health services researcher. His research centers on developing, implementing and evaluating interventions to reduce unplanned emergency department visits and hospital admissions among patients with cancer.",
  "research_interests": [
    "1-Development of machine-learning modeling to predict 30-day unplanned hospital readmissions in adult patients with Gastrointestinal cancers. 2-Assess the effectiveness, feasibility, appropriateness, and acceptability of a remote symptom monitoring application among adult patients with cancer.3-Assess safety and efficacy of flexibly dosed esketamine nasal spray on depression and suicidality among diverse racial and ethnic patients with moderately to severely depression with pancreatic cancer. \n  *"
  ],
  "associations": [
    "Health Outcomes and Behavior",
    "Gastrointestinal Oncology",
    "Health Outcomes & Behavior Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of North Carolina at Chapel Hill, PhD"
    },
    {
      "type": "Graduate",
      "institution": "University of North Carolina at Chapel Hill, MPH"
    },
    {
      "type": "Medical School",
      "institution": "Shahid Beheshti University of Medical Sciences, Tehran, Iran",
      "degree": "MD"
    },
    {
      "type": "Fellowship",
      "institution": "UNC Eshlman School of Pharmacy, University of North Carolina",
      "specialty": "Cancer Care Delivery"
    }
  ],
  "publications": [
    {
      "title": "Comfort With Sharing Food Insecurity Risk for Clinical Care Among Individuals With and Without a Cancer History: Findings From a National Survey",
      "pubmed_id": "40910030",
      "pmc_id": "PMC12405682",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Benyahia SA, Torikashvili J, Paturu T, Mikhael M, Nguyen OT, Islam JY, Tabriz AA, Hong YR, Turner KL",
      "journal": "AJPM Focus"
    },
    {
      "title": "Participation in Electronic Patient-Reported Outcome Measures Collection as a Part of Routine Supportive Care Delivery in Oncology",
      "pubmed_id": "40043232",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Katoju S, Nguyen OT, Rajasekhara S, Hong YR, Alishahi Tabriz A, Turner K",
      "journal": "JCO Oncol Pract"
    },
    {
      "title": "Early Supportive and Nutritional Care For Adults With Pancreatic Cancer: A Pilot Study",
      "pubmed_id": "40816695",
      "year": "2025",
      "publication_date": "2025 Nov",
      "authors": "Lin YC, Turner K, Rajasekhara S, Kim DW, de Castria TB, Nguyen OT, Hume E, Sprow O, Santiago C, Milano J, Riccardi D, Nardella N, Al-Jumayli M, Permuth JB, Hoffe S, Hembree T, Hong YR, Islam JY, Tabriz AA, Hodul PJ",
      "journal": "J Pain Symptom Manag"
    },
    {
      "title": "Investigating structural inequities in area-level socioeconomic and health care access measures among people with HIV and cancer (2004-2020)",
      "pubmed_id": "40305646",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Islam JY, Suneja G, Lin YC, McGee-Avila JK, Turner K, Alishahi Tabriz A, Vadaparampil ST, D'Souza G, Friedman MR, Guo Y, Camacho-Rivera M",
      "journal": "Cancer"
    },
    {
      "title": "Inequities by race and ethnicity in cancer treatment receipt among people living with HIV and cancer in the U",
      "pubmed_id": "40394520",
      "pmc_id": "PMC12090492",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Islam JY, Guo Y, McGee-Avila JK, Turner K, Tabriz AA, Lin YC, Vadaparampil ST, Coghill AE, Camacho-Rivera M, Suneja G",
      "journal": "S"
    },
    {
      "title": "Genomic classifiers and prognosis of localized prostate cancer: a systematic review",
      "pubmed_id": "38200096",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Boyer MJ, Carpenter DJ, Gingrich JR, Raman SR, Sirohi D, Tabriz AA, Rompre-Broduer A, Lunyera J, Basher F, Bitting RL, Kosinski A, Cantrell S, Gordon AM, Ear B, Gierisch JM, Jacobs M, Goldstein KM",
      "journal": "Prostate Cancer P D"
    },
    {
      "title": "Inequities in palliative care delivery to patients with HIV and stage IV cancers in the United States (2004-2020)",
      "pubmed_id": "39579085",
      "pmc_id": "PMC11897894",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Islam JY, Guo Y, Turner K, Tabriz AA, Lin YC, Vidot DC, Vadaparampil ST, Coghill AE, ScD MC, Suneja G",
      "journal": "JNCI Cancer Spectr"
    },
    {
      "title": "Mental Healthcare Utilization Among US Healthcare Workers During the COVID-19 Pandemic: Evidence from the 2020-2021 National Health Interview Survey",
      "pubmed_id": "40623224",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Nguyen OT, Merlo LJ, Turner K, Hong YR, Tabriz AA, Hanna K, Meese KA",
      "journal": "J Healthc Manag"
    },
    {
      "title": "Pre-Surgical Education and Discharge Planning for Head and Neck Cancer: A Qualitative Study of Patient and Caregiver Perspectives",
      "pubmed_id": "40228315",
      "pmc_id": "PMC12033563",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Basta A, Mikhael M, Kansara B, Hume E, Nguyen OT, Reblin M, Tabriz AA, Hong YR, Magnuson JS, Patel K, Turner K",
      "journal": "Cancer Control"
    },
    {
      "title": "Assessing the Validity of the Centers for Medicare & Medicaid Services Measure in Identifying Potentially Preventable Emergency Department Visits by Patients With Cancer",
      "pubmed_id": "39038257",
      "pmc_id": "PMC11834964",
      "year": "2025",
      "publication_date": "2025 Feb",
      "authors": "Alishahi Tabriz A, Turner K, Hemati H, Baugh C, Elston Lafata J",
      "journal": "JCO Oncol Pract"
    }
  ],
  "grants": [
    {
      "description": "Title: Technology-based symptom monitoring intervention for locally advanced head and neck cancer patients initiating chemoradiation: A pilot study  \nAward Number: 20VA011-S1.01  \nSponsor: APTAR DIGITAL HEALTH LLC  \nAlishahi T. (PD/PI)",
      "title": "Technology-based symptom monitoring intervention for locally advanced head and neck cancer patients initiating chemoradiation: A pilot study",
      "award_number": "20VA011-S1.01",
      "sponsor": "APTAR DIGITAL HEALTH LLC  \nAlishahi T. (PD/PI)"
    },
    {
      "description": "Title: Technology-Based Symptom Monitoring Intervention for Locally Advanced Head and Neck Cancer Patients Initiating Chemoradiation: A Pilot Study  \nAward Number: 20VA011, First Amendment  \nSponsor: APTAR DIGITAL HEALTH LLC  \nAlishahi T. (PD/PI)",
      "title": "Technology-Based Symptom Monitoring Intervention for Locally Advanced Head and Neck Cancer Patients Initiating Chemoradiation: A Pilot Study",
      "award_number": "20VA011, First Amendment",
      "sponsor": "APTAR DIGITAL HEALTH LLC  \nAlishahi T. (PD/PI)"
    }
  ],
  "participating_trials": [
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-22476/",
      "trial_id": "22476",
      "title": "Support through remote observation and nutrition guidance program for individuals with pancreatic cancer undergoing surgery (STRONG-PCS)",
      "condition": "Gastrointestinal Tumor",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23230/",
      "trial_id": "23230",
      "title": "Support through remote observation and nutrition guidance program for individuals with gastroesophageal cancer (STRONG-GEC)",
      "condition": "Gastrointestinal Tumor",
      "status": "Open"
    }
  ],
  "lab_page_url": "https://lab.moffitt.org/cancercaredelivery/",
  "google_scholar_url": "https://scholar.google.com/citations?user=y8tl-NoAAAAJ&hl=en",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/AlishahiTabrizAmir_27667.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=27667"
  },
  "content_hash": "3067ac8eb6f736030c028bd276f7f9b90bde1dca4ad042d126485bcd76acbbcc",
  "researcher_name": "amir alishahi tabriz",
  "department": "health outcomes & behavior"
}