{
  "profile_url": "https://www.moffitt.org/research-science/researchers/ana-gomes",
  "last_updated": "2025-10-19T00:25:40.826671",
  "researcher_id": "26666",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "Molecular Oncology",
  "research_program": "Cancer Biology & Evolution Program",
  "overview": "The Gomes Laboratory is interested in understanding how age-driven metabolic and epigenetic changes drive tumor progression and metastasis formation. http://lab.moffitt.org/gomes",
  "research_interests": [
    "The Gomes Laboratory is interested in understanding how age-driven metabolic and epigenetic changes drive tumor progression and metastasis formation. Dr. Gomes will continue her transformative research by addressing three critical questions: (1) Are there age-induced factors that affect resistance to conventional anti-cancer therapies? (2) What are the age-driven changes that occur within a tissue that may aid the progression of tumors and resistance to anti-cancer therapies? (3) Are there ways to harness this knowledge to define biomarkers of responsiveness to therapies as well as design better therapeutic strategies that factor in aging? Answering these questions will allow for the discovery of novel pathways that regulate the tumorigenic process and the development of more efficacious therapeutic strategies for aggressive cancers. \n  *"
  ],
  "associations": [
    "Gastrointestinal Oncology",
    "Molecular Oncology",
    "Breast Oncology",
    "Cancer Biology & Evolution Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "Harvard Medical School & University of Coimbra, PhD"
    },
    {
      "type": "Fellowship",
      "institution": "Harvard Medical School",
      "specialty": "Aging Biology"
    },
    {
      "type": "Fellowship",
      "institution": "Weill Cornell Medicine",
      "specialty": "Cancer Biology"
    }
  ],
  "publications": [
    {
      "title": "Lazure F, Gomes AP. Cancer progression through the lens of age-induced metabolic reprogramming. Nat Rev Cancer",
      "pubmed_id": "40646271",
      "year": "2025",
      "journal": "25(10):801-817",
      "authors": ""
    },
    {
      "title": "Beck R, Tagal V, Amin S, Bakhoum SF, Maley C, Verhaak RGW, Gomes AP, Andor N. Energetics of whole genome doubling and genomic instability. Cancer Lett",
      "pubmed_id": "40517938",
      "year": "2025",
      "journal": "630:217878",
      "authors": ""
    },
    {
      "title": "Ramamoorthi G, Lee MC, Farrell CM, Snyder C, Garg SK, Aldrich AL, Lok V, Dominguez-Viqueira W, Olson-Mcpeek SK, Rosa M, Gautam N, Pilon-Thomas S, Cen L, Kodumudi KN, Wiener D, Oskarsson T, Gomes AP, Gatenby RA, Czerniecki BJ. Antitumor CD4+ T Helper 1 Cells Target and Control the Outgrowth of Disseminated Cancer Cells. Cancer Immunol Res",
      "pubmed_id": "40249209",
      "pmc_id": "PMC12046335",
      "year": "2025",
      "journal": "13(5):729-748",
      "authors": ""
    },
    {
      "title": "Elkholi IE, Robert A, Malouf C, Wu JL, Kuasne H, Drapela S, Macleod G, Hébert S, Pacis A, Calderon V, Kleinman CL, Gomes AP, Alvarez JV, Aguirre-Ghiso JA, Park M, Angers S, Côté JF. Targeting the Dependence on PIK3C3-mTORC1 Signaling in Dormancy-Prone Breast Cancer Cells Blunts Metastasis Initiation. Cancer Res",
      "pubmed_id": "40372253",
      "pmc_id": "PMC12167933",
      "year": "2025",
      "journal": "85(12):2179-2198",
      "authors": ""
    },
    {
      "title": "De Martino D, Zapatería B, Dunne JB, Drapela S, Matteson K, Oruko D, Humphrey T, Jonhston T, Varghese BA, Riggio AI, Tiwary K, Bresnahan E, Barra J, Sowa A, Jenssen W, Sidoli S, Welm AL, Barroso M, Stallaert W, Gomes AP, Angel PM, Arias E, Bravo-Cordero JJ. Collagen hydroxylation couples NAD+/NADH dynamics to tumor dormancy and reactivation. Res Sq",
      "pubmed_id": "40671813",
      "pmc_id": "PMC12265173",
      "year": "2025",
      "authors": ""
    },
    {
      "title": "Tejero JD, Hesterberg RS, Drapela S, Ilter D, Raizada D, Lazure F, Kashfi H, Liu M, Silvane L, Avram D, Fernández-García J, Asara JM, Fendt SM, Cleveland JL, Gomes AP. Methylmalonic acid induces metabolic abnormalities and exhaustion in CD8+ T cells to suppress anti-tumor immunity. Oncogene",
      "pubmed_id": "39472497",
      "year": "2025",
      "journal": "44(2):105-114",
      "authors": ""
    },
    {
      "title": "Lazure F, Drapela S, Liu X, Lockhart JH, Kashfi H, Sarigul N, Ilter D, Flores ER, Wang X, Smalley I, Jaeger A, Yu X, Gomes AP. Aging directs the differential evolution of KRAS-driven lung adenocarcinoma. bioRxiv",
      "pubmed_id": "39896625",
      "pmc_id": "PMC11785146",
      "year": "2025",
      "authors": ""
    },
    {
      "title": "Cole AR, Buj R, Uboveja A, Levasseur E, Wang H, Kedziora KM, Chatoff A, Huacachino AA, Marcinkiewicz MM, Amalric A, Yang B, Tangudu NK, Danielson J, Elwah A, White S, Li D, Wallace CT, Lazure F, Elishaev E, Borho L, Jazwinska DE, Laird MS, Atiya H, Bitler BG, Dangaj D, Coffman LG, Tseng G, Oesterreich S, Gomes AP, Gurkar AU, Schopfer FJ, Modugno F, Watkins SC, Zervantonakis IK, Stallaert W, Hempel N, Snyder NW, Aird KM. The chemotherapy-induced senescence-associated secretome promotes cell detachment and metastatic dissemination through metabolic reprogramming. bioRxiv",
      "pubmed_id": "40832218",
      "pmc_id": "PMC12363692",
      "year": "2025",
      "authors": ""
    },
    {
      "title": "Drapela S, Garcia BM, Gomes AP, Correia AL. Metabolic landscape of disseminated cancer dormancy. Trends Cancer",
      "pubmed_id": "39510896",
      "pmc_id": "PMC11981868",
      "year": "2025",
      "journal": "11(4):321-333",
      "authors": ""
    },
    {
      "title": "Nowicka Z, Rentzeperis F, Tagal V, Teer JK, Ilter D, Beck RJ, Cole JP, Forero Pinto AM, Tejero JD, Scanu E, Veith T, Dominguez-Viqueira W, Maksin K, Carrillo-Perez FM, Gevaert O, Xu X, Karreth FA, Abdalah MA, Fiandaca G, Pasetto S, Prabhakaran S, Schultz A, Ojwang' AME, Barnholtz-Sloan JS, Farinhas JM, Gomes AP, Katira P, Andor N. Interactions between Ploidy and Resource Availability Shape Clonal Evolution in Glioblastoma. Cancer Res",
      "pubmed_id": "39933186",
      "year": "2025",
      "journal": "85(8):1544-1559",
      "authors": ""
    }
  ],
  "grants": [
    {
      "description": "Title: Metabolic vulnerabilities of dormant disseminated breast cancer cells  \nAward Number:   \nSponsor: METAVIVOR RESEARCH AND SUPPORT  \nDa S. (PD/PI)"
    },
    {
      "description": "Title: CD320-mediated vitamin B12 uptake in triple negative breast cancer  \nAward Number:   \nSponsor: FLORIDA BREAST CANCER  \nDa S. (PD/PI)"
    },
    {
      "description": "Title: Epigenetic and Metabolic Bottlenecks of Tumorigenesis  \nAward Number: R01CA279023-01A1  \nSponsor: National Cancer Institute (NCI)  \nDa S. (PD/PI)",
      "source": "NCI",
      "period": "9023-01"
    },
    {
      "description": "Title: Adaptations of breast cancer metastasis to the aging lung  \nAward Number: 1R21AG083720-01  \nSponsor: National Cancer Institute (NCI)  \nDa S. (PD/PI)",
      "source": "NCI",
      "period": "3720-01"
    },
    {
      "description": "Title: AGING AS A SELECTIVE PRESSURE THAT DRIVES TUMOR PROGRESSION  \nAward Number: 4DP2AG077698-02  \nSponsor: National Cancer Institute (NCI)  \nDa S. (PD/PI)",
      "source": "NCI",
      "period": "7698-02"
    },
    {
      "description": "Title: Metabolic factors that condition breast cancer metastasis  \nAward Number: 24B03  \nSponsor: Florida Department of Health  \nDa S. (PD/PI)"
    },
    {
      "description": "Title: Epigenetic mechanisms that underlie breast cancer dormancy  \nAward Number: RSG-22-164-01-MM  \nSponsor: American Cancer Society, Inc. (ACS)  \nDa S. (PD/PI)",
      "source": "American Cancer Society"
    },
    {
      "description": "Title: How the aging tumor microenvironment affects outgrowth of leptomeningeal metastases  \nAward Number: TLC-23-1180696-01-TLC  \nSponsor: American Cancer Society, Inc. (ACS)  \nDa S. (PD/PI)",
      "source": "American Cancer Society",
      "period": "0696-01"
    },
    {
      "description": "Title: Defining the age-induced metabolic liabilities of lung adenocarcinoma  \nAward Number:   \nSponsor: Support Accounts-Oper  \nDa S. (PD/PI), Jiang, C. (PD/PI)"
    },
    {
      "description": "Title: Mechanisms of aging-induced differential evolution of KRAS-driven lung adenocarcinoma  \nAward Number: 1443630  \nSponsor: American Lung Association  \nDa S. (), Lazure, F. (PD/PI)"
    },
    {
      "description": "Title: How the aging tumor microenvironment affects development of leptomeningeal metastases  \nAward Number:   \nSponsor: Florida Department of Health  \nDa S. (PD/PI), Smalley, I. (PD/PI)"
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/GomesAna_26666.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=26666"
  },
  "content_hash": "ac42419a18471cb6f361663f6d14bbae9220464d4633e6c396012942f3da4b04",
  "researcher_name": "Ana Gomes",
  "department": "Molecular Oncology"
}