{
  "profile_url": "https://www.moffitt.org/research-science/researchers/anna-coghill",
  "last_updated": "2025-10-19T00:26:31.874655",
  "researcher_id": "22486",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "Cancer Epidemiology",
  "research_program": "Cancer Epidemiology Program",
  "overview": "Antiretroviral therapy has proven to be remarkably effective at improving overall survival in people living with HIV (PLWH). One unintended correlate of this longevity is a growing burden of chronic diseases such as cancer in patients with HIV. In fact, cancer is now the second leading cause of death in PLWH. My research program focuses on the intersection between HIV and cancer, including projects to identify immunological and healthcare-associated factors in PLWH that may be associated with clinical outcomes in these patients.",
  "research_interests": [
    "Anna E. Coghill, PhD, MPH is an Assistant Member in the Cancer Epidemiology Program at the H. Lee Moffitt Cancer Center & Research Institute. Her interest in the intersection between infectious agents and cancer began during her dissertation work focusing on HIV as a determinant of cancer patient survival at the UCI/Hutchinson Cancer Center Alliance in Uganda. This work suggested that HIV was not only related to cancer development but that it also played a role in how patients survived after a cancer diagnosis. Dr. Coghill’s publications using the HIV/AIDS Cancer Match Study and National Cancer Database, as well as collaborations with the Brazilian National Cancer Institute, have established that HIV-infected cancer patients experience worse stage-specific survival that their HIV-uninfected counterparts. Her research program is now focused on identifying both healthcare-related and molecular reasons for this survival disparity, and she serves as the Moffitt Site Principal Investigator for the AIDS Malignancy Consortium, an NCI-funded clinical trials network to support innovative cancer prevention and treatment trials for PLWH and cancer. \n  *"
  ],
  "associations": [
    "Cancer Epidemiology",
    "Gastrointestinal Oncology",
    "Cancer Epidemiology Program",
    "Center for Immunization & Infection Research in Cancer"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of Washington, PhD"
    },
    {
      "type": "Graduate",
      "institution": "Emory University, MPH"
    },
    {
      "type": "Fellowship",
      "institution": "NIH/National Cancer Institute",
      "specialty": "Infections/Immunoepidemiology"
    }
  ],
  "publications": [
    {
      "title": "Zhang W, Zhou Q, Nguyen JV, Egal E, Yang Q, Freeman MR, Hu-Lieskovan S, Suneja G, Coghill A, Knudsen BS. Comparison of QuPath and HALO platforms for analysis of the tumor microenvironment in prostate cancer. Lab Invest",
      "pubmed_id": "41005710",
      "year": "2025",
      "journal": "104246",
      "authors": ""
    },
    {
      "title": "Jackson SS, Francis J, Pfeiffer RM, Proietti C, Coghill AE, Yu KJ, Sarathkumara YD, Hsu WL, Argirion I, Wang CP, Chen CJ, Rothman N, Lan Q, Hildesheim A, Doolan DL, Liu Z. Sex Differences in Anti-Epstein-Barr Virus Antibody Responses. J Infect Dis",
      "pubmed_id": "39932888",
      "pmc_id": "PMC12372535",
      "year": "2025",
      "journal": "232(4):e671-e675",
      "authors": ""
    },
    {
      "title": "Coghill AE, Van Bibber N, Baiocchi RA, Arnold SM, Riedlinger G, Schneider BP, Zhang Y, Suneja G, Gomez Fontela M, Abate-Daga D, Teer JK. Elevated Tumor Mutation Burden in Cancer Patients with Underlying HIV Infection: Data from the Oncology Research Information Exchange Network (ORIEN). Cancer Epidemiol Biomarkers Prev",
      "pubmed_id": "40019488",
      "pmc_id": "PMC12048233",
      "year": "2025",
      "journal": "34(5):774-779",
      "authors": ""
    },
    {
      "title": "Islam JY, Guo Y, McGee-Avila JK, Turner K, Tabriz AA, Lin YC, Vadaparampil ST, Coghill AE, Camacho-Rivera M, Suneja G. Inequities by race and ethnicity in cancer treatment receipt among people living with HIV and cancer in the U.S. (2004-2020). BMC Cancer",
      "pubmed_id": "40394520",
      "pmc_id": "PMC12090492",
      "year": "2025",
      "journal": "25(1):897",
      "authors": ""
    },
    {
      "title": "Islam JY, Zhou X, Baggett C, Jamjian C, Coghill A, Suneja G, Lund JL. Potential drug-drug interactions between cancer therapies and active antiretroviral treatments among Medicare-enrolled patients with cancer and HIV. Geriatr Oncol",
      "pubmed_id": "39592281",
      "year": "2025",
      "journal": "16(2):102158",
      "authors": ""
    },
    {
      "title": "Islam JY, Guo Y, Turner K, Tabriz AA, Lin YC, Vidot DC, Vadaparampil ST, Coghill AE, ScD MC, Suneja G. Inequities in palliative care delivery to patients with HIV and stage IV cancers in the United States (2004-2020). JNCI Cancer Spectr",
      "pubmed_id": "39579085",
      "pmc_id": "PMC11897894",
      "year": "2025",
      "journal": "9(2)",
      "authors": ""
    },
    {
      "title": "Fenlon J, Van Bibber N, Mahlow J, Yamoah K, Soupir AC, Nguyen JV, Moran Segura C, Spivak AM, Knudsen BS, Zhou Q, Hu-Lieskovan S, Puri S, Zhang W, DeRose YS, Suneja G, Coghill AE. Human Immunodeficiency Virus-Associated Differences in the Tumor Immune Microenvironment of Lung, Breast, and Prostate Cancers. Cancer Epidemiol Biomarkers Prev",
      "pubmed_id": "40183760",
      "pmc_id": "PMC12133412",
      "year": "2025",
      "journal": "34(6):860-867",
      "authors": ""
    },
    {
      "title": "Coghill AE, Thompson Z, Bamford L, Burkholder G, Enron J, Gopal S, Kitahata MM, Mayer KH, Moore R, Yendewa G, Dickey BL, Yanik E, Achenbach C. The association of immunosuppression and HIV control with Kaposi sarcoma among patients on antiretroviral therapy. Aids",
      "pubmed_id": "40704994",
      "year": "2025",
      "authors": ""
    },
    {
      "title": "Yoder AK, Thomas RJ, Huang A, Mandalapu A, Roque DM, Bowles K, Albuquerque K, Son C, Ludwig MS, Levinson K, Coghill AE, Chiao EY, Lin LL. Cervical Cancer Outcomes in Women With HIV in the Age of Antiretroviral Therapy. JAMA Netw Open",
      "pubmed_id": "40815516",
      "pmc_id": "PMC12357181",
      "year": "2025",
      "journal": "8(8):e2527389",
      "authors": ""
    },
    {
      "title": "Scholte LLS, Mello ES, Ibrahim KY, Uno M, da Costa VM, Miazima ES, Moniz CMV, de Souza GD, Amorim LO, de Souza IC, Oliveira K, Chammas R, Bowles K, Das L, Coghill AE, Rimsza L, Segurado A, Bethony JM. Advancing HIV and Cancer Research: Implementing an AIDS and Cancer Specimen Resource in Latin America. Biopreserv Biobank",
      "pubmed_id": "40780813",
      "year": "2025",
      "authors": ""
    }
  ],
  "grants": [
    {
      "description": "Title: AIDS and Cancer Specimen Resource (ACSR)  \nAward Number: 3UM1CA181255-10S1  \nSponsor: National Cancer Institute (NCI)  \nCoghill, A. (PD/PI)",
      "source": "NCI",
      "period": "1255-10"
    },
    {
      "description": "Title: HIV Genomic Aging Project in Oncology (HIV-GAP)  \nAward Number: 5R01CA268973-04  \nSponsor: National Cancer Institute (NCI)  \nCoghill, A. (PD/PI), Johnson, N. (PD/PI)",
      "source": "NCI",
      "period": "8973-04"
    },
    {
      "description": "Title: AIDS Malignancy Consortium (AMC)  \nAward Number: 5UM1CA121947-18  \nSponsor: National Cancer Institute (NCI)  \nCoghill, A. (PD/PI)",
      "source": "NCI",
      "period": "1947-18"
    },
    {
      "description": "Title: The Impact of Biologic Aging on Immunity-Related Cervical Cancer Outcome Disparities Among Women Living with HIV in Zambia  \nAward Number: 5R01CA284623-02  \nSponsor: National Cancer Institute (NCI)  \nCoghill, A. (PD/PI)",
      "source": "NCI",
      "period": "4623-02"
    },
    {
      "description": "Title: Evaluating the role of structural racism on cancer outcomes among People Living with HIV and Cancer  \nAward Number:   \nSponsor: Foundation Support-Rsch  \nIslam, J. (PD/PI), Coghill, A. (Co-PD/PI)",
      "source": "Foundation"
    },
    {
      "description": "Title: Leveraging Electronic Health Record Clinical Notes to Understand Cancer Care Equity Among People with HIV and Cancer at Moffitt Cancer Center  \nAward Number:   \nSponsor: Support Accounts-Oper  \nRasool, G. (PD/PI), Coghill, A. (Co-PD/PI), Islam, J. (Co-PD/PI)"
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/CoghillAnna_22486.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=22486"
  },
  "content_hash": "5bb1587b9147f5f36d33cc7975579e20417721d911eff20f196428fc70362196",
  "researcher_name": "Anna Coghill",
  "department": "Cancer Epidemiology"
}