{
  "profile_url": "https://www.moffitt.org/research-science/researchers/ariosto-silva",
  "last_updated": "2025-10-21T16:33:22.879478",
  "researcher_id": "4634",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "Metabolism and Physiology",
  "research_program": "Cancer Biology & Evolution Program",
  "overview": "My focus is in the evolutioanry dynamics and molecular mechanisms driving progression and therapy resistance in cancer, more specifically multiple myeloma.",
  "research_interests": [
    "Evolution of tumor invasiveness and adaptive tumor microenvironment particularly in multiple myeloma; cancer metabolism\n  *"
  ],
  "associations": [
    "Metabolism and Physiology",
    "Pentecost Family Myeloma Research Center",
    "Cancer Biology & Evolution Program",
    "Cancer Imaging & Technology Center of Excellence",
    "Experimental Therapeutics Program",
    "Center of Excellence for Evolutionary Therapy"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "Universidade Estadual Campinas- Unicamp, Brazil, PhD"
    },
    {
      "type": "Fellowship",
      "institution": "Moffitt Cancer Center",
      "specialty": ""
    }
  ],
  "publications": [
    {
      "title": "Developing SEMA4A-directed CAR T cells to overcome low BCMA antigen density in multiple myeloma",
      "pubmed_id": "41072416",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Di Meo F, Albano F, Cesarano A, Wang Y, Kale B, Shain K, Silva A, Kurihara N, Tenshin H, Jellyman D, Song X, Ghaffari S, Mesa H, Creelan B, Freeman C, Zhao X, Meads MB, Rodriguez PC, Marino S, Locke F, Hwu P, Roodman D, Mansilla-Soto J, Perna F",
      "journal": "Cancer Cell"
    },
    {
      "title": "Acid ceramidase controls proteasome inhibitor resistance and is a novel therapeutic target for the treatment of relapsed/refractory multiple myeloma",
      "pubmed_id": "39633543",
      "pmc_id": "PMC12130774",
      "year": "2025",
      "publication_date": "2025 Jun",
      "authors": "Bishop RT, Li T, Sudalagunta P, Nasr M, Nyman KJ, Alugubelli RR, Meads M, Frieling J, Nerlakanti N, Tauro M, Fang B, Grant S, Koomen J, Silva AS, Shain KH, Lynch CC",
      "journal": "Haematologica"
    },
    {
      "title": "Genome-level selection in tumors as a universal marker of resistance to therapy",
      "pubmed_id": "40664650",
      "pmc_id": "PMC12263839",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Persi E, Sudalagunta PR, Wolf YI, Canevarolo RR, Damaghi M, Shain KH, Silva AS, Koonin EV",
      "journal": "Nat Commun"
    },
    {
      "title": "The Functional Transcriptomic Landscape Informs Therapeutic Strategies in Multiple Myeloma",
      "pubmed_id": "39476082",
      "pmc_id": "PMC11733535",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Sudalagunta PR, Canevarolo RR, Meads MB, Silva M, Zhao X, Cubitt CL, Sansil SS, DeAvila G, Alugubelli RR, Bishop RT, Tungesvik A, Zhang Q, Hampton O, Teer JK, Welsh EA, Yoder SJ, Shah BD, Hazlehurst L, Gatenby RA, Van Domelen DR, Chai Y, Wang F, DeCastro A, Bloomer AM, Siegel EM, Lynch CC, Sullivan DM, Alsina M, Nishihori T, Brayer J, Cleveland JL, Dalton W, Walker CJ, Landesman Y, Baz R, Silva AS, Shain KH",
      "journal": "Cancer Res"
    },
    {
      "title": "Unc-51 Like Kinase 3 (ULK3) is essential for autophagy and cell survival in multiple myeloma",
      "pubmed_id": "40831505",
      "pmc_id": "PMC12363935",
      "year": "2025",
      "publication_date": "2025 Aug",
      "authors": "Tauro M, Li T, Sudalagunta PR, Meads M, Canevarolo RR, Nerlakanti N, Alugubelli RR, Lawrence HR, Gunawan S, Ayaz M, Nareddy P, Yun SY, Shay G, Yang K, Tran TH, Bishop RT, Nasr MM, Lawrence NNJ, Schönbrunn E, Cleveland JL, Silva AS, Shain KH, Lynch CC",
      "journal": "Res Sq"
    },
    {
      "title": "Tumor burden quantified by soluble B-cell maturation antigen and metabolic tumor volume determines myeloma CAR-T outcomes",
      "pubmed_id": "39652773",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Freeman CL, Noble J, Menges M, Villanueva R, Nakashima JY, Figura NB, Tonseth RP, Idiaquez DW, Skelson L, Smith EC, Abraham-Miranda J, Corallo S, De Avila G, Castaneda Puglianini O, Liu HD, Alsina M, Nishihori T, Shain KH, Baz RC, Blue BJ, Grajales-Cruz A, Koomen JM, Atkins RM, Hansen DK, Siqueira Silva A, Kim J, Balagurunathan Y, Locke FL",
      "journal": "Blood"
    },
    {
      "title": "Epigenetic Plasticity Drives Carcinogenesis and Multi-Therapy Resistance in Multiple Myeloma",
      "pubmed_id": "40321765",
      "pmc_id": "PMC12048002",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Renatino Canevarolo R, Sudalagunta PR, Meads MB, Silva M, Zhao X, Magaletti D, Alugubelli RR, DeAvila G, Persi E, Maura F, Bell ET, Bishop RT, Cubitt CL, Sansil SS, Zhang W, Teer JK, Teng M, Yoder SJ, Siegel EM, Shah BD, Nishihori T, Hazlehurst LA, Lynch CC, Landgren O, Hampton O, Gatenby RA, Sullivan DM, Brayer JB, Dalton WS, Cleveland JL, Alsina M, Baz R, Shain KH, Silva AS",
      "journal": "Res Sq"
    },
    {
      "title": "The bone ecosystem facilitates multiple myeloma relapse and the evolution of heterogeneous drug resistant disease",
      "pubmed_id": "38503736",
      "pmc_id": "PMC10951361",
      "year": "2024",
      "publication_date": "2024 Mar",
      "authors": "Bishop RT, Miller AK, Froid M, Nerlakanti N, Li T, Frieling JS, Nasr MM, Nyman KJ, Sudalagunta PR, Canevarolo RR, Silva AS, Shain KH, Lynch CC, Basanta D",
      "journal": "Nat Commun"
    },
    {
      "title": "Combined MEK1/2 and ATR inhibition promotes myeloma cell death through a STAT3-dependent mechanism in vitro and in vivo",
      "pubmed_id": "39379134",
      "pmc_id": "PMC11650795",
      "year": "2024",
      "publication_date": "2024 Dec",
      "authors": "Li L, Hu X, Nkwocha J, Kmieciak M, Meads MB, Shain KH, Alugubelli RR, Silva AS, Mann H, Sudalagunta PR, Canevarolo RR, Zhou L, Grant S",
      "journal": "Brit J Haematol"
    },
    {
      "title": "Genomic Classification and Individualized Prognosis in Multiple Myeloma",
      "pubmed_id": "38194610",
      "pmc_id": "PMC11095887",
      "year": "2024",
      "publication_date": "2024 Apr",
      "authors": "Maura F, Rajanna AR, Ziccheddu B, Poos AM, Derkach A, Maclachlan K, Durante M, Diamond B, Papadimitriou M, Davies F, Boyle EM, Walker B, Hultcrantz M, Silva A, Hampton O, Teer JK, Siegel EM, Bolli N, Jackson GH, Kaiser M, Pawlyn C, Cook G, Kazandjian D, Stein C, Chesi M, Bergsagel L, Mai EK, Goldschmidt H, Weisel KC, Fenk R, Raab MS, Van Rhee F, Usmani S, Shain KH, Weinhold N, Morgan G, Landgren O",
      "journal": "J Clin Oncol"
    }
  ],
  "grants": [
    {
      "description": "Title: The effects of Selinexor on the MM and the immune effector cells in the context of T cell engagement  \nAward Number:   \nSponsor: KARYOPHARM THERAPEUTICS  \nShain, K. (PD/PI), Silva, A. (Co-PD/PI)",
      "title": "The effects of Selinexor on the MM and the immune effector cells in the context of T cell engagement",
      "award_number": "",
      "sponsor": "KARYOPHARM THERAPEUTICS",
      "investigators": [
        {
          "name": "Shain, K.",
          "role": "PD/PI"
        },
        {
          "name": "Silva, A.",
          "role": "Co-PD/PI"
        }
      ]
    },
    {
      "description": "Title: Ecology and Evolution of Breast Carcinogenesis  \nAward Number: 7U01CA261841-03  \nSponsor: National Cancer Institute (NCI)  \nSilva, A. (PD/PI)",
      "title": "Ecology and Evolution of Breast Carcinogenesis",
      "award_number": "7U01CA261841-03",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Silva, A.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/SilvaAriosto_4634.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=4634"
  },
  "content_hash": "a59e7f0e08d650fbd4d0c2300d06e02e77236408b7cbee2f1b56b7cfeec41630",
  "researcher_name": "Ariosto Silva",
  "department": "Metabolism and Physiology"
}