{
  "profile_url": "https://www.moffitt.org/research-science/researchers/brian-gonzalez/",
  "last_updated": "2025-11-21T22:50:23.033160",
  "researcher_id": "10612",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "health outcomes and behavior",
  "research_program": "health outcomes & behavior",
  "overview": "Dr. Gonzalez's research aims to improve quality of life in cancer survivors and reduce disparities in cancer survivorship issues among underserved populations.",
  "research_interests": [
    "Dr. Gonzalez obtained his PhD in Clinical Psychology at the University of South Florida and completed a Postdoctoral Fellowship in Behavioral Oncology at Moffitt Cancer Center. His research focuses on improving cancer survivorship. He aims to develop biopsychosocial models to predict quality of life issues in cancer populations. These models account for the unique contribution of cancer and treatment for cancer. Dr. Gonzalez also develops mobile health (mHealth) behavioral interventions to address quality of life issues among cancer populations. Dr. Gonzalez’s work also aims to reduce disparities in cancer survivorship.\n  *"
  ],
  "associations": [
    "Genitourinary Oncology",
    "Health Outcomes and Behavior",
    "Health Outcomes & Behavior Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of South Florida, MA"
    },
    {
      "type": "Graduate",
      "institution": "University of South Florida, PhD"
    },
    {
      "type": "Internship",
      "institution": "Miami VA Medical Center",
      "position": "Intern",
      "specialty": "Behavioral Medicine"
    },
    {
      "type": "Fellowship",
      "institution": "Moffitt Cancer Center",
      "specialty": "Behavioral Oncology"
    }
  ],
  "publications": [
    {
      "title": "Genetic predisposition to persistent fatigue after a diagnosis of colorectal cancer",
      "pubmed_id": "40889272",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Kazemian E, Mo Q, Matejcic M, Tsai YY, Sobieski D, Li X, Hoogland AI, Crowder SL, Gonzalez BD, Oswald LB, Sleight AG, Nguyen N, Loroña NC, Damerell V, Komrokji KR, Mooney K, Playdon MC, Ulrich CM, Li CI, Shibata D, Toriola AT, Ose J, Peoples AR, Hardikar S, Kahlert C, Siegel EM, Bower JE, Schmit SL, Gigic B, Jim HSL, Figueiredo JC",
      "journal": "J Natl Cancer Inst"
    },
    {
      "title": "Using Bayesian Networks to Predict Urgent Care Visits in Patients Receiving Systemic Therapy for Non-Small Cell Lung Cancer",
      "pubmed_id": "40939115",
      "pmc_id": "PMC12483286",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Gonzalez BD, Li X, Gudenkauf LM, Pullukkara JJ, Oswald LB, Hoogland AI, Le T, El Naqa I, Saltos AN, Haura EB, Luo Y",
      "journal": "JCO Clin Cancer Inform"
    },
    {
      "title": "Barriers to endocrine therapy adherence: perspectives of Black breast cancer survivors and their providers",
      "pubmed_id": "38520598",
      "pmc_id": "PMC11664442",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Lee KT, Gonzalez BD, Geiss C, Fulton HJ, Charles D, Vadaparampil ST, Henry NL, Jim HSL, Hershman DL, Tworoger SS, Gwede CK",
      "journal": "J Cancer Surviv"
    },
    {
      "title": "Chronic Prostate Cancer-Related Symptoms and Toxicities Following Stereotactic Body Radiation Therapy: Implications for Future Radionuclide Therapy",
      "pubmed_id": "40585713",
      "pmc_id": "PMC12205847",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Kallam D, Gaudian K, Collins R, Zwart Z, Koh MJ, Danner MT, Zwart AL, Kumar D, Simeng S, Gudenkauf L, Fallick M, Esposito G, Gonzalez B, Collins S",
      "journal": "Cureus"
    },
    {
      "title": "Diet and physical activity intervention preferences for young adult cancer survivors",
      "pubmed_id": "40447925",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Crowder SL, Hu B, Hoogland AI, Gudenkauf LM, Li X, Rodriguez Y, Irizarry-Arroyo NE, Oswald LB, Gonzalez BD, Small BJ, Galligan A, Jim HSL, Stern M",
      "journal": "J Cancer Surviv"
    },
    {
      "title": "Hidden Costs of Endocrine Therapy for Black Breast Cancer Survivors: A Qualitative Examination of Patient and Provider Experiences",
      "pubmed_id": "40713251",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Lee KT, Geiss C, Fulton HJ, Charles D, Gonzalez BD, Jim HSL, Henry NL, Hershman DL, Tworoger SS, Bradbury A, Fayanju OM, Vadaparampil ST, Gwede CK",
      "journal": "Clin Breast Cancer"
    },
    {
      "title": "Intricacies of human-AI interaction in dynamic decision-making for precision oncology",
      "pubmed_id": "39881134",
      "pmc_id": "PMC11779952",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Niraula D, Cuneo KC, Dinov ID, Gonzalez BD, Jamaluddin JB, Jin JJ, Luo Y, Matuszak MM, Ten Haken RK, Bryant AK, Dilling TJ, Dykstra MP, Frakes JM, Liveringhouse CL, Miller SR, Mills MN, Palm RF, Regan SN, Rishi A, Torres-Roca JF, Yu HM, El Naqa I",
      "journal": "Nat Commun"
    },
    {
      "title": "Developing and Assessing a Scalable Digital Health Tool for Pretest Genetic Education in Patients With Early-Onset Colorectal Cancer: Mixed Methods Design",
      "pubmed_id": "39819811",
      "pmc_id": "PMC11786131",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Rivera Rivera JN, Snir M, Simmons E, Schmidlen T, Sholeh M, Maconi ML, Geiss C, Fulton H, Barton L, Gonzalez BD, Permuth J, Vadaparampil S",
      "journal": "JMIR Cancer"
    },
    {
      "title": "The National Cancer Institute clinical trials planning meeting to address gaps in observational and intervention trials for cancer-related cognitive impairment",
      "pubmed_id": "39250738",
      "pmc_id": "PMC11807440",
      "year": "2025",
      "publication_date": "2025 Feb",
      "authors": "Janelsins MC, Van Dyk K, Hartman SJ, Koll TT, Cramer CK, Lesser GJ, Barton DL, Mustian KM, Wagner LI, Ganz PA, Cole PD, Bakos A, Root JC, Hardy K, Magnuson A, Ferguson RJ, McDonald BC, Saykin AJ, Gonzalez BD, Wefel JS, Morilak DA, Dahiya S, Heijnen CJ, Conley YP, Morgans AK, Mabbott D, Monje M, Rapp SR, Gondi V, Bender C, Embry L, McCaskill Stevens W, Hopkins JO, St Germain D, Dorsey SG",
      "journal": "J Natl Cancer Inst"
    },
    {
      "title": "Personalizing Patient Education for Pancreatic Cancer Patients Receiving Multidisciplinary Care with Integration of Novel Digital Tools",
      "pubmed_id": "40805962",
      "pmc_id": "PMC12345714",
      "year": "2025",
      "publication_date": "2025 Aug",
      "authors": "Nardella N, Adams M, Oraiqat A, Gonzalez BD, Thomas C, Goodchild S, Adamson S, Sandoval M, Frakes J, Palm RF, Stricker C, Herman J, Hodul P, Krüg S, Hoffe S",
      "journal": "Healthcare (Basel)"
    }
  ],
  "grants": [
    {
      "description": "Title: Digital Patient Journaling for Large-Scale and Targeted Qualitative Data Collection  \nAward Number:   \nSponsor: Foundation Support-Rsch  \nGeiss, C. (PD/PI), Gonzalez, B. (Co-PD/PI)",
      "title": "Digital Patient Journaling for Large-Scale and Targeted Qualitative Data Collection",
      "award_number": "",
      "sponsor": "Foundation Support-Rsch",
      "source": "Foundation",
      "investigators": [
        {
          "name": "Geiss, C.",
          "role": "PD/PI"
        },
        {
          "name": "Gonzalez, B.",
          "role": "Co-PD/PI"
        }
      ]
    },
    {
      "description": "Title: Identifying and Reducing Disparities in Patient-Reported Outcomes Among African American Prostate Cancer Survivors  \nAward Number: 5R01CA242742-05  \nSponsor: National Cancer Institute (NCI)  \nGonzalez, B. (PD/PI)",
      "title": "Identifying and Reducing Disparities in Patient-Reported Outcomes Among African American Prostate Cancer Survivors",
      "award_number": "5R01CA242742-05",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Gonzalez, B.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Impact of Targeted Therapy on Cancer-Related Cognitive Impairment  \nAward Number: 5R01CA287666-02  \nSponsor: National Cancer Institute (NCI)  \nGonzalez, B. (PD/PI)",
      "title": "Impact of Targeted Therapy on Cancer-Related Cognitive Impairment",
      "award_number": "5R01CA287666-02",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Gonzalez, B.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Ethnicity and Lung Cancer Survival: A Test of the Hispanic Sociocultural Hypothesis. The FALCON Study  \nAward Number: 5R01CA262719-05  \nSponsor: National Cancer Institute (NCI)  \nGonzalez, B. (PD/PI)",
      "title": "Ethnicity and Lung Cancer Survival: A Test of the Hispanic Sociocultural Hypothesis. The FALCON Study",
      "award_number": "5R01CA262719-05",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Gonzalez, B.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "participating_trials": [
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23371/",
      "trial_id": "23371",
      "title": "Ethnicity and Lung Cancer Survival: A Test of the Hispanic Sociocultural Hypothesis",
      "condition": "Thoracic",
      "status": "Open"
    }
  ],
  "lab_page_url": "",
  "google_scholar_url": "https://scholar.google.com/citations?user=Tq4dyG8AAAAJ&hl=en&oi=ao",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/GonzalezBrian_10612.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=10612"
  },
  "content_hash": "8006475e5978806a394e6a85443b7cf69fbaae035a39916639053d803568599a",
  "researcher_name": "brian gonzalez",
  "department": "health outcomes & behavior"
}