{
  "profile_url": "https://www.moffitt.org/research-science/researchers/cathy-meade/",
  "last_updated": "2025-11-21T22:50:23.100519",
  "researcher_id": "1514",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "health outcomes and behavior",
  "research_program": "health outcomes & behavior",
  "overview": "As a scholar in the field of health disparities, community-engaged research, health literacy, and cancer research education and training, my research aims to advance the effective application of community-academic models for beneficial community health through participatory-centric approaches. Enduring cornerstones of my endeavors are developing trustworthy collaborations, and maintaining a deep appreciation for diverse perspectives and insights gained from others to achieve goals. Moreover, my work is driven by an intentional integration of cultural and literacy features. Another emphasis of my work is the development of innovative training programs that embody mentoring, networking, and collaboration with a goal of engaging individuals from underrepresented groups in the biomedical and behavioral sciences, and to spark their curiosity about the possibilities, potential and actualities of careers in cancer research.",
  "research_interests": [
    "My research interests support the promotion of cancer prevention/early detection and health equity. Influenced by a social justice framework with an eye towards intersectionality and a health equity lens for examining social determinants of health, my work emphasizes the tenets of catchment relevant research, team science, and community partnership engagement. My efforts in establishing the Tampa Bay Community Cancer Network founded in 2005 as part of NCI's Community Networks Program has led to invaluable understanding of the requisite features of beneficial community-clinical academic research partnerships. Current studies aim to accelerate the adoption of cancer prevention screening strategies through implementation science (real-world practice) focusing on multiple system levels: organizational, provider, and patient level to boost colorectal cancer screening rates in Federally Qualified Health Centers in central and SE Florida.\n  *"
  ],
  "associations": [
    "Health Outcomes and Behavior",
    "Genitourinary Oncology",
    "Health Outcomes & Behavior Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of Illinois at Chicago, Chicago, IL, MS"
    },
    {
      "type": "Graduate",
      "institution": "University of Illinois at Chicago, Chicago, IL, PhD"
    }
  ],
  "publications": [
    {
      "title": "Design of a cluster randomized multi-level intervention to decrease barriers to minority cancer patient referral and enrollment to cancer clinical trials: The ACT WONDER2S study",
      "pubmed_id": "40992541",
      "year": "2025",
      "publication_date": "2025 Nov",
      "authors": "Rollison DE, Garcia MA, Amorrortu RP, Zhao Y, Mittman B, Turner K, Kirtane K, Soliman H, Byrne MM, Meade C, Gwede CK, Eschrich S, Yin J, Stanley NB, Fuzzell L, Hernandez D, Tapia-Kwan E, Vadaparampil ST",
      "journal": "Contemp Clin Trials"
    },
    {
      "title": "Development of an Intervention Targeted to Patients with Cancers Not Typically Perceived as Smoking-Related",
      "pubmed_id": "39237801",
      "pmc_id": "PMC11882924",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Martinez U, Brandon TH, Cottrell-Daniels C, McBride CM, Warren GW, Meade CD, Palmer AM, Simmons VN",
      "journal": "J Cancer Educ"
    },
    {
      "title": "Evaluation of a Multi-Site Cancer Health Disparities Research Training Program for Underrepresented Undergraduate and Medical Students",
      "pubmed_id": "39167358",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Cousin L, Peoples Z, Suppiah V, Li J, Quinn GP, Martinez U, Zea AH, Meade CD, Gwede CK, Tsien F, Zabaleta J, Reich R, Simmons VN",
      "journal": "J Cancer Educ"
    },
    {
      "title": "Longitudinal adherence to annual colorectal cancer screening among Black persons living in the United States enrolled in a community-based randomized trial",
      "pubmed_id": "38150285",
      "pmc_id": "PMC11009071",
      "year": "2024",
      "publication_date": "2024 May",
      "authors": "Arevalo M, Sutton SK, Abdulla R, Christy SM, Meade CD, Roetzheim RG, Gwede CK",
      "journal": "Cancer"
    },
    {
      "title": "Protocol paper for an implementation science approach to promoting colorectal cancer screening in Federally Qualified Health Center clinics: A stepped-wedge, multilevel intervention trial",
      "pubmed_id": "39070625",
      "pmc_id": "PMC11275978",
      "year": "2024",
      "publication_date": "2024 Jul",
      "authors": "Montoya SM, Olaore P, Bastardo-Acosta J, Abdulla R, Schell MJ, Hidalgo A, Turner B, Rider M, Kishun-Jit N, Joshua A, Pollard J, Friedman M, Christy SM, Meade CD, Gwede CK",
      "journal": "Res Sq"
    },
    {
      "title": "Identification of Priorities for Colorectal Cancer Screening Interventions Among US Hispanic/Latino Populations",
      "pubmed_id": "39083729",
      "pmc_id": "PMC11292273",
      "year": "2024",
      "publication_date": "2024 Jul",
      "authors": "Buchalter RB, Stern MC, Mendez JS, Kim MK, Rose J, Meade CD, Gwede CK, Figueiredo JC, Schmit SL",
      "journal": "Am J Public Health"
    },
    {
      "title": "Factors associated with prior completion of colorectal cancer and hepatitis C virus screenings among community health center patients: a cross-sectional study to inform a multi-behavioral educational intervention",
      "pubmed_id": "38127175",
      "year": "2024",
      "publication_date": "2024 Apr",
      "authors": "Gutstein L, Arevalo M, Reich RR, Fan W, Vadaparampil ST, Meade CD, Abdulla R, Lawrence E, Roetzheim RG, Lopez D, Collier A, Deak E, Ewing AP, Gwede CK, Christy SM",
      "journal": "J Behav Med"
    },
    {
      "title": "Optimizing health literacy to facilitate reproductive health decision-making in adolescent and young adults with cancer",
      "pubmed_id": "32633029",
      "pmc_id": "PMC7785658",
      "year": "2023",
      "publication_date": "2023 Sep",
      "authors": "Nahata L, Anazodo A, Cherven B, Logan S, Meacham LR, Meade CD, Zarnegar-Lumley S, Quinn GP",
      "journal": "Pediatr Blood Cancer"
    },
    {
      "title": "Transcreation matters: A learner centric participatory approach for adapting cancer prevention messages for Latinos",
      "pubmed_id": "37463555",
      "year": "2023",
      "publication_date": "2023 Oct",
      "authors": "Meade CD, Stanley NB, Arevalo M, Tyson DM, Chavarria EA, Aguado Loi CX, Rivera M, Gutierrez L, Abdulla R, Christy SM, Gwede CK",
      "journal": "Patient Educ Couns"
    },
    {
      "title": "Racial, Lifestyle, and Healthcare Contributors to Perceived Cancer Risk among Physically Active Adolescent and Young Adult Women Aged 18-39 Years",
      "pubmed_id": "37174256",
      "pmc_id": "PMC10177863",
      "year": "2023",
      "publication_date": "2023 May",
      "authors": "Brown JA, Alalwan MA, Absie S, Korley ND, Parvanta CF, Meade CM, Best AL, Gwede CK, Ewing AP",
      "journal": "Int J Environ Res Public Health"
    }
  ],
  "grants": [
    {
      "description": "Title: CARES-REACH (Colorectal Cancer Awareness, Research, Education and Screening-Rural Expansion, Access and Capacity for Health) - Establishing a Biobank of Fecal Immunochemical Tests (FIT) for Gut Microbiome Measurement in a Racially/Ethnically and Geographically Diverse Population  \nAward Number: 3R01CA249689-04S1  \nSponsor: National Cancer Institute (NCI)  \nGwede, C. (PD/PI), Meade, C. (PD/PI)",
      "title": "CARES-REACH (Colorectal Cancer Awareness, Research, Education and Screening-Rural Expansion, Access and Capacity for Health) - Establishing a Biobank of Fecal Immunochemical Tests (FIT) for Gut Microbiome Measurement in a Racially/Ethnically and Geographically Diverse Population",
      "award_number": "3R01CA249689-04S1",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Gwede, C.",
          "role": "PD/PI"
        },
        {
          "name": "Meade, C.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: CARES-REACH (Colorectal Cancer Awareness, Research, Education and Screening-Rural Expansion, Access and Capacity for Health) - My Portal CARES: Web-based Portal Usage in FQHCs among Multilingual Groups  \nAward Number: 3R01CA249689-04S2  \nSponsor: National Cancer Institute (NCI)  \nGwede, C. (PD/PI), Meade, C. (PD/PI)",
      "title": "CARES-REACH (Colorectal Cancer Awareness, Research, Education and Screening-Rural Expansion, Access and Capacity for Health) - My Portal CARES: Web-based Portal Usage in FQHCs among Multilingual Groups",
      "award_number": "3R01CA249689-04S2",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Gwede, C.",
          "role": "PD/PI"
        },
        {
          "name": "Meade, C.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "participating_trials": [],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/MeadeCathy_1514.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=1514"
  },
  "content_hash": "4ac4a851a0dd8afb100e7373cd7312d7fd02aeb966e3b39c71dac09a8a35df20",
  "researcher_name": "cathy meade",
  "department": "health outcomes & behavior"
}