{
  "profile_url": "https://www.moffitt.org/research-science/researchers/cecile-lengacher/",
  "last_updated": "2025-11-21T22:50:23.121254",
  "researcher_id": "1333",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "",
  "research_program": "health outcomes & behavior",
  "overview": "Dr. Cecile Lengacher's funded research focuses on Psychoneuroimmunology and complementary/alternative interventions for women with breast cancer.",
  "research_interests": [
    "Dr. Lengacher’s research includes women’s health, psycho-oncology, psychoneuroimmunology, and complementary alternative medicine. This expertise spans basic science to clinical research. An important aspect of her psycho-oncology research is symptom management through delivery of complementary alternative medicine therapies. She is currently conducting an NCI-funded study examining the effects of mindfulness-based stress reduction on symptom management and biomarkers such as cytokines, stress hormones, and cellular adhesion markers.\n  *"
  ],
  "associations": [
    "Health Outcomes & Behavior Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "Marquette University, Milwaukee, Wisconsin, MSN"
    },
    {
      "type": "Graduate",
      "institution": "Marquette University, Milwaukee, Wisconsin, PhD"
    }
  ],
  "publications": [
    {
      "title": "Cost-Utility Analysis of a Group Mindfulness Program Compared to an Education Support Program for Breast Cancer Survivors With Cognitive Impairment: Evidence From a Randomized Controlled Trial",
      "pubmed_id": "40696563",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Meng H, Lengacher CA, Tate R, Rodríguez C, Kip KE, Park JY, Hueluer G, Nguyen AT, Morgan S, Tinsley S, Veal B, Joshi A, Krothapalli M, Nidamanur S, Cox C, Padgett LS, Moscoso M, Bornstein E, Lucas JM, Fonseca T, Donovan KA, Chamkeri R, Reich RR",
      "journal": "Psychooncology"
    },
    {
      "title": "Efficacy of Mindfulness-Based Stress Reduction for Breast Cancer (MBSR(BC)) a Treatment for Cancer-related Cognitive Impairment (CRCI): A Randomized Controlled Trial",
      "pubmed_id": "39291332",
      "pmc_id": "PMC11839530",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Lengacher CA, Reich RR, Rodriguez CS, Nguyen AT, Park JY, Meng H, Tinsley S, Hueluer G, Donovan KA, Moscoso MS, Bornstein E, Kiluk J, Nidamanur S, Padgett LS, Lucas JM, Fonseca T, Joshi A, Lin KJ, Goodman M, Kip KE",
      "journal": "J Integr Complement Med"
    },
    {
      "title": "A Randomized Clinical Trial of Mindfulness-Based Stress Reduction Program Among Breast Cancer Survivors Post-Treatment: Evaluating Mediators of Cognitive Improvement",
      "pubmed_id": "39711191",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Lengacher CA, Hueluer G, Wang JR, Reich RR, Meng H, Park JY, Kip KE, Morgan S, Joshi A, Tinsley S, Krothapalli M, Nidamanur S, Cox C, Kiluk J, Lucas JM, Fonseca T, Moscoso MS, Bornstein E, Donovan KA, Padgett LS, Chamkeri R, Patel D, Hornback E, Rodríguez CCS",
      "journal": "J Integr Complement Med"
    },
    {
      "title": "The Moderating Role of Genetics on the Effectiveness of the Mindfulness-Based Stress Reduction for Breast Cancer (MBSR(BC)) Program on Cognitive Impairment",
      "pubmed_id": "39413359",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Park JY, Lengacher CA, Rodriguez CS, Meng H, Kip KE, Morgan S, Joshi A, Hueluer G, Wang JR, Tinsley S, Cox C, Kiluk J, Donovan KA, Moscoso M, Bornstein E, Lucas JM, Fonseca T, Krothapalli M, Padgett LS, Nidamanur S, Hornback E, Patel D, Chamkeri R, Reich RR",
      "journal": "Biol Res Nurs"
    },
    {
      "title": "Lived experiences of lymphoma patients with sexual dysfunction and related sexual distress during cancer treatment",
      "year": "2024",
      "publication_date": "2024 Nov",
      "authors": "Durosier Mertilus DS, Rodriguez CS, Lengacher CA, Donovan KA, Sokol L, Tinsley-Vance SM, Szalacha LA",
      "journal": "Discov Public Health"
    },
    {
      "title": "An Integrative Review of Sex Differences in Quality of Life and Symptoms Among Survivors of Hematologic Malignancies",
      "pubmed_id": "37155973",
      "year": "2023",
      "publication_date": "2023 Apr",
      "authors": "Tinsley-Vance SM, Durosier Mertilus DS, Nodzon L, Lengacher CA",
      "journal": "Oncol Nurs Forum"
    },
    {
      "title": "Translational Genomic Research: The Association between Genetic Profiles and Cognitive Functioning or Cardiac Function Among Breast Cancer Survivors Completing Chemotherapy",
      "pubmed_id": "35499926",
      "pmc_id": "PMC9630728",
      "year": "2022",
      "publication_date": "2022 Oct",
      "authors": "Park JY, Lengacher CA, Reich RR, Park HY, Whiting J, Nguyen AT, Rodríguez C, Meng H, Tinsley S, Chauca K, Gordillo-Casero L, Wittenberg T, Joshi A, Lin K, Ismail-Khan R, Kiluk JV, Kip KE",
      "journal": "Biol Res Nurs"
    },
    {
      "title": "Caregiver burden in caregivers of patients with advanced stage cancer: A concept analysis",
      "pubmed_id": "35932755",
      "year": "2022",
      "publication_date": "2022 Oct",
      "authors": "Morgan SP, Lengacher CA, Rodriguez CS",
      "journal": "Eur J Oncol Nurs"
    },
    {
      "title": "Feasibility and Acceptability of a Group Music Intervention in Memory Care Communities",
      "pubmed_id": "35341380",
      "year": "2022",
      "publication_date": "2022 Jun",
      "authors": "Veal BM, Dobbs D, Lee S, Bugos JA, Pyfrom MP, Boddupalli S, Lengacher CA, Meng H",
      "journal": "J Appl Gerontol"
    },
    {
      "title": "A framework for addressing health inequities in sexual and gender diverse populations by nurses",
      "pubmed_id": "35798586",
      "year": "2022",
      "publication_date": "2022 Jul",
      "authors": "Beckie TM, Lengacher C, Rodriguez C, Pares-Avila J, Turner D, Sanchez M, Nair US",
      "journal": "Nurs Outlook"
    }
  ],
  "grants": [],
  "participating_trials": [],
  "lab_page_url": "http://labpages.moffitt.org/LengacherC",
  "google_scholar_url": "",
  "photo_url": "",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=1333"
  },
  "content_hash": "cbb70934e19c4aebb4e04b5b3b192a155a041cda51984dd948ce249c39cad61e",
  "researcher_name": "cecile lengacher",
  "department": ""
}