{
  "profile_url": "https://www.moffitt.org/research-science/researchers/ciara-freeman/",
  "last_updated": "2025-11-21T22:50:23.221428",
  "researcher_id": "29429",
  "degrees": [
    "MD",
    "PhD"
  ],
  "title": "",
  "primary_program": "blood and marrow transplant and cellular immunotherapy",
  "research_program": "immuno-oncology",
  "overview": "Dr. Ciara Freeman is an Assistant Member in the Moffitt Cancer Center Department of Blood and Marrow Transplant and Cellular Immunotherapy. She obtained her MD from the National University of Ireland, specialised in hematology at St Bartholomew’s in London and obtained a master’s degree in Clinical Drug Development from Queen Mary University of London (QMUL). She also earned her PhD in immuno-oncology and therapeutics from the Barts Cancer Institute of QMUL under Professor John Gribben. She completed a fellowship in lymphoproliferative disorders and joins us from the British Columbia Cancer Agency in Vancouver, Canada, where she served as Assistant Professor and the Myeloma Lead. Her clinical interests are focused on the treatment of patients with plasma cell neoplasms using autologous transplant and cellular immunotherapy. Her research interests are centred on optimising outcomes for patients using this novel approach – identifying predictors of treatment failure or toxicity, new target discovery and clinical trial development, in addition to identifying the best modalities for measuring disease burden and relapse. She is also interested in how to safely administer these highly effective and personalised cell therapies to all patients, including those with additional health concerns. Dr Freeman’s research has been acknowledged with awards from the American Society of Hematology and she is deeply motivated to translate clinical and laboratory experience to deepen our understanding so that patients can universally benefit from this novel approach to treating myeloma.",
  "research_interests": [
    "Dr. Ciara Freeman is an Assistant Member in the Moffitt Cancer Center Department of Blood and Marrow Transplant and Cellular Immunotherapy. She obtained her MD from the National University of Ireland, specialised in hematology at St Bartholomew’s in London and obtained a master’s degree in Clinical Drug Development from Queen Mary University of London (QMUL). She also earned her PhD in immuno-oncology and therapeutics from the Barts Cancer Institute of QMUL under Professor John Gribben. She completed a fellowship in lymphoproliferative disorders and joins us from the British Columbia Cancer Agency in Vancouver, Canada, where she served as Assistant Professor and the Myeloma Lead. Her clinical interests are focused on the treatment of patients with plasma cell neoplasms using autologous transplant and cellular immunotherapy. Her research interests are centred on optimising outcomes for patients using this novel approach – identifying predictors of treatment failure or toxicity, new target discovery and clinical trial development, in addition to identifying the best modalities for measuring disease burden and relapse. She is also interested in how to safely administer these highly effective and personalised cell therapies to all patients, including those with additional health concerns. Dr Freeman’s research has been acknowledged with awards from the American Society of Hematology and she is deeply motivated to translate clinical and laboratory experience to deepen our understanding so that patients can universally benefit from this novel approach to treating myeloma. \n  *"
  ],
  "associations": [
    "Blood and Marrow Transplant and Cellular Immunotherapy",
    "Immuno-Oncology Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "Barts Cancer Institute of QMUL, PhD"
    },
    {
      "type": "Graduate",
      "institution": "Queen Mary University of London, MSc"
    },
    {
      "type": "Medical School",
      "institution": "National University of Ireland",
      "degree": "MD"
    },
    {
      "type": "Residency",
      "institution": "Mater Misercordiae Hospital, Dublin",
      "specialty": ""
    },
    {
      "type": "Residency",
      "institution": "Mayo Clinic, Scottsdale Arizona",
      "specialty": ""
    },
    {
      "type": "Fellowship",
      "institution": "Barts and the Royal London NHS Trust",
      "specialty": "Hematology"
    },
    {
      "type": "Fellowship",
      "institution": "BC Cancer Centre",
      "specialty": "lymphoproliferative disorders"
    }
  ],
  "publications": [
    {
      "title": "Target antigen and plasma cell phenotype are critical factors for sensitivity to response-adapted daratumumab therapy",
      "pubmed_id": "40983035",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Meads MB, Zhao X, Noyes DR, Sudalagunta P, Achille A, Zhang C, Renatino Canevarolo R, Silva M, Magaletti D, DeAvila D, Toska S, Oates A, Lastorino D, Idiaquez DW, Song J, Sansil S, Yoder SJ, Grajales-Cruz AF, Blue BJ, Freeman CL, Kim J, Alsina M, Brayer J, Siqueira Silva A, Song X, Shain KH, Baz RC",
      "journal": "Blood"
    },
    {
      "title": "Influence of Chimeric Antigen Receptor T-Cell Therapy on Fracture Risk of Patients With Multiple Myeloma",
      "pubmed_id": "40953403",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Huynh THN, Clampitt BA, Chose CM, Nester MD, Joyce DM, Binitie OT, Freeman CL, Lazarides AL",
      "journal": "J Am Acad Orthop Surg"
    },
    {
      "title": "Fludarabine Lymphodepletion Exposure is Associated with Toxicities after Idecabtagene-Vicleucel in Relapsed/Refractory Multiple Myeloma: Real-World Experience from the US Myeloma Immunotherapy Consortium",
      "pubmed_id": "40972962",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Sweiss K, Wagner C, Anto E, Greene T, Sun R, Gonzalez R, Puglianini OC, Freeman C, Ionescu F, Patel K, Ferreri C, Gaballa M, Shune L, McGuirk J, Sidana S, Hovanky V, Khouri J, Raza S, Anwer F, Dima D, Hashmi H, Davis J, Afrough A, Kaur G, Anderson JL, Forsberg P, Herr M, Hansen DK, Hakan Kocoglu M, Sborov D",
      "journal": "Transplant Cell Ther"
    },
    {
      "title": "Sequential targeting in multiple myeloma: talquetamab, a GPRC5D bispecific antibody, as a bridge to BCMA CAR-T therapy",
      "pubmed_id": "40749169",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Dhakal B, Akhtar OS, Fandrei D, Jensen A, Banerjee R, Pan D, Richard S, Friend R, Rees MJ, Costello P, Vazquez Martinez MA, Pasvolsky O, Wagner CB, Davis JA, Castaneda Puglianini OA, Reshef R, Afrough A, Dima D, Bhutani M, Nadeem O, Parrondo RD, Freeman CL, Mikkilineni L, Raza S, Anderson LD, Kapoor P, Hosoya H, Chhabra S, Grajales-Cruz A, Gaballa MR, Midha S, Alsina M, Sborov DW, Patel KK, Lin Y, Ferreri CJ, Gagelmann N, Kumar AD, Hansen DK, Cowan AJ, Costa LJ, Merz M, Sidana S",
      "journal": "Blood"
    },
    {
      "title": "Developing SEMA4A-directed CAR T cells to overcome low BCMA antigen density in multiple myeloma",
      "pubmed_id": "41072416",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Di Meo F, Albano F, Cesarano A, Wang Y, Kale B, Shain K, Silva A, Kurihara N, Tenshin H, Jellyman D, Song X, Ghaffari S, Mesa H, Creelan B, Freeman C, Zhao X, Meads MB, Rodriguez PC, Marino S, Locke F, Hwu P, Roodman D, Mansilla-Soto J, Perna F",
      "journal": "Cancer Cell"
    },
    {
      "title": "Outcomes of elderly patients with relapsed refractory multiple myeloma (RRMM) treated with teclistamab: a multicenter study from the U",
      "pubmed_id": "40346049",
      "pmc_id": "PMC12064690",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Pasvolsky O, Dima D, Feng L, Dong W, Richards T, Davis JA, Afrough A, Vazquez-Martinez M, Sannareddy A, Goel U, Banerjee R, Khouri J, Cervoni F, Gaballa MR, Lieberman-Cribbin A, Rana MS, Julian K, Ferreri CJ, Shune L, DeJarnette S, Bhurtel E, Susanibar Adaniya S, Portuguese A, Hosoya H, Mikkilineni L, Kaur G, Rossi A, Herr MM, Schrum D, Lin C, Raza S, Lin Y, Midha S, Omar N, Atarsh S, McGuirk J, Sborov D, Voorhees P, Anwer F, Alsina M, Freeman C, Garfall AL, Razzo BM, Sidana S, Cowan AJ, Anderson LD, Hansen DK, Richard S, Patel KK, Lee HC, Grajales-Cruz A",
      "journal": "S"
    },
    {
      "title": "Comparison of Standard-of-Care Idecabtagene Vicleucel and Ciltacabtagene Autoleucel in Relapsed/Refractory Multiple Myeloma",
      "pubmed_id": "39965175",
      "pmc_id": "PMC12037312",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Hansen DK, Peres LC, Dima D, Richards A, Shune L, Afrough A, Midha S, Dhakal B, Kocoglu MH, Atrash S, Ferreri C, Castaneda O, Davis JA, Bhurtel E, McGuirk J, Wagner C, Bansal R, Costello P, Smith K, Lieberman-Cribbin A, De Avila G, Purvey S, Hosoya H, Mikkilineni L, Oswald LB, Kaur G, Pasvolsky O, Gaballa M, Herr MM, Forsberg P, Janakiram M, Htut M, Asoori Maringanti S, Kalariya N, Hashmi H, Reshef R, Sborov DW, Nadeem O, Anwer F, Khouri J, Raza S, Atanackovic D, Alsina M, Freeman CL, Locke FL, Voorhees P, Anderson LD, Richard S, Martin T, Lin Y, Patel KK, Sidana S",
      "journal": "J Clin Oncol"
    },
    {
      "title": "Universal driving restrictions beyond 4 weeks appear unnecessary following CAR-T therapy in multiple myeloma",
      "pubmed_id": "40088469",
      "pmc_id": "PMC12127628",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Banerjee R, Richards A, Midha S, Afrough A, Anwer F, Atanackovic D, Atrash S, Bachanova V, Beitinjaneh AM, Ouchveridze E, Castaneda Puglianini O, Chhabra S, Cicero KI, Davis JA, Dhakal B, Dima D, Ferreri CJ, Forsberg PA, Freeman CL, Herr MM, Jain T, Janakiram M, Khouri J, Kocoglu MH, Kumar AD, Liu Y, Locke FL, McGuirk JP, Mikkilineni L, Nadeem O, Parrondo RD, Pasvolsky O, Peres LC, Purvey S, Raza S, Reshef R, Richard S, Rossi AC, Sborov DW, Shune L, Wagner CB, Zanwar SS, Sidana S, Patel KK, Hansen DK, Kumar SK, Lin Y, Martin TG, Voorhees PM, Anderson LD, Cowan AJ, Kaur G",
      "journal": "Blood Adv"
    },
    {
      "title": "Whole-body MRI for a patient with progressive multiple myeloma",
      "pubmed_id": "40386466",
      "pmc_id": "PMC12085220",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Henning JE, Nishihori T, Freeman C, Lazarides A, Song J, Kuruvilla D, Feuerlein S, Costello JR",
      "journal": "BJR Case Rep"
    },
    {
      "title": "Prognostic biomarkers in MCL: insights from the SHINE trial on the impact of MCL35 score and TP53 mutation status",
      "pubmed_id": "40101138",
      "year": "2025",
      "publication_date": "2025 Jun",
      "authors": "Freeman CL, Srinivasan S, Hodkinson B, Deshpande S, Henninger T, Boyle M, Wang ML, Dreyling M, Scott DW",
      "journal": "Blood"
    }
  ],
  "grants": [
    {
      "description": "Title: Geriatric Oncology Research Infrastructure to Improve Clinical Care  \nAward Number: R33AG059206-07  \nSponsor: National Institutes of Health (NIH)  \nFreeman, C. (PD/PI)",
      "title": "Geriatric Oncology Research Infrastructure to Improve Clinical Care",
      "award_number": "R33AG059206-07",
      "sponsor": "National Institutes of Health (NIH)",
      "source": "NIH",
      "investigators": [
        {
          "name": "Freeman, C.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Development of a novel, non-BCMA targeting CAR-T cell therapy for the treatment of multiple   \nAward Number: 09334422601  \nSponsor: Pentecost Mult Myeloma  \nFreeman, C. (PD/PI)",
      "title": "Development of a novel, non-BCMA targeting CAR-T cell therapy for the treatment of multiple",
      "award_number": "09334422601",
      "sponsor": "Pentecost Mult Myeloma",
      "investigators": [
        {
          "name": "Freeman, C.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Development of a novel, non-BCMA targeting CAR-T cell therapy for the treatment of multiple myeloma  \nAward Number:   \nSponsor: Foundation Support-Rsch  \nBinning, J. (PD/PI), Freeman, C. (PD/PI)",
      "title": "Development of a novel, non-BCMA targeting CAR-T cell therapy for the treatment of multiple myeloma",
      "award_number": "",
      "sponsor": "Foundation Support-Rsch",
      "source": "Foundation",
      "investigators": [
        {
          "name": "Binning, J.",
          "role": "PD/PI"
        },
        {
          "name": "Freeman, C.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "participating_trials": [
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23135/",
      "trial_id": "23135",
      "title": "A Phase 2, Open-Label, Multicenter Study of BMS-986393, a GPRC5D-directed CAR T Cell Therapy in Adult Participants with Relapsed or Refractory Multiple Myeloma (QUINTESSENTIAL)",
      "condition": "Malignant Hematology",
      "intervention": "BMS-986393 (); Tocilizumab (); cyclophosphamide (); cytoxan (cyclophosphamide); fludarabine (Fludarabine phosphate)",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23321/",
      "trial_id": "23321",
      "title": "A Phase 3, Randomized, Open-Label Study to Compare the Efficacy and Safety of Anitocabtagene Autoleucel versus Standard of Care Therapy in Participants with Relapsed/Refractory Multiple Myeloma",
      "condition": "Multiple Myeloma",
      "intervention": "Anitocabtagene autoleucel (); Bortezomib (); CC-4047 (Pomalidomide); Daratumumab (Darzalex); Dexamethasone (); PS-341 (Bortezomib); Pomalidomide (); Velcade (Bortezomib); carfilzomib (Kyprolis); cyclophosphamide (); cytoxan (cyclophosphamide); fludarabine (Fludarabine phosphate)",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23711/",
      "trial_id": "23711",
      "title": "Artificial Intelligence-Integrated Clinical, Pathologic, Genomic, and Radiologic Model for Predicting Response to Complex Immunotherapies and Risk of Developing Extramedullary Disease in Multiple Myeloma",
      "condition": "Malignant Hematology",
      "status": "Open"
    }
  ],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/FreemanCiara_29429.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=29429"
  },
  "content_hash": "7f91dc2c1d023247da30fd908680b16ec22c466e83264179711aa6e0839509cb",
  "researcher_name": "ciara freeman",
  "department": ""
}