{
  "profile_url": "https://www.moffitt.org/research-science/researchers/clement-gwede/",
  "last_updated": "2025-11-21T22:50:23.235060",
  "researcher_id": "933",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "health outcomes and behavior",
  "research_program": "health outcomes & behavior",
  "overview": "Eliminating cancer disparities through community-based, culturally appropriate interventions for high-risk, underserved populations is a national priority.",
  "research_interests": [
    "Despite major advances in cancer screening, early detection and care, there are marked and persistent disparities in outcomes for African-Americans/Blacks and other medically underserved populations. As such, over the past few years Dr. Gwede's research has spanned the continuum of cancer care with the following broad goals: reducing cancer disparities through community-based interventions to promote informed decision making and early detection for prostate and colorectal cancer; increasing participation of racial-ethnic minorities in clinical research; and symptom management interventions to improve quality of life during and after cancer treatment. Supported by grants from the ACS and NCI, current research by Dr. Gwede and colleagues uses community-based participatory research methods and community-academic partnerships to develop and implement culturally targeted, linguistically and literacy relevant interventions to increase colorectal cancer screening among diverse medically underserved populations in community health clinics and other community settings. In the area of symptom management and quality of life, Dr. Gwede seeks to prevent or ameliorate the burden of debilitating chemoradiation-induced symptoms in national or multinational cooperative clinical trials. \n  *"
  ],
  "associations": [
    "Health Outcomes and Behavior",
    "Genitourinary Oncology",
    "Gastrointestinal Oncology",
    "Cancer Chemoprevention Research Interest Group",
    "Health Outcomes & Behavior Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of South Florida, MPH"
    },
    {
      "type": "Graduate",
      "institution": "University of South Florida, PhD"
    }
  ],
  "publications": [
    {
      "title": "Barriers to endocrine therapy adherence: perspectives of Black breast cancer survivors and their providers",
      "pubmed_id": "38520598",
      "pmc_id": "PMC11664442",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Lee KT, Gonzalez BD, Geiss C, Fulton HJ, Charles D, Vadaparampil ST, Henry NL, Jim HSL, Hershman DL, Tworoger SS, Gwede CK",
      "journal": "J Cancer Surviv"
    },
    {
      "title": "Design of a cluster randomized multi-level intervention to decrease barriers to minority cancer patient referral and enrollment to cancer clinical trials: The ACT WONDER2S study",
      "pubmed_id": "40992541",
      "year": "2025",
      "publication_date": "2025 Nov",
      "authors": "Rollison DE, Garcia MA, Amorrortu RP, Zhao Y, Mittman B, Turner K, Kirtane K, Soliman H, Byrne MM, Meade C, Gwede CK, Eschrich S, Yin J, Stanley NB, Fuzzell L, Hernandez D, Tapia-Kwan E, Vadaparampil ST",
      "journal": "Contemp Clin Trials"
    },
    {
      "title": "Effectiveness of a community health advisor colorectal cancer screening educational intervention on stool test completion in an African American primary care patient population: a pragmatic randomized controlled trial",
      "pubmed_id": "40450376",
      "pmc_id": "PMC12126889",
      "year": "2025",
      "publication_date": "2025 Jun",
      "authors": "Luque JS, Kiros GE, Vargas MA, Ali A, Tawk R, Jackson DR, Dickey SL, Harris CM, Robinson T, Duncan B, Freeman J, Gwede CK, Wallace K",
      "journal": "BMC Glob Public Health"
    },
    {
      "title": "Hidden Costs of Endocrine Therapy for Black Breast Cancer Survivors: A Qualitative Examination of Patient and Provider Experiences",
      "pubmed_id": "40713251",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Lee KT, Geiss C, Fulton HJ, Charles D, Gonzalez BD, Jim HSL, Henry NL, Hershman DL, Tworoger SS, Bradbury A, Fayanju OM, Vadaparampil ST, Gwede CK",
      "journal": "Clin Breast Cancer"
    },
    {
      "title": "A mixed-methods study characterizing experiences of medical oncologists' use of gonadotropin-releasing hormone agonists for treatment of breast cancer",
      "pubmed_id": "40461861",
      "pmc_id": "PMC12209034",
      "year": "2025",
      "publication_date": "2025 Aug",
      "authors": "Lee KT, Hu B, Martinez Tyson D, Geiss C, Vadaparampil ST, Jim HSL, Gwede CK, Soliman HH, Henry NL, Hershman DL",
      "journal": "Breast Cancer Res Treat"
    },
    {
      "title": "Postoperative Radiotherapy ± Cetuximab for Intermediate-Risk Head and Neck Cancer",
      "pubmed_id": "39841939",
      "pmc_id": "PMC12003072",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Machtay M, Torres-Saavedra PA, Thorstad W, Nguyen-Tân PF, Siu LL, Holsinger FC, El-Naggar A, Chung C, Cmelak A, Burtness B, Bednarz G, Quon H, Breen SL, Gwede CK, Dicker AP, Yao M, Jordan RC, Dorth J, Lee N, Chan JW, Dunlap N, Bar-Ad V, Stokes WA, Chakravarti A, Sher D, Rao S, Harris J, Yom SS, Le QT",
      "journal": "J Clin Oncol"
    },
    {
      "title": "Evaluation of a Multi-Site Cancer Health Disparities Research Training Program for Underrepresented Undergraduate and Medical Students",
      "pubmed_id": "39167358",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Cousin L, Peoples Z, Suppiah V, Li J, Quinn GP, Martinez U, Zea AH, Meade CD, Gwede CK, Tsien F, Zabaleta J, Reich R, Simmons VN",
      "journal": "J Cancer Educ"
    },
    {
      "title": "Vaccination uptake among post-treatment cancer survivors: A multi-vaccine scoping review",
      "pubmed_id": "38802291",
      "pmc_id": "PMC11371527",
      "year": "2024",
      "publication_date": "2024 Sep",
      "authors": "Renduchintala K, Arevalo M, Fonseca G, Haver MK, Gwede CK, Pabbathi S, Christy SM",
      "journal": "Vaccine"
    },
    {
      "title": "Longitudinal adherence to annual colorectal cancer screening among Black persons living in the United States enrolled in a community-based randomized trial",
      "pubmed_id": "38150285",
      "pmc_id": "PMC11009071",
      "year": "2024",
      "publication_date": "2024 May",
      "authors": "Arevalo M, Sutton SK, Abdulla R, Christy SM, Meade CD, Roetzheim RG, Gwede CK",
      "journal": "Cancer"
    },
    {
      "title": "Leveraging real-world data to predict cancer cachexia stage, quality of life, and survival in a racially and ethnically diverse multi-institutional cohort of treatment-naïve patients with pancreatic ductal adenocarcinoma",
      "pubmed_id": "39109281",
      "pmc_id": "PMC11300308",
      "year": "2024",
      "publication_date": "2024 Jul",
      "authors": "Permuth JB, Park MA, Chen DT, Basinski T, Powers BD, Gwede CK, Dezsi KB, Gomez M, Vyas SL, Biachi T, Cortizas EM, Crowder S, Genilo-Delgado M, Green BL, Greene A, Gregg C, Hoffe SE, Jiang K, Kim B, Vasudevan V, Garcialopez De Llano J, Menon AA, Mo Q, MorenoUrazan LM, Mok S, Parker N, Rajasekhara S, Rasool G, Sinnamon A, Sparks L, Stewart PA, Tardif K, Tassielli AF, Teer JK, Tran DV, Turner KL, Vadaparampil ST, Whelan CJ, Douglas WG, Velanovich V, Karachristos A, Legaspi A, Meredith K, Molina-Vega MA, Huguet KL, Arnoletti JP, Bloomston M, Trevino J, Merchant NB, Pimiento JM, Hodul PJ, Malafa M, Fleming J, Judge SM, Jeong DK, Judge A",
      "journal": "Front Oncol"
    }
  ],
  "grants": [
    {
      "description": "Title: Multilevel Action Toward Colorectal Cancer and Hepatitis C Education and Screening (MATCHES)  \nAward Number: 24B05  \nSponsor: Florida Department of Health  \nChristy, S. (PD/PI), Gwede, C. (Co-PD/PI)",
      "title": "Multilevel Action Toward Colorectal Cancer and Hepatitis C Education and Screening (MATCHES)",
      "award_number": "24B05",
      "sponsor": "Florida Department of Health",
      "investigators": [
        {
          "name": "Christy, S.",
          "role": "PD/PI"
        },
        {
          "name": "Gwede, C.",
          "role": "Co-PD/PI"
        }
      ]
    },
    {
      "description": "Title: CARES-REACH (Colorectal Cancer Awareness, Research, Education and Screening-Rural Expansion, Access and Capacity for Health)  \nAward Number: 5R01CA249689-05  \nSponsor: National Cancer Institute (NCI)  \nGwede, C. (PD/PI)",
      "title": "CARES-REACH (Colorectal Cancer Awareness, Research, Education and Screening-Rural Expansion, Access and Capacity for Health)",
      "award_number": "5R01CA249689-05",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Gwede, C.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: CARES-REACH (Colorectal Cancer Awareness, Research, Education and Screening-Rural Expansion, Access and Capacity for Health) - Establishing a Biobank of Fecal Immunochemical Tests (FIT) for Gut Microbiome Measurement in a Racially/Ethnically and Geographically Diverse Population  \nAward Number: 3R01CA249689-04S1  \nSponsor: National Cancer Institute (NCI)  \nGwede, C. (PD/PI), Meade, C. (PD/PI)",
      "title": "CARES-REACH (Colorectal Cancer Awareness, Research, Education and Screening-Rural Expansion, Access and Capacity for Health) - Establishing a Biobank of Fecal Immunochemical Tests (FIT) for Gut Microbiome Measurement in a Racially/Ethnically and Geographically Diverse Population",
      "award_number": "3R01CA249689-04S1",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Gwede, C.",
          "role": "PD/PI"
        },
        {
          "name": "Meade, C.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: CARES-REACH (Colorectal Cancer Awareness, Research, Education and Screening-Rural Expansion, Access and Capacity for Health) - My Portal CARES: Web-based Portal Usage in FQHCs among Multilingual Groups  \nAward Number: 3R01CA249689-04S2  \nSponsor: National Cancer Institute (NCI)  \nGwede, C. (PD/PI), Meade, C. (PD/PI)",
      "title": "CARES-REACH (Colorectal Cancer Awareness, Research, Education and Screening-Rural Expansion, Access and Capacity for Health) - My Portal CARES: Web-based Portal Usage in FQHCs among Multilingual Groups",
      "award_number": "3R01CA249689-04S2",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Gwede, C.",
          "role": "PD/PI"
        },
        {
          "name": "Meade, C.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Ghana IntegRative Approach to Cancer ResEarch Training: The Grace Program  \nAward Number: 3D43CA260649-05S1  \nSponsor: National Cancer Institute (NCI)  \nGiuliano, A. (PD/PI), Gwede, C. (PD/PI), Yamoah, K. (PD/PI)",
      "title": "Ghana IntegRative Approach to Cancer ResEarch Training: The Grace Program",
      "award_number": "3D43CA260649-05S1",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Giuliano, A.",
          "role": "PD/PI"
        },
        {
          "name": "Gwede, C.",
          "role": "PD/PI"
        },
        {
          "name": "Yamoah, K.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "participating_trials": [],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/GwedeClement_933.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=933"
  },
  "content_hash": "2784a38e75ad61072348258c9089ae55a04ef7e8609d5f32597457da160d6e7f",
  "researcher_name": "clement gwede",
  "department": "health outcomes & behavior"
}