{
  "profile_url": "https://www.moffitt.org/research-science/researchers/constance-visovsky/",
  "last_updated": "2025-11-21T22:50:23.271385",
  "researcher_id": "8988",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "",
  "research_program": "health outcomes & behavior",
  "overview": "",
  "research_interests": [
    "My research interest is in the neuromuscular effects of cancer treatment, specifically focused on chemotherapy-induced peripheral neuropathy. I have completed an NCI-funded trial of resistance exercise as a means of preserving muscle strength during chemotherapy and a pilot study that formed the basis of my recent R01 submission using both aerobic and resistive exercise to ameliorate taxane-induced neuropathy. I am a certified acute care nurse practitioner with expertise in breast cancer, head and neck cancer and malignant melanoma. As a post-doctoral fellow, I studied cancer and exercise behavior with Dr. Kerry Courneya at the University of Alberta in Edmonton, Alberta Canada. I joined USF in January, 2011 in part due to my collaboration with Moffitt Cancer Center member, Dr. Cindy Tofthagen. I was an external reviewer for Dr. Tofthagen’s doctoral dissertation work, and served as a mentor to her in the development of her knowledge and skill in exercise and gait and balance training. We are currently collaborating on several manuscripts, and a pilot study of cancer symptoms experienced by patients in Panama, where we have an undergraduate student community health experience.\n  *"
  ],
  "associations": [
    "Health Outcomes & Behavior Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of Rochester, MSN"
    },
    {
      "type": "Graduate",
      "institution": "Case Western Reserve University, PhD"
    },
    {
      "type": "Fellowship",
      "institution": "Case Western Reserve University",
      "specialty": "Translational Research Oncology Grant"
    }
  ],
  "publications": [
    {
      "title": "Fall Risk Associated with Taxanes: Focus on Chemotherapy-Induced Peripheral Neuropathy",
      "pubmed_id": "39013733",
      "year": "2024",
      "publication_date": "2024 Aug",
      "authors": "Visovsky C, Wodzinski PT, Haladay D, Ji M, Coury J",
      "journal": "Semin Oncol Nurs"
    },
    {
      "title": "Psychological distress and quality of life in breast cancer survivors with taxane-induced peripheral neuropathy: A scoping review",
      "pubmed_id": "36703798",
      "pmc_id": "PMC9872004",
      "year": "2023",
      "publication_date": "2023 Jan",
      "authors": "Schwab L, Visovsky C",
      "journal": "Front Oncol"
    },
    {
      "title": "Fatigue-related symptom clusters and functional status of older adults in hospice",
      "pubmed_id": "35676795",
      "year": "2023",
      "publication_date": "2023 Feb",
      "authors": "Abduljawad SF, Beckstead JW, Dobbs D, Visovsky C, Rodriguez CS, McMillan SC, Wang HL",
      "journal": "Palliat Support Care"
    },
    {
      "title": "Cancer treatment-specific medication beliefs among metastatic breast cancer patients: a qualitative study",
      "pubmed_id": "35527287",
      "year": "2022",
      "publication_date": "2022 Aug",
      "authors": "Marshall VK, Visovsky C, Advani P, Mussallem D, Tofthagen C",
      "journal": "Support Care Cancer"
    },
    {
      "title": "Assessing gait, balance, and muscle strength among breast cancer survivors with chemotherapy-induced peripheral neuropathy (CIPN): study protocol for a randomized controlled clinical trial",
      "pubmed_id": "35477489",
      "pmc_id": "PMC9044705",
      "year": "2022",
      "publication_date": "2022 Apr",
      "authors": "Teran-Wodzinski P, Haladay D, Vu T, Ji M, Coury J, Adams A, Schwab L, Visovsky C",
      "journal": "Trials"
    },
    {
      "title": "Nursing's contributions to Sustainable Development Goals in Latin America through education, leadership, and partnerships",
      "pubmed_id": "34271461",
      "year": "2021",
      "publication_date": "2021 Sep",
      "authors": "Castañeda-Hidalgo H, Visovsky C, Hernández DE, González-Quirarte NH, Compeán-Ortiz L, Campiño SM",
      "journal": "Int J Nurs Stud"
    },
    {
      "title": "Neuropathic symptoms, physical and emotional well-being, and quality of life at the end of life",
      "pubmed_id": "30623244",
      "pmc_id": "PMC6616011",
      "year": "2019",
      "publication_date": "2019 Sep",
      "authors": "Tofthagen C, Visovsky C, Dominic S, McMillan S",
      "journal": "Support Care Cancer"
    },
    {
      "title": "A Behavioral Physical Activity Intervention to Manage Moderate and Severe Fatigue Among Head and Neck Cancer Patients-Pre-efficacy Study in the National Institutes of Health ORBIT Model",
      "pubmed_id": "29461282",
      "year": "2019",
      "publication_date": "2019 Jan",
      "authors": "Wang HL, McMillan SC, Vijayakumar N, McDonald S, Huang LT, Gwede C, Padhya T, Russell J, Vondruska K, Buck HG, Huang Y, Visovsky C",
      "journal": "Cancer Nurs"
    },
    {
      "title": "The SMARTIE Program: A Novel Initiative to Evaluate the Impact of AP Continuing Education on Clinical Practice",
      "pubmed_id": "30333941",
      "pmc_id": "PMC6188091",
      "year": "2018",
      "publication_date": "2018 Oct",
      "authors": "Kurtin SE, Visovsky C, Brady ED, Brody ALK",
      "journal": "J Adv Pract Oncol"
    },
    {
      "title": "The Challenges of Clinical Research in Rare Cancers: Bevacizumab Use in Low-Grade Serous Ovarian and Primary Peritoneal Cancers",
      "pubmed_id": "30018844",
      "pmc_id": "PMC6040873",
      "year": "2018",
      "publication_date": "2018 Jul",
      "authors": "Grande C, Visovsky C, Brose MS",
      "journal": "J Adv Pract Oncol"
    }
  ],
  "grants": [],
  "participating_trials": [],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=8988"
  },
  "content_hash": "2798a325523e85d60b9b42ec10c365188874a08532ca3937496ddf64be258ae4",
  "researcher_name": "constance visovsky",
  "department": ""
}