{
  "profile_url": "https://www.moffitt.org/research-science/researchers/danielle-tometich/",
  "last_updated": "2025-11-21T22:50:23.346961",
  "researcher_id": "unknown",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "",
  "research_program": "health outcomes & behavior",
  "overview": "",
  "research_interests": [
    "Danielle Tometich, PhD is a clinical health psychologist specializing in behavioral oncology. She earned a PhD in clinical psychology from Indiana University-Purdue University Indianapolis and completed a clinical internship at Yale University. She completed the NCI-funded Behavioral Oncology Training Program (T32) at Moffitt Cancer Center and is now a K99 post-doctoral fellow. The goal of Dr. Tometich’s research is to improve quality of life for cancer survivors and those living with metastatic disease. In pursuit of this goal, she uses quantitative and qualitative approaches to understand cancer-related cognitive impairment, describe symptoms, identify targets for health behavior change, and elucidate patient-reported outcomes of novel therapies for metastatic cancer.\n  *"
  ],
  "associations": [
    "Health Outcomes & Behavior Program"
  ],
  "education": [],
  "publications": [
    {
      "title": "Alzheimer disease-related biomarkers and cancer-related cognitive decline: the Thinking and Living with Cancer study",
      "pubmed_id": "38788675",
      "pmc_id": "PMC11378315",
      "year": "2024",
      "publication_date": "2024 Sep",
      "authors": "Mandelblatt J, Dage JL, Zhou X, Small BJ, Ahles TA, Ahn J, Artese A, Bethea TN, Breen EC, Carroll JE, Cohen HJ, Extermann M, Graham D, Isaacs C, Jim HSL, Mcdonald BC, Nakamura ZM, Patel SK, Rebeck GW, Rentscher KE, Root JC, Russ KA, Tometich DB, Turner RS, Van Dyk K, Zhai W, Huang LW, Saykin AJ",
      "journal": "J Natl Cancer Inst"
    },
    {
      "title": "\"It Was a Downward Spiral\": A Qualitative Study of Young Adult Cancer Survivors' Experiences with Cognitive and Mental Health",
      "pubmed_id": "39594774",
      "pmc_id": "PMC11592372",
      "year": "2024",
      "publication_date": "2024 Nov",
      "authors": "Tometich DB, Hersh C, Maconi ML, Fulton HJ, Martinez Tyson D, Zambrano K, Hasan S, Welniak T, Rodriguez Y, Bryant C, Gudenkauf LM, Li X, Reed DR, Oswald LB, Galligan A, Small BJ, Jim HSL",
      "journal": "Cancers (Basel)"
    },
    {
      "title": "Correction: Azari et al",
      "pubmed_id": "39595517",
      "pmc_id": "PMC11593703",
      "year": "2024",
      "publication_date": "2024 Nov",
      "authors": "Azari L, Hemati H, Tavasolian R, Shahdab S, Tomlinson SM, Babilonia MB, Huang J, Tometich DB, Turner K, Anaraki KS, Jim HSL, Tabriz AA",
      "journal": "The Efficacy of Ketamine for Acute and Chronic Pain in Patients with Cancer: A Systematic Review of Randomized Controlled Trials"
    },
    {
      "title": "Patient reported outcomes and patient experiences of immune checkpoint modulators for advanced or recurrent melanoma: a mixed methods study",
      "pubmed_id": "38709312",
      "year": "2024",
      "publication_date": "2024 May",
      "authors": "Tometich DB, Geiss C, Maconi ML, Chavez M, Hoogland AI, Li X, Nieves-Lopez A, Rodriguez Y, Bryant C, Brohl AS, Eroglu Z, Markowitz J, Tarhini AA, Hwu P, Khushalani NI, Jim HSL",
      "journal": "Support Care Cancer"
    },
    {
      "title": "\"I couldn't connect the wires in my brain",
      "pubmed_id": "38420860",
      "year": "2024",
      "publication_date": "2024 Mar",
      "authors": "Tometich DB, Welniak T, Gudenkauf L, Maconi ML, Fulton HJ, Martinez Tyson D, Zambrano K, Hasan S, Rodriguez Y, Bryant C, Li X, Reed DR, Oswald LB, Galligan A, Small BJ, Jim HSL",
      "journal": "\" Young adult cancer survivors' experience with cognitive functioning"
    },
    {
      "title": "The efficacy and safety of ketamine for depression in patients with cancer: A systematic review",
      "pubmed_id": "38179461",
      "pmc_id": "PMC10764987",
      "year": "2024",
      "publication_date": "2024 Jan",
      "authors": "Azari L, Hemati H, Tavasolian R, Shahdab S, Tomlinson SM, Bobonis Babilonia M, Huang J, Tometich DB, Turner K, Jim HSL, Tabriz AA",
      "journal": "Int J Clin Health Psychol"
    },
    {
      "title": "Social isolation, depression, and anxiety among young adult cancer survivors: The mediating role of social connectedness",
      "pubmed_id": "39097814",
      "pmc_id": "PMC11560659",
      "year": "2024",
      "publication_date": "2024 Dec",
      "authors": "Li X, Hathaway CA, Small BJ, Tometich DB, Gudenkauf LM, Hoogland AI, Fox RS, Victorson DE, Salsman JM, Gonzalez BD, Jim HSL, Siegel EM, Tworoger SS, Oswald LB",
      "journal": "Cancer"
    },
    {
      "title": "The Efficacy of Ketamine for Acute and Chronic Pain in Patients with Cancer: A Systematic Review of Randomized Controlled Trials",
      "pubmed_id": "39201120",
      "pmc_id": "PMC11354190",
      "year": "2024",
      "publication_date": "2024 Aug",
      "authors": "Azari L, Hemati H, Tavasolian R, Shahdab S, Tomlinson SM, Babilonia MB, Huang J, Tometich DB, Turner K, Anaraki KS, Jim HSL, Tabriz AA",
      "journal": "Healthcare (Basel)"
    }
  ],
  "grants": [],
  "participating_trials": [],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/TometichDanielle_38483.jpg",
  "contact": {},
  "content_hash": "bbc780fbf7c2bdc670ea41480d5258a95178290d62f6b7a750f26d2f0b96b1a1",
  "researcher_name": "danielle tometich",
  "department": ""
}