{
  "profile_url": "https://www.moffitt.org/research-science/researchers/daniel-anaya-saenz/",
  "last_updated": "2025-11-21T22:50:23.316042",
  "researcher_id": "15586",
  "degrees": [
    "MD"
  ],
  "title": "",
  "primary_program": "gastrointestinal oncology",
  "research_program": "health outcomes & behavior",
  "overview": "During my time as a researcher in the field of cancer I have focused on evaluating outcomes and health systems to improve quality of cancer care. This is a field that is best suited to study in the context of the infrastructure of a cancer center which among other things provides the opportunity for multidisciplinary expertise and collaboration.",
  "research_interests": [
    "Research Interests:1. Improve regionalization of care and access to high-quality care for hepatobiliary malignancies: There is a well-described association with institutional procedural volume and postoperative outcomes (mortality) following cancer surgery, which has been used to drive regionalization of care for specific procedures. My interest lies in evaluating institutional processes beyond procedural volume, and the effect these have on postoperative AND cancer-related outcomes, including survival. Further, I have experience developing regional-type interventions that facilitate access to high-volume centers across different states and proven positive impact on both the process of care and cancer outcomes.2. Patient-centered outcomes following cancer surgery in the elderly population: I have experience using Comprehensive Geriatric Assessment (CGA) to evaluate geriatric conditions and risks following surgery in the geriatric population (previously funded work through ASCO CDA). I intent to expand this to the surgical population and develop interventions that will improve postoperative, patient-centered and cancer-related outcomes.\n  *"
  ],
  "associations": [
    "Gastrointestinal Oncology",
    "Health Outcomes and Behavior",
    "Center for Immunization & Infection Research in Cancer",
    "Health Outcomes & Behavior Program"
  ],
  "education": [
    {
      "type": "Medical School",
      "institution": "Pontificia Universidad Javeriana",
      "degree": "MD"
    },
    {
      "type": "Internship",
      "institution": "University of Washington",
      "position": "Intern",
      "specialty": "General Surgery"
    },
    {
      "type": "Residency",
      "institution": "University of Washington",
      "specialty": "General Surgery"
    },
    {
      "type": "Fellowship",
      "institution": "FSFB University Hospital",
      "specialty": "Surgery"
    },
    {
      "type": "Fellowship",
      "institution": "Latin American Federation of Surgical Societies",
      "specialty": "Infections Committee"
    },
    {
      "type": "Fellowship",
      "institution": "University of Texas MD Anderson Cancer Center",
      "specialty": "Surgical Oncology"
    }
  ],
  "publications": [
    {
      "title": "Intrahepatic cholangiocarcinoma: role of imaging as a critical component for multi-disciplinary treatment approach",
      "pubmed_id": "40095023",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Childers BG, Denbo JW, Kim RD, Hoffe SE, Glushko T, Qayyum A, Anaya DA",
      "journal": "Abdom Radiol (NY)"
    },
    {
      "title": "APP-First: A Care Delivery Model Designed to Increase Access and Treatment Opportunities for Patients with Gastrointestinal Malignancies",
      "pubmed_id": "41145931",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Stefanou AJ, Hendrick L, Allen K, Hodul P, Denbo J, Fleming JB, Anaya DA",
      "journal": "Ann Surg Oncol"
    },
    {
      "title": "Optimizing Outcomes in Gallbladder Cancer: Identifying Predictors of Futile Up-Front Surgery in a Global Multi-center Study",
      "pubmed_id": "40050485",
      "year": "2025",
      "publication_date": "2025 Jun",
      "authors": "Serenari M, Berti D, Rivera B, Newhook TE, Kristjanpoller W, Ruzzenente A, Okuno M, De Bellis M, Panettieri E, Ahmad MU, Merlo I, De Rose AM, Nishino H, Sinnamon AJ, Donadon M, Hauger MS, Guevara OM, Munoz C, Denbo J, Chun YS, Tran Cao HS, Sanchez Claria R, Tzeng CD, De Aretxabala X, Vivanco M, Brudvik KW, Seo S, Pekolj J, Poultsides GA, Anaya DA, Torzilli G, Giuliante F, Guglielmi A, Vinuela E, Vauthey JN, Cescon M, Vega EA",
      "journal": "Ann Surg Oncol"
    },
    {
      "title": "Advanced gallbladder cancer (T3 and T4): insights from an international multicenter study",
      "pubmed_id": "40449084",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Chirban AM, Rivera B, Kawahara W, Mellado S, Niakosari M, Okuno M, Panettieri E, De Bellis M, Kristjanpoller W, Merlo I, Serenari M, Donadon M, Newhook TE, de Aretxabala X, Vivanco M, Brudvik KW, Seo S, Pekolj J, Poultsides GA, De Rose AM, Torzilli G, Giuliante F, Denbo J, Anaya DA, Vinuela E, Tzeng CD, Vauthey JN, Ruzzenente A, Vega EA",
      "journal": "J Gastrointest Surg"
    },
    {
      "title": "Detecting Early Recurrence With Circulating Tumor DNA in Stage I-III Biliary Tract Cancer After Curative Resection",
      "pubmed_id": "39772829",
      "pmc_id": "PMC11723488",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Yu J, He AR, Ouf M, Mehta R, Anaya DA, Denbo J, Bridges C, Tin A, Aushev VN, Palsuledesai CC, Sharma S, Jurdi A, Liu MC, Kim RD",
      "journal": "JCO Precis Oncol"
    },
    {
      "title": "ASO Visual Abstract: Optimizing Outcomes in Gallbladder Cancer: Identifying Predictors of Futile Up-Front Surgery in a Global Multi-Center Study",
      "pubmed_id": "40167838",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Serenari M, Berti D, Rivera B, Newhook TE, Kristjanpoller W, Ruzzenente A, Okuno M, De Bellis M, Panettieri E, Ahmad MU, Merlo I, De Rose AM, Nishino H, Sinnamon AJ, Donadon M, Hauger MS, Guevara OM, Munoz C, Denbo J, Chun YS, Cao HST, Claria RS, Tzeng CD, de Aretxabala X, Vivanco M, Brudvik KW, Seo S, Pekolj J, Poultsides GA, Anaya DA, Torzilli G, Giuliante F, Guglielmi A, Vinuela E, Vauthey JN, Cescon M, Vega EA",
      "journal": "Ann Surg Oncol"
    },
    {
      "title": "Surgery for Borderline Resectable Pancreatic Ductal Adenocarcinoma: Preoperative Planning, Technical Considerations, and Building a Program",
      "pubmed_id": "39237162",
      "year": "2024",
      "publication_date": "2024 Oct",
      "authors": "Drake J, Anaya DA, Fleming JB, Denbo JW",
      "journal": "Surg Clin N Am"
    },
    {
      "title": "Critical updates in neuroendocrine tumors: Version 9 American Joint Committee on Cancer staging system for gastroenteropancreatic neuroendocrine tumors",
      "pubmed_id": "38685134",
      "year": "2024",
      "publication_date": "2024 Jul",
      "authors": "Chauhan A, Chan K, Halfdanarson TR, Bellizzi AM, Rindi G, O'Toole D, Ge PS, Jain D, Dasari A, Anaya DA, Bergsland E, Mittra E, Wei AC, Hope TA, Kendi AT, Thomas SM, Flem S, Brierley J, Asare EA, Washington K, Shi C",
      "journal": "CA-Cancer J Clin"
    },
    {
      "title": "Patient's informational needs and outreach preferences: A cross-sectional survey study in patients with hepatobiliary malignancies",
      "pubmed_id": "38292078",
      "pmc_id": "PMC10825679",
      "year": "2024",
      "publication_date": "2024 Dec",
      "authors": "Stokes SM, Haider M, Vadaparampil ST, Levitt C, Hardy O, Kim R, Castillo DL, Denbo J, Fleming JB, Anaya DA",
      "journal": "PEC Innov"
    },
    {
      "title": "Evolution and current trends in the management of colorectal cancer liver metastasis",
      "pubmed_id": "38953758",
      "year": "2024",
      "publication_date": "2024 Aug",
      "authors": "Leiphrakpam PD, Newton R, Anaya DA, Are C",
      "journal": "Minerva Surg"
    }
  ],
  "grants": [
    {
      "description": "Title: Development and Implementation of a Standardized 3D-Printing Application to Optimize Routine Individualized Patient-Specific Surgical Care of Hepatobiliary Tumors.  \nAward Number: N/A  \nSponsor: PHI BETA PSI SORORITY  \nAnaya S. (PD/PI)",
      "title": "Development and Implementation of a Standardized 3D-Printing Application to Optimize Routine Individualized Patient-Specific Surgical Care of Hepatobiliary Tumors.",
      "sponsor": "PHI BETA PSI SORORITY  \nAnaya S. (PD/PI)"
    },
    {
      "description": "Title: Medtronic Educational Grant  \nAward Number: MDT230036585  \nSponsor: MEDTRONIC  \nAnaya S. (PD/PI)",
      "title": "Medtronic Educational Grant",
      "award_number": "MDT230036585",
      "sponsor": "MEDTRONIC  \nAnaya S. (PD/PI)"
    },
    {
      "description": "Title: Use of Personalized 3D-Printed Models and 3D-Virtual Simulation of Hepatobiliary Cancer to Improve Surgical Trainee Education and Operative Planning and Impact Perioperative Outcomes  \nAward Number:   \nSponsor: PHI BETA PSI SORORITY  \nDenbo, J. (PD/PI), Anaya S. (Co-PD/PI)",
      "title": "Use of Personalized 3D-Printed Models and 3D-Virtual Simulation of Hepatobiliary Cancer to Improve Surgical Trainee Education and Operative Planning and Impact Perioperative Outcomes",
      "award_number": "",
      "sponsor": "PHI BETA PSI SORORITY",
      "investigators": [
        {
          "name": "Denbo, J.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "participating_trials": [
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-22363/",
      "trial_id": "22363",
      "title": "Development and Implementation of a Standardized 3D-Printing Application to Optimize Routine Individualized Patient-Specific Surgical Care of Hepatobiliary Tumors",
      "condition": "Gastrointestinal Tumor",
      "status": "Open"
    }
  ],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/AnayaSaenzDaniel_15586.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=15586"
  },
  "content_hash": "1873a12436de0e3626089b555133872b8587e499c93a3907f359c9377b7a8f2d",
  "researcher_name": "daniel anaya saenz",
  "department": "health outcomes & behavior"
}