{
  "profile_url": "https://www.moffitt.org/research-science/researchers/dinorah-martinez-tyson/",
  "last_updated": "2025-11-21T22:50:23.469404",
  "researcher_id": "1454",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "",
  "research_program": "health outcomes & behavior",
  "overview": "As an applied medical anthropologist, I bring cross-cultural perspectives to the study of cancer health disparities as well as extensive experience in qualitative, ethnographic, and mixed methods research. My program of research has consistently focused on understanding the influence of socio-cultural factors on health and to develop and identify the best models and methods for adapting instrumentation and proven interventions to address health disparities across the cancer continuum.",
  "research_interests": [
    "She has worked to develop and culturally adapt evidence-based interventions to address the psychosocial and information needs of Hispanic patients. For example, she led an exploratory sequential mixed method study, which employed a series of iterative and group consensus-building approaches, to translate and culturally adapt the previously validated CaSUN measure into Spanish, for Latino cancer survivors. In addition, she also worked to culturally adapt and evaluate a patient self-administered stress-management training intervention for Hispanic/Latina breast cancer patients and education tools to promote cancer screening. She also has extensive experience in program evaluation and has conducted process and outcome evaluation for several National Cancer Institute and CDC funded health disparities initiatives, including the Tampa Bay Community Cancer Network, Cancer, and Culture and Literacy Training Institute and Florida Prevention Research Center. She is bilingual in English and Spanish and has worked closely with various community-based organizations to address health disparities among ethnic minorities and underserved populations in the United States as well as Latin America (e.g., Puerto Rico, Ecuador, Panama). Her community experience has also provided her with invaluable insights about partnership and coalition building processes. Dr. Martinez Tyson is also a volunteer with Latinos Unidos por Un Nuevo Amanecer, Inc. a non-profit organization that provides support to Latinos diagnosed with cancer and Campamento Alegria, a 3-Day integrative program for Latina cancer survivors. She is currently working with faculty across COPH on the Salud Latina Initiative to address Latino health disparities. Dr. Martinez Tyson has an outstanding mentorship record and serves as the major/co-major professor of several doctoral students. She is the recipient of the 2020 Dean’s Excellence in Teaching Award and the Excellence in Teaching Award, College of Public Health in 2017. She enjoys teaching and mentoring students immensely. She has extensive experience in qualitative methods and currently teaches three graduate level qualitative methods courses in the College of Public Health and has served as the qualitative lead on several NIH funded projects and qualitative content expert on numerous dissertation committees across USF. Dr. Martinez Tyson’s work has appeared in the journals CA: A Cancer Journal for Clinicians, Journal of Immigrant and Minority Health, Journal of Cancer Education, Health Promotion Practice, Social Science and Medicine and Cancer Control Journal. She is an associate editor for the Journal Ethnicity and Health. \n  *"
  ],
  "associations": [
    "Health Outcomes & Behavior Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "Northern Arizona University, MA"
    },
    {
      "type": "Graduate",
      "institution": "University of South Florida, MPH"
    },
    {
      "type": "Graduate",
      "institution": "University of Florida, PhD"
    }
  ],
  "publications": [
    {
      "title": "\"They still deserve for their pain to be controlled\": healthcare providers' and community-level stakeholders' perceptions of pain management among cancer survivors with an opioid use disorder",
      "pubmed_id": "40434495",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Chavez MN, Thomas HM, Lake P, Gutierrez A, Rigg KK, Marshall VK, Lubrano B, Rajasekhara S, Tyson DM",
      "journal": "Support Care Cancer"
    },
    {
      "title": "A mixed-methods study characterizing experiences of medical oncologists' use of gonadotropin-releasing hormone agonists for treatment of breast cancer",
      "pubmed_id": "40461861",
      "pmc_id": "PMC12209034",
      "year": "2025",
      "publication_date": "2025 Aug",
      "authors": "Lee KT, Hu B, Martinez Tyson D, Geiss C, Vadaparampil ST, Jim HSL, Gwede CK, Soliman HH, Henry NL, Hershman DL",
      "journal": "Breast Cancer Res Treat"
    },
    {
      "title": "From \"Where Are the Latinos?\" to \"How to Find Them\": A Qualitative Study to Inform Recruitment Efforts in an On-Going Psychosocial Cancer Trial for Dyads of Latina Cancer Survivors and Their Intimate Partners",
      "pubmed_id": "40729470",
      "year": "2025",
      "publication_date": "2025 Aug",
      "authors": "Trejos RF, Sanabria G, Ruiz E, Chavez M, Quiros G, Loecher N, Oswald LB, Barden S, Doss B, Martinez-Tyson D",
      "journal": "Psychooncology"
    },
    {
      "title": "Después del Cáncer: a qualitative exploration of navigating survivorship as a Latino couple following a breast cancer diagnosis",
      "pubmed_id": "40229582",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Chavez MN, Sanabria G, Trejos RF, Ruiz EL, Muńoz LP, Bastardo J, Belén AM, Graham IS, Velez M, Oswald LB, Barden S, Doss B, Tyson DM",
      "journal": "J Cancer Surviv"
    },
    {
      "title": "\"It Was a Downward Spiral\": A Qualitative Study of Young Adult Cancer Survivors' Experiences with Cognitive and Mental Health",
      "pubmed_id": "39594774",
      "pmc_id": "PMC11592372",
      "year": "2024",
      "publication_date": "2024 Nov",
      "authors": "Tometich DB, Hersh C, Maconi ML, Fulton HJ, Martinez Tyson D, Zambrano K, Hasan S, Welniak T, Rodriguez Y, Bryant C, Gudenkauf LM, Li X, Reed DR, Oswald LB, Galligan A, Small BJ, Jim HSL",
      "journal": "Cancers (Basel)"
    },
    {
      "title": "\"I couldn't connect the wires in my brain",
      "pubmed_id": "38420860",
      "year": "2024",
      "publication_date": "2024 Mar",
      "authors": "Tometich DB, Welniak T, Gudenkauf L, Maconi ML, Fulton HJ, Martinez Tyson D, Zambrano K, Hasan S, Rodriguez Y, Bryant C, Li X, Reed DR, Oswald LB, Galligan A, Small BJ, Jim HSL",
      "journal": "\" Young adult cancer survivors' experience with cognitive functioning"
    },
    {
      "title": "Transcreation matters: A learner centric participatory approach for adapting cancer prevention messages for Latinos",
      "pubmed_id": "37463555",
      "year": "2023",
      "publication_date": "2023 Oct",
      "authors": "Meade CD, Stanley NB, Arevalo M, Tyson DM, Chavarria EA, Aguado Loi CX, Rivera M, Gutierrez L, Abdulla R, Christy SM, Gwede CK",
      "journal": "Patient Educ Couns"
    },
    {
      "title": "Psychological Impact of COVID-19 on Oncology Patients: Perceptions of Oncology Health Care Providers",
      "pubmed_id": "35897163",
      "pmc_id": "PMC10079896",
      "year": "2023",
      "publication_date": "2023 Feb",
      "authors": "Chavez MN, Marshall VK, Martinez Tyson D, Mason TM, Rechenberg K",
      "journal": "West J Nurs Res"
    },
    {
      "title": "Barriers to Adequate Pain Control and Opioid Use Among Cancer Survivors: Implications for Nursing Practice",
      "pubmed_id": "37607374",
      "pmc_id": "PMC10232667",
      "year": "2023",
      "publication_date": "2023 Aug",
      "authors": "Marshall VK, Chavez M, Efre A, Lake PW, Rigg KK, Lubrano B, Pabbathi S, Rajasekhara S, Tyson DM",
      "journal": "Cancer Nurs"
    },
    {
      "title": "Spiritual well-being, distress and quality of life in Hispanic women diagnosed with cancer undergoing treatment with chemotherapy",
      "pubmed_id": "36121699",
      "pmc_id": "PMC10115137",
      "year": "2022",
      "publication_date": "2022 Nov",
      "authors": "Barata A, Hoogland AI, Small BJ, Acevedo KI, Antoni MH, Gonzalez BD, Jacobsen PB, Lechner SC, Tyson DM, Meade CD, Rodriguez Y, Salsman JM, Sherman AC, Sutton SK, Jim HSL",
      "journal": "Psychooncology"
    }
  ],
  "grants": [],
  "participating_trials": [],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers/MartinezTysonDinorah_1454.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=1454"
  },
  "content_hash": "428bb79ac05ac4a9cf14f1f8877a8cb50429167c322f97c35dd34dd649a02738",
  "researcher_name": "dinorah martinez tyson",
  "department": ""
}