{
  "profile_url": "https://www.moffitt.org/research-science/researchers/doug-letson",
  "last_updated": "2025-10-19T00:29:52.661213",
  "researcher_id": "1337",
  "degrees": [
    "MD"
  ],
  "title": "",
  "primary_program": "Sarcoma",
  "research_program": "Molecular Medicine Program",
  "overview": "Dr. Letson and his collaborators strive to develop novel surgical techniques for musculoskeletal tumors; tumor prosthesis for skeletal reconstruction; and navigational and robotic musculoskeletal tumor surgery.",
  "research_interests": [
    "As an orthopaedic oncology surgeon, Dr. Letson’s research and clinical interests include matrix metalloproteinases; novel therapeutic agents to treat sarcoma; limb salvage for bone and soft tissue tumors; as well as segmental prosthesis, new hinge designs and a soft tissue attachment for metallic prosthesis.\n  *"
  ],
  "associations": [
    "Sarcoma",
    "Tumor Microenvironment and Metastasis",
    "Molecular Medicine Program"
  ],
  "education": [
    {
      "type": "Medical School",
      "institution": "Louisiana State University",
      "degree": "MD"
    },
    {
      "type": "Internship",
      "institution": "Charity Hospital of Louisiana",
      "position": "Intern"
    },
    {
      "type": "Residency",
      "institution": "Louisiana State University Medical School Affiliated Hospitals",
      "specialty": "Orthopaedics"
    },
    {
      "type": "Fellowship",
      "institution": "Massachusetts General Hospital – Harvard Medical School",
      "specialty": "Musculoskeletal Oncology"
    }
  ],
  "publications": [
    {
      "title": "Soupir A, Ospina OE, Hampton O, Churchman M, Radmacher M, Hedges D, McKean D, Agius P, Zeeshan S, Seligson ND, Pollock R, Liebner D, Chen JL, Tinoco G, Salhia B, McCarter M, Wilky BA, Miller BJ, Cavnar MJ, Groundland JS, Schneider BP, Riedlinger G, Edge SB, Moskaluk CA, Cardona K, Naqash AR, Gonzalez RJ, Mullinax JE, Joyce DM, Binitie O, Douglas Letson G, Naghavi AO, Druta M, Reed DR, Siegel EM, Teer JK, Fridley BL, Brohl AS. Genomic, transcriptomic, and immunogenomic landscape of over 1300 sarcomas of diverse histology subtypes. Nat Commun",
      "pubmed_id": "40328759",
      "pmc_id": "PMC12055966",
      "year": "2025",
      "journal": "16(1):4206",
      "authors": ""
    },
    {
      "title": "Kuruvilla D, Huynh T, Nester M, Chose C, Zervoudakis G, Letson GD, Joyce DM, Binitie OT, Figura NB, Costello JR, Freeman CL, Lazarides AL. Management of bone disease with concurrent chimeric antigen receptor T-cell therapy for multiple myeloma. Crit Rev Oncol Hematol",
      "pubmed_id": "38942219",
      "year": "2024",
      "journal": "201:104429",
      "authors": ""
    },
    {
      "title": "West W, Moore A, Gerhardt C, Webb P, Binitie O, Lazarides A, Letson D, Joyce D. Dual plating in the metastatic distal humerus: Benefits may outweigh the risks. J Orthop",
      "pubmed_id": "38361983",
      "pmc_id": "PMC10864758",
      "year": "2024",
      "journal": "51:103-108",
      "authors": ""
    },
    {
      "title": "Karadimas T, Huynh TH, Chose C, Zervoudakis G, Clampitt B, Lapp S, Joyce D, Letson GD, Metts J, Binitie O, Mullinax JE, Lazarides A. Oncolytic Viral Therapy in Osteosarcoma. Viruses",
      "pubmed_id": "39066301",
      "pmc_id": "PMC11281467",
      "year": "2024",
      "journal": "16(7)",
      "authors": ""
    },
    {
      "title": "Belzarena AC, Binitie O, Letson GD, Joyce DM. Unplanned Sarcoma Excisions: Understanding How They Happen. J Am Acad Orthop Surg Glob Res Rev",
      "pubmed_id": "38252542",
      "pmc_id": "PMC10805420",
      "year": "2024",
      "journal": "8(1)",
      "authors": ""
    },
    {
      "title": "Caracciolo JT, Ali S, Chang CY, Degnan AJ, Flemming DJ, Henderson ER, Kransdorf MJ, Letson GD, Madewell JE, Murphey MD. Bone Tumor Risk Stratification and Management System: A Consensus Guideline from the ACR Bone Reporting and Data System Committee. J Am Coll Radiol",
      "pubmed_id": "37855758",
      "year": "2023",
      "journal": "20(10):1044-1058",
      "authors": ""
    },
    {
      "title": "Crimì A, Joyce DM, Binitie O, Ruggieri P, Letson GD. The history of resection prosthesis. Int Orthop",
      "pubmed_id": "36651984",
      "year": "2023",
      "journal": "47(3):873-883",
      "authors": ""
    },
    {
      "title": "Huynh THN, Kuruvilla DR, Nester MD, Zervoudakis G, Letson GD, Joyce DM, Binitie OT, Lazarides AL. Limb Amputations in Cancer: Modern Perspectives, Outcomes, and Alternatives. Curr Oncol Rep",
      "pubmed_id": "37999825",
      "year": "2023",
      "journal": "25(12):1457-1465",
      "authors": ""
    },
    {
      "title": "Yang G, Yuan Z, Ahmed K, Welsh EA, Fulp WJ, Gonzalez RJ, Mullinax JE, Letson D, Bui M, Harrison LB, Scott JG, Torres-Roca JF, Naghavi AO. Genomic identification of sarcoma radiosensitivity and the clinical implications for radiation dose personalization. Transl Oncol",
      "pubmed_id": "34246048",
      "pmc_id": "PMC8274330",
      "year": "2021",
      "journal": "14(10):101165",
      "authors": ""
    },
    {
      "title": "Alexander JH, Binitie OT, Letson GD, Joyce DM. Osteosarcoma: An Evolving Understanding of a Complex Disease. J Am Acad Orthop Surg",
      "pubmed_id": "34623342",
      "year": "2021",
      "journal": "29(20):e993-e1004",
      "authors": ""
    }
  ],
  "grants": [],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/LetsonDoug_1337.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=1337"
  },
  "content_hash": "b0e219d5bfc7eeded78410f25b38bc96295bfddf10a24ba50e63a4ef9a5ab7ea",
  "researcher_name": "Doug Letson",
  "department": "Tumor Microenvironment and Metastasis"
}