{
  "profile_url": "https://www.moffitt.org/research-science/researchers/dung-tsa-chen",
  "last_updated": "2025-10-21T16:36:31.747574",
  "researcher_id": "3829",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "Biostatistics and Bioinformatics",
  "research_program": "Molecular Medicine Program",
  "overview": "Statistical application in clinical trial data analysis, such as development of adverse event as valuable biomarker in predicting clinical outcomes.",
  "research_interests": [
    "Dr. Chen has been on numerous NCI grants as a co-investigator involving in the design, conduct, and analysis of research projects in cancer and has over 100 peer-reviewed publications. His key areas of expertise include microarray data analysis, mixed models, survival data analysis, biomarker analysis and clinical trials.His work involves the identification of novel biomarker strategies using genomics and other emerging technologies to guide clinical decision making. He has developed a statistical outlier approach to derive a malignancy-risk gene signature in breast cancer. This statistical outlier method has potential unique applications in cancer research, such as improved prediction of cancer risk, thereby providing better individualized therapy. Statistical outlier methods could be useful tools to help identify subgroups of individuals who may have high risk of cancer development and need special chemopreventive treatments. For example, an outlier gene signature to identifying high-risk normal breast tissue could improve the potential for breast biopsy to identify at-risk patients and refine the current practice of intraoperative assessment of the margins of the resected breast tissues based on histology alone, and may prove useful in guiding treatment choices after lumpectomy.\n  *"
  ],
  "associations": [
    "Biostatistics and Bioinformatics",
    "Thoracic Oncology",
    "Gastrointestinal Oncology",
    "Pentecost Family Myeloma Research Center",
    "Molecular Medicine Program",
    "Lung Cancer Center of Excellence",
    "Experimental Therapeutics Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of Texas at Houston, PhD"
    },
    {
      "type": "Graduate",
      "institution": "University of California, MA"
    }
  ],
  "publications": [
    {
      "title": "The Impact of Edema on Skeletal Muscle Changes among Patients with Pancreatic Ductal Adenocarcinoma",
      "pubmed_id": "40553455",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Davis EW, Park MA, Basinski TL, Arnoletti JP, Bloomston M, Carson TL, Biachi De Castria T, Chen DT, Cortizas EM, Crowder SL, Genilo-Delgado M, Douglas WG, Huguet KL, Jiang K, Hodul PJ, Karolak A, Kim DW, Koomen JM, Menon AA, Mo Q, Mok SR, Molina-Vega MA, Moreno-Urazan L, Ahmed S, Parker NH, Pimiento JM, Rasool G, Sparks LM, Stewart PA, Tassielli AF, Teer JK, Trevino JG, Velanovich V, Wang X, Whelan CJ, Judge SM, Judge AR, Fleming JB, Malafa MP, Jeong D, Permuth JB",
      "journal": "Cancer Epidemiol Biomarkers Prev"
    },
    {
      "title": "Lifetime stressor exposure and depression among patients with pancreatic cancer: insights from the Florida Pancreas Collaborative",
      "pubmed_id": "41062956",
      "pmc_id": "PMC12506433",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "DeSomma A, Maletz S, Basinski TL, Morales R, de Castria TB, Bloomston M, Chen DT, Douglas WG, Huguet KL, Jeong D, Jiang K, Kim DW, Luthra A, Pimiento JM, Rajasekhara S, Velanovich V, Park MA, Shields GS, Slavich GM, Permuth JB",
      "journal": "BMC Cancer"
    },
    {
      "title": "Creation and Characterization of a Breast Cancer Tissue Microarray Including Black and White Patients from Florida and Hispanic Patients from Puerto Rico and Florida",
      "pubmed_id": "40309949",
      "pmc_id": "PMC12082392",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Lantz AE, Gordián ER, Rosa M, Rodríguez Ruíz M, Johnson JO, Gebert R, Bahr A, Chen DT, Dutil J, Li J, Oliveras Torres JA, Saavedra HI, Eschrich SA, Flores I, Cress WD",
      "journal": "Cancer Res Commun"
    },
    {
      "title": "Impaired T cell and neoantigen retention in time-serial analysis of metastatic non-small cell lung cancer in patients unresponsive to TIL cell therapy",
      "pubmed_id": "40341231",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Wang C, Yu X, Teer JK, Yao J, Du D, Liu X, Thompson ZJ, Wang MH, Welsh EA, Memon D, Chan TA, Makarov V, Anadon CM, Saeed L, Boyle TA, Fang B, Koomen JM, Cox C, Landin AM, Yoder SJ, Kim S, Chen DT, Pilon-Thomas SA, Conejo-Garcia JR, Antonia SJ, Haura EB, Creelan BC",
      "journal": "Nat Cancer"
    },
    {
      "title": "A sample size analysis of a mathematical model of longitudinal tumor volume and progression-free survival for Bayesian individual dynamic predictions in recurrent high-grade glioma",
      "pubmed_id": "39737733",
      "pmc_id": "PMC11919271",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Glazar DJ, Sahebjam S, Yu HM, Chen DT, Bhandari M, Enderling H",
      "journal": "CPT Pharmacometrics Syst Pharmacol"
    },
    {
      "title": "Timeliness of Newer Targeted Therapy and Survival in Lung Cancer: A Population-Based Analysis",
      "pubmed_id": "40472300",
      "year": "2025",
      "publication_date": "2025 Jun",
      "authors": "Tanvetyanon T, Joshi U, Chen DT, Gray JE",
      "journal": "JCO Oncol Pract"
    },
    {
      "title": "Race-based differences in serum biomarkers for cancer-associated cachexia in a diverse cohort of patients with pancreatic ductal adenocarcinoma",
      "pubmed_id": "39989973",
      "pmc_id": "PMC11844656",
      "year": "2025",
      "publication_date": "2025 Feb",
      "authors": "Permuth J, Park M, Davis E, Alhassan S, Arnoletti J, Basinski T, McKee A, Bloomston M, Carson T, de Castria TB, Chen DT, Cortizas E, Crowder S, Delgado MG, Douglas W, Fleming J, Hodul P, Huguet K, Jiang K, Kim DW, Koomen J, Luthra A, Malafa M, Menon A, Morales R, Merchant N, Meredith K, Mo Q, Molina-Vega M, Moreno-Urazan L, Olumoyin K, Parker N, Pimiento J, Rasool G, Rejniak K, Sansil S, Sparks L, Stewart P, Tassielli A, Teer J, Tran DV, Trevino J, Velanovich V, Whelan C, Jeong D, Judge S, Judge A",
      "journal": "Res Sq"
    },
    {
      "title": "Phase 1 trial of hypofractionated stereotactic re-irradiation in combination with nivolumab, ipilimumab, and bevacizumab for recurrent high-grade gliomas",
      "pubmed_id": "40134851",
      "pmc_id": "PMC11934552",
      "year": "2025",
      "publication_date": "2025 Feb",
      "authors": "Sahebjam S, Raval RR, Forsyth PA, Enderling H, Tran ND, Arrington JA, Macaulay R, Perlow HK, Palmer JD, Ghose J, Rajappa P, Giglio P, Li Z, Etame AB, Mokhtari S, Cruz-Chamorro RJ, Bhandari M, Thapa R, Robinson TJ, Chen DT, Yu HM",
      "journal": "Neurooncol Adv"
    },
    {
      "title": "ShinyEvents: harmonizing longitudinal data for real world survival estimation",
      "pubmed_id": "40799741",
      "pmc_id": "PMC12340904",
      "year": "2025",
      "publication_date": "2025 Aug",
      "authors": "Obermayer A, Davis J, Talada DP, Teng M, Eschrich S, Yin V, Spakowicz D, Dhrubo D, Rounbehler RJ, Churchman ML, Tarhini AA, Wang X, Gupta S, Markowitz J, Goecks J, Li R, Rodriguez-Pessoa R, Manley BJ, Tan AC, Grass GD, Chen DT, Shaw TI",
      "journal": "Res Sq"
    },
    {
      "title": "Integrative Immune Signature of Complementary Circulating and Tumoral Biomarkers Maximizes the Predictive Power of Adjuvant Immunotherapeutic Benefits in High-risk Melanoma",
      "pubmed_id": "40392969",
      "pmc_id": "PMC12316551",
      "year": "2025",
      "publication_date": "2025 Aug",
      "authors": "Tarhini AA, Obermayer A, Lee SJ, LaFramboise WA, Hodi FS, Karunamurthy AD, Eljilany I, Chen DT, Hwu P, El Naqa IM, Streicher H, Sondak VK, Storkus WJ, Butterfield LH, Shaw TI, Kirkwood JM",
      "journal": "Clin Cancer Res"
    }
  ],
  "grants": [
    {
      "description": "Title: Development of Adverse Event (AE) Derived Biomarkers for Predicting Clinical Outcomes in Lung Cancer  \nAward Number: 1R21CA286417-01  \nSponsor: National Cancer Institute (NCI)  \nChen, D. (PD/PI)",
      "title": "Development of Adverse Event (AE) Derived Biomarkers for Predicting Clinical Outcomes in Lung Cancer",
      "award_number": "1R21CA286417-01",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Chen, D.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Modernize Adverse Event (AE) Data to Develop Predictive AE Biomarkers for Fulfilling Oncological Precision Medicine  \nAward Number: MOAAX  \nSponsor: Florida Department of Health  \nChen, D. (PD/PI), Gray, J. (Co-PD/PI)",
      "title": "Modernize Adverse Event (AE) Data to Develop Predictive AE Biomarkers for Fulfilling Oncological Precision Medicine",
      "award_number": "MOAAX",
      "sponsor": "Florida Department of Health",
      "investigators": [
        {
          "name": "Chen, D.",
          "role": "PD/PI"
        },
        {
          "name": "Gray, J.",
          "role": "Co-PD/PI"
        }
      ]
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/ChenDung-Tsa_3829.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=3829"
  },
  "content_hash": "801a39e87e1825059a3315499424321525bff994c5b7a53d938368b46453bc5f",
  "researcher_name": "Dung Tsa Chen",
  "department": "Biostatistics and Bioinformatics"
}