{
  "profile_url": "https://www.moffitt.org/research-science/researchers/ellen-daley/",
  "last_updated": "2025-11-21T22:50:23.624092",
  "researcher_id": "3495",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "",
  "research_program": "health outcomes & behavior",
  "overview": "",
  "research_interests": [
    "Dr. Daley is a behavioral scientist whose research interests center on aspects of cancer screening and prevention, specifically, the connection between the sexually transmitted infection human papillomavirus (HPV) and cervical, anal and oral cancer. Dr. Daley is directing a National Institutes of Health (NIH)-funded study in an inter-programmatic collaboration with Anna Giuliano, PhD, of the Cancer Epidemiology Program, looking at the cognitive and emotional responses to HPV testing in men. Among the outcomes of interest are men’s willingness to disclose their test results to their partners, encourage their partners to receive a Pap smear, and consider receiving a vaccination against HPV. She has also conducted research related to HPV’s role in oral cancers, specifically looking at the knowledge, attitudes and behaviors of oral health providers towards the HPV vaccine.\n  *"
  ],
  "associations": [
    "Health Outcomes & Behavior Program",
    "Center for Immunization & Infection Research in Cancer"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of South Florida, College of Public Health, PhD"
    },
    {
      "type": "Graduate",
      "institution": "University of Michigan, School of Public Health, MPH"
    }
  ],
  "publications": [
    {
      "title": "Characteristics associated with the adoption of consumer-based -self-sampling methods for sexually transmitted infection screening",
      "pubmed_id": "36701488",
      "year": "2024",
      "publication_date": "2024 Dec",
      "authors": "Griner SB, Beckstead JW, Vamos CA, Puccio JA, Perrin K, Daley EM",
      "journal": "J Am Coll Health"
    },
    {
      "title": "Improving United States HPV vaccination rates: Factors predictive of parental attitudes towards middle school entry requirements",
      "pubmed_id": "39268680",
      "pmc_id": "PMC11404577",
      "year": "2024",
      "publication_date": "2024 Dec",
      "authors": "Desch J, Thompson E, Beckstead J, Owens H, Richardson Cayama M, Hernandez P, Valencia J, Zimet G, Vamos C, Daley E",
      "journal": "Hum Vaccin Immunother"
    },
    {
      "title": "Health literacy needs and preferences for a technology-based intervention to improve college students' sexual and reproductive health",
      "pubmed_id": "35298353",
      "year": "2024",
      "publication_date": "2024 Apr",
      "authors": "Vamos CA, Puccio JA, Griner SB, Logan RG, Piepenbrink R, Richardson Cayama M, Lovett SM, Mahony H, Daley EM",
      "journal": "J Am Coll Health"
    },
    {
      "title": "Understanding the Challenges of HPV-Based Cervical Screening: Development and Validation of HPV Testing and Self-Sampling Attitudes and Beliefs Scales",
      "pubmed_id": "36661742",
      "pmc_id": "PMC9858121",
      "year": "2023",
      "publication_date": "2023 Jan",
      "authors": "Tatar O, Haward B, Zhu P, Griffin-Mathieu G, Perez S, McBride E, Lofters AK, Smith LW, Mayrand MH, Daley EM, Brotherton JML, Zimet GD, Rosberger Z",
      "journal": "Curr Oncol"
    },
    {
      "title": "Assessing college students' interest in university-based oral health information and services",
      "pubmed_id": "33577423",
      "year": "2023",
      "publication_date": "2023 Jan",
      "authors": "Griner SB, Vamos CA, Phillips AC, Puccio JA, Thompson EL, Daley EM",
      "journal": "J Am Coll Health"
    },
    {
      "title": "Key Considerations and Recommended Strategies for Conducting a School-Based Longitudinal RE-AIM Evaluation: Insights From a 28-School Cluster Randomized Trial",
      "pubmed_id": "34605711",
      "year": "2023",
      "publication_date": "2023 Jan",
      "authors": "Marhefka SL, Noble CA, Walsh-Buhi ER, Turner D, Mahony H, Singleton A, DeBate R, Daley EM",
      "journal": "Health Promot Pract"
    },
    {
      "title": "MCH Leadership Training Program: An Innovative Application of an Implementation Science Framework",
      "pubmed_id": "36828973",
      "pmc_id": "PMC9955516",
      "year": "2023",
      "publication_date": "2023 Apr",
      "authors": "Vamos CA, Salinas-Miranda AA, Daley EM, Kirby RS, Liller KD, Marshall J, Sappenfield WM, Wilson RE, Petersen DJ",
      "journal": "Matern Child Health J"
    },
    {
      "title": "Prenatal oral health guidelines: a theory- and practice-informed approach to survey development using a modified-Delphi technique and cognitive interviews",
      "pubmed_id": "36443891",
      "pmc_id": "PMC9703729",
      "year": "2022",
      "publication_date": "2022 Nov",
      "authors": "Vamos CA, Griner SB, Daley EM, Cayama MR, Beckstead J, Boggess K, Quinonez RB, Damschroder L",
      "journal": "Implement Sci Commun"
    },
    {
      "title": "Ensuring a Successful Transition From Cytology to Human Papillomavirus-Based Primary Cervical Cancer Screening in Canada by Investigating the Psychosocial Correlates of Women's Intentions: Protocol for an Observational Study",
      "pubmed_id": "35708742",
      "pmc_id": "PMC9247817",
      "year": "2022",
      "publication_date": "2022 Jun",
      "authors": "Griffin-Mathieu G, Haward B, Tatar O, Zhu P, Perez S, Shapiro GK, McBride E, Thompson EL, Smith LW, Lofters AK, Daley EM, Guichon JR, Waller J, Steben M, Decker KM, Mayrand MH, Brotherton JML, Ogilvie GS, Zimet GD, Norris T, Rosberger Z",
      "journal": "JMIR Res Protoc"
    },
    {
      "title": "Does health literacy affect fruit and vegetable consumption? An assessment of the relationship between health literacy and dietary practices among college students",
      "pubmed_id": "32150517",
      "year": "2022",
      "publication_date": "2022 Jan",
      "authors": "Oberne A, Vamos C, Wright L, Wang W, Daley E",
      "journal": "J Am Coll Health"
    }
  ],
  "grants": [],
  "participating_trials": [],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=3495"
  },
  "content_hash": "d6dd6a1bb16375e67da5a0f978c8547df01b88f7cdd4c396ea0a6f809b1c6681",
  "researcher_name": "ellen daley",
  "department": ""
}