{
  "profile_url": "https://www.moffitt.org/research-science/researchers/elsa-flores",
  "last_updated": "2025-10-19T00:25:37.231295",
  "researcher_id": "17085",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "Molecular Oncology",
  "research_program": "Cancer Biology & Evolution Program",
  "overview": "The focus of my laboratory is to understand the p53 family pathway to target this pathway therapeutically in cancer. As a basic scientist, my lab has made important discoveries in understanding the functions of the p53 family and its family members, as described below. The overarching goal of my lab is to use this knowledge to target cancers with mutations in this pathway. Becoming part of the Moffitt Cancer Center is essential and offers a unique opportunity to accomplish my goals. I look forward to integrating my laboratory with others at Moffitt.",
  "research_interests": [
    "The main focus of my laboratory is to understand the overlapping and unique activities of the p53 family in human cancer using mouse models and patient derived tumors. p53 is commonly mutated in human cancer and has been difficult to target therapeutically in cancer. This is due to the complex network of genes regulated by p53 and the extensive interactions with its family members, p63 and p73. Prior to my work, very little was known about p63 and p73 function in cancer. We have demonstrated that p63 and p73 are required for p53 to induce apoptosis in response to DNA damage, which is critical for the response to chemo- and radiation therapy of tumors. Additionally, my laboratory generated genetically engineered mouse models mutant for isoforms of p63 and p73 and provided the first evidence that p63 and p73 are potent suppressors of tumorigenesis and metastasis. Using our mouse models we have unveiled previously unappreciated functions for TAp63, which we identified as the tumor suppressive isoform of p63 in mouse and human tumors, and ∆Np63, the oncogenic isoform, in the regulation of microRNA biogenesis, stem cell maintenance, aging, and metabolism. We have also found that TAp63 and TAp73 can compensate for p53 function in vivo and found that inhibition of ∆Np63 or ∆Np73 leads to tumor regression in p53-/- mice by upregulation of TAp63 and TAp73 function and metabolic reprogramming within those tumors. The work from my laboratory indicates that the inter-related functions of the p53 family members must be understood for effective therapy of tumors with alterations in the p53 pathway. We are poised to make further advances in understanding the molecular mechanisms employed by this gene family in multiple biological processes. We are currently using genomic approaches to understand the regulation of multiple downstream pathways of the p53 family including the functions and regulation of long non-coding RNAs in multiple cancers, stem cell regulation, and tumor metabolism.\n  *"
  ],
  "associations": [
    "Molecular Oncology",
    "Cutaneous Oncology",
    "Thoracic Oncology",
    "Cancer Biology & Evolution Program",
    "Lung Cancer Metabolism Working Group",
    "Melanoma & Skin Cancer Center of Excellence",
    "Lung Cancer Center of Excellence"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of Wisconsin-Madison-McCardle Laboratory for Cancer Research, PhD"
    },
    {
      "type": "Fellowship",
      "institution": "Massachusetts Institute of Technology",
      "specialty": ""
    }
  ],
  "publications": [
    {
      "title": "Shepard A, Lester DK, Troutman S, Hoxha S, Khaled WT, Smith ESJ, Park TJ, Buffenstein R, Du D, Teng M, Dengler-Crish CM, Tsai KY, Flores ER, Ventura A, Kissil JL. An Autochthonous Model of Lung Cancer Identifies Requirements for Cellular Transformation in the Naked Mole-Rat. Cancer Discov",
      "pubmed_id": "40920097",
      "pmc_id": "PMC12486303",
      "year": "2025",
      "authors": ""
    },
    {
      "title": "Lazure F, Drapela S, Liu X, Lockhart JH, Kashfi H, Sarigul N, Ilter D, Flores ER, Wang X, Smalley I, Jaeger A, Yu X, Gomes AP. Aging directs the differential evolution of KRAS-driven lung adenocarcinoma. bioRxiv",
      "pubmed_id": "39896625",
      "pmc_id": "PMC11785146",
      "year": "2025",
      "authors": ""
    },
    {
      "title": "Jinesh GG, Smallin MT, Mtchedlidze N, Napoli M, Lockhart JH, Flores ER, Brohl AS. C19MC drives nucleolar invasion of mitochondria and meiotic nuclear division in human cancers. iScience",
      "pubmed_id": "39563898",
      "pmc_id": "PMC11575172",
      "year": "2024",
      "journal": "27(11):111132",
      "authors": ""
    },
    {
      "title": "Flores ER, Sawyer WG. Engineering cancer's end: An interdisciplinary approach to confront the complexities of cancer. Cancer Cell",
      "pubmed_id": "38848721",
      "year": "2024",
      "journal": "42(7):1133-1137",
      "authors": ""
    },
    {
      "title": "Jinesh GG, Smallin MT, Mtchedlidze N, Godwin I, Napoli M, Hackel N, Phadke MS, Deshpande AA, Li X, Lockhart JH, Baldwin JR, Acevedo-Acevedo S, Gao Y, Reiser MA, Smalley KSM, Flores ER, Brohl AS. C19MC miRNA-520G induces SP100 antiviral gene transcription and inhibits melanin production in skin cutaneous melanoma. Genes Dis",
      "pubmed_id": "37588194",
      "pmc_id": "PMC10425800",
      "year": "2024",
      "journal": "11(1):60-63",
      "authors": ""
    },
    {
      "title": "Napoli M, Deshpande AA, Chakravarti D, Rajapakshe K, Gunaratne PH, Coarfa C, Flores ER. Genome-wide p63-Target Gene Analyses Reveal TAp63/NRF2-Dependent Oxidative Stress Responses. Cancer Res Commun",
      "pubmed_id": "38165157",
      "pmc_id": "PMC10832605",
      "year": "2024",
      "journal": "4(2):264-278",
      "authors": ""
    },
    {
      "title": "Narváez-Bandera I, Lui A, Ayalew Mekonnen Y, Rubio V, Sulman N, Wilson C, Ackerman HD, Ospina OE, Gonzalez-Calderon G, Flores E, Li Q, Chen A, Fridley B, Stewart P. iModMix: Integrative Module Analysis for Multi-omics Data. bioRxiv",
      "pubmed_id": "39605665",
      "pmc_id": "PMC11601443",
      "year": "2024",
      "authors": ""
    },
    {
      "title": "Su X, Chakravarti D, Cho MS, Liu L, Gi YJ, Lin YL, Leung ML, El-Naggar A, Creighton CJ, Suraokar MB, Wistuba I, Flores ER. Author Correction: TAp63 suppresses metastasis through coordinate regulation of Dicer and miRNAs. Nature",
      "pubmed_id": "39030431",
      "year": "2024",
      "journal": "632(8024):E2",
      "authors": ""
    },
    {
      "title": "Yoon SJ, Combs JA, Falzone A, Prieto-Farigua N, Caldwell S, Ackerman HD, Flores ER, DeNicola GM. Comprehensive Metabolic Tracing Reveals the Origin and Catabolism of Cysteine in Mammalian Tissues and Tumors. Cancer Res",
      "pubmed_id": "36862034",
      "pmc_id": "PMC10152234",
      "year": "2023",
      "journal": "83(9):1426-1442",
      "authors": ""
    },
    {
      "title": "Lockhart JH, Ackerman HD, Lee K, Abdalah M, Davis AJ, Hackel N, Boyle TA, Saller J, Keske A, Hänggi K, Ruffell B, Stringfield O, Cress WD, Tan AC, Flores ER. Grading of lung adenocarcinomas with simultaneous segmentation by artificial intelligence (GLASS-AI). NPJ Precis Oncol",
      "pubmed_id": "37464050",
      "pmc_id": "PMC10354042",
      "year": "2023",
      "journal": "7(1):68",
      "authors": ""
    }
  ],
  "grants": [
    {
      "description": "Title: Integrated Program in Cancer and Data Science  \nAward Number: 5T32CA233399-04  \nSponsor: National Cancer Institute (NCI)  \nCress, W. (PD/PI), Flores, E. (PD/PI), Fridley, B. (PD/PI)",
      "source": "NCI",
      "period": "3399-04"
    },
    {
      "description": "Title: Identifying Metabolic Vulnerabilities in Lung Cancer  \nAward Number: 5P01CA250984-05  \nSponsor: National Cancer Institute (NCI)  \nFlores, E. (PD/PI), Haura, E. (PD/PI)",
      "source": "NCI",
      "period": "0984-05"
    },
    {
      "description": "Title: Community Project Funding/Congressionally Directed Spending Construction  \nAward Number: 1CE1HS52143?01?00  \nSponsor: Health Resources and Services Administration (HRSA)  \nFlores, E. (PD/PI)"
    },
    {
      "description": "Title: Targeting \"Undruggable\" Pathways  \nAward Number: MOAAZ  \nSponsor: Florida Department of Health  \nFlores, E. (PD/PI)"
    },
    {
      "description": "Title: TAp63 Regulated Long noncoding RNAs (TROLLs) as novel therapeutic targets in high grade serous ovarian cancer  \nAward Number: Dr. Robert C. Knapp Fellowship  \nSponsor: Hearing the Ovarian Cancer Whisper (HOW)  \nFlores, E. (), Lui, A. (PD/PI)"
    },
    {
      "description": "Title: Dual Up- and Downstream Targeting of POU2F3 in Small Cell Lung Cancer  \nAward Number: HT94252410567 Log No. LC230490  \nSponsor: Department of Defense (DOD)  \nRix, U. (PD/PI), Flores, E. (Co-PD/PI)",
      "source": "DOD"
    },
    {
      "description": "Title: Novel combination approaches for targeting oncogenic signaling dependencies in POU2F3- driven small cell lung cancer  \nAward Number: 24B02  \nSponsor: Florida Department of Health  \nFlores, E. (PD/PI), Rix, U. (PD/PI)"
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/FloresElsa_17085.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=17085"
  },
  "content_hash": "683e203d1d3ff6ccf111dd45e927140c70a437a25fe8dde1afeea4b3dd70a1d8",
  "researcher_name": "Elsa Flores",
  "department": "Molecular Oncology"
}