{
  "profile_url": "https://www.moffitt.org/research-science/researchers/fabiana-perna",
  "last_updated": "2025-10-21T16:39:11.342078",
  "researcher_id": "35899",
  "degrees": [
    "MD",
    "PhD"
  ],
  "title": "",
  "primary_program": "Blood and Marrow Transplant and Cellular Immunotherapy",
  "research_program": "Immuno-Oncology Program",
  "overview": "The Perna lab seeks to understand how genetic or molecular abnormalities impact the cancer surface proteome and rationally design new therapies, especially immune-based therapeutic interventions such as CAR T-cell therapy targeting cell surface proteins.",
  "research_interests": [
    "The Perna lab contributed to technological advancements for the comprehensive and accurate analysis of the cancer surface proteome, allowing for enhanced characterization and immunotherapy target discovery in cancer, especially hematologic malignancies. By integrating mass-spectrometry and RNA-seq analyses we generate pools of candidate targets that we investigate biologically and therapeutically and extensively validate in primary malignant and normal tissues. We also run antibody discovery campaigns to generate novel binders for the pre-clinical developments of novel CAR T cells. Dr. Perna is the PI of two research grants from the National Cancer Institute: NIH/NCI R37CA276939-01A1 and NIH/NCI R21CA280367-01. She also received research grants from the Leukemia Research Foundation grant and industry to develop novel CAR T cells recognizing novel target antigens that her own lab identified. \n  *"
  ],
  "associations": [
    "Blood and Marrow Transplant and Cellular Immunotherapy",
    "Immunology",
    "BioEngineering",
    "Immuno-Oncology Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "Memorial Sloan Kettering Cancer Center, New York, NY, PhD"
    },
    {
      "type": "Medical School",
      "institution": "Federico II University, Naples, Italy",
      "degree": "MD"
    },
    {
      "type": "Residency",
      "institution": "Federico II University, Naples, Italy",
      "specialty": ""
    },
    {
      "type": "Fellowship",
      "institution": "Memorial Sloan Kettering Cancer Center, New York, NY",
      "specialty": ""
    },
    {
      "type": "Fellowship",
      "institution": "Memorial Sloan Kettering Cancer Center, New York, NY",
      "specialty": ""
    }
  ],
  "publications": [
    {
      "title": "Phase II Trial of Reduced-Intensity Fludarabine, Melphalan, and Total Body Irradiation Conditioning With Haploidentical Donor Peripheral Blood Stem Cell Transplant",
      "pubmed_id": "40492500",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Elmariah H, Kim J, Gonzalez R, DiMaggio E, Sansil S, Mishra A, Faramand R, Perez L, Lazaryan A, Mirza AS, Khimani F, Liu H, Ochoa-Bayona JL, Nieder M, Perna F, Figura N, Robinson TJ, Nishihori T, Anasetti C, Pidala JA, Bejanyan N",
      "journal": "Am J Hematol"
    },
    {
      "title": "Developing SEMA4A-directed CAR T cells to overcome low BCMA antigen density in multiple myeloma",
      "pubmed_id": "41072416",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Di Meo F, Albano F, Cesarano A, Wang Y, Kale B, Shain K, Silva A, Kurihara N, Tenshin H, Jellyman D, Song X, Ghaffari S, Mesa H, Creelan B, Freeman C, Zhao X, Meads MB, Rodriguez PC, Marino S, Locke F, Hwu P, Roodman D, Mansilla-Soto J, Perna F",
      "journal": "Cancer Cell"
    },
    {
      "title": "Sarcopenia and Skeletal Muscle Loss after CAR T-cell Therapy in Diffuse Large B-cell Lymphoma",
      "pubmed_id": "40238583",
      "pmc_id": "PMC12213223",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Jhaveri K, Thapa R, Ercan D, Saha A, Noble J, Singh P, Fahrmann J, Saini N, Wu R, Dennison JB, Hanash S, Jenq RR, Modi K, Figura N, Chavez J, Shah B, Nishihori T, Lazaryan A, Khimani F, Bachmeier C, Gage K, Mishra A, Perna F, Davila ML, Spiegel J, Rejeski K, Subklewe M, Locke FL, Freeman C, Parker N, Jain MD",
      "journal": "Clin Cancer Res"
    },
    {
      "title": "Cytopenias and infections following ciltacabtagene autoleucel in heavily-pretreated relapsed or refractory multiple myeloma",
      "pubmed_id": "40637727",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Dima D, Logue JM, Waqar SHB, Peres LC, Colin-Leitzinger CM, De Avila G, Smith EC, Skelson L, Matte KL, Blue B, Hovanky VN, Gaballa M, Pasvolsky O, Oswald LB, Fortuna GGM, Wagner CB, DeJarnette S, Dillard C, Perna F, Mikkilineni L, Hosoya H, Freeman CL, Shain KH, Baz RC, Grajales-Cruz A, Puglianini OC, Alsina M, Locke FL, Shune LO, Sborov DW, Patel KK, Sidana S, Hansen DK",
      "journal": "Haematologica"
    },
    {
      "title": "On the Road to Safer CAR Therapy for B-Cell Lymphoma: Real-World Evidence",
      "pubmed_id": "40617680",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "DaCosta-Clark T, Kale B, Perna F",
      "journal": "Transplant Cell Ther"
    },
    {
      "title": "mRNA-based therapeutic strategies for cancer treatment",
      "pubmed_id": "38702886",
      "pmc_id": "PMC11403232",
      "year": "2024",
      "publication_date": "2024 Sep",
      "authors": "Taibi T, Cheon S, Perna F, Vu LP",
      "journal": "Mol Ther"
    },
    {
      "title": "Mapping the cancer surface proteome in search of target antigens for immunotherapy",
      "pubmed_id": "39068512",
      "pmc_id": "PMC11403220",
      "year": "2024",
      "publication_date": "2024 Sep",
      "authors": "Di Meo F, Kale B, Koomen JM, Perna F",
      "journal": "Mol Ther"
    },
    {
      "title": "Staying on target in gene and cell therapy",
      "pubmed_id": "39178850",
      "pmc_id": "PMC11403208",
      "year": "2024",
      "publication_date": "2024 Sep",
      "authors": "Bricker-Anthony R, Koeberl DD, Lipshutz GS, Perna F",
      "journal": "Mol Ther"
    },
    {
      "title": "Outcomes of Haploidentical Stem Cell Transplant Recipients With HHV-6B Reactivation",
      "pubmed_id": "39411216",
      "pmc_id": "PMC11475747",
      "year": "2024",
      "publication_date": "2024 Oct",
      "authors": "Handley G, Yepes A, Eliassen E, Dominguez G, Pasikhova Y, Klinkova O, Baluch A, Febres-Aldana AJ, Alsina M, Elmariah H, Khimani F, Hansen DK, Freeman CL, Jain MD, Locke F, Lazaryan A, Liu HD, Mishra A, Mirza AS, Nishihori T, Ochoa L, Perez L, Pidala J, Puglianini OC, Nieder M, Perna F, Kim J, Bejanyan N, Faramand R",
      "journal": "Open Forum Infect Dis"
    },
    {
      "title": "PARP1 promotes tumor proliferation in lenalidomide-resistant multiple myeloma via the downregulation of microRNA-192-5p-AKT signaling",
      "pubmed_id": "39697751",
      "pmc_id": "PMC11651790",
      "year": "2024",
      "publication_date": "2024 Nov",
      "authors": "Luo Y, Chen Y, Ai C, Huang X, Perna F, Kale BJ, Lim SM, Gu M, Gao P, Rong C, Zhou Z, Weng Y, Jiang Y, Yang F, Xia Y",
      "journal": "Transl Cancer Res"
    }
  ],
  "grants": [
    {
      "description": "Title: Investigations into the role of the bone marrow microenvironment on CAR therapy efficacy and toxicity  \nAward Number: 0240002519  \nSponsor: Moffitt Cancer Center  \nPerna, F. (PD/PI)",
      "title": "Investigations into the role of the bone marrow microenvironment on CAR therapy efficacy and toxicity",
      "award_number": "0240002519",
      "sponsor": "Moffitt Cancer Center",
      "investigators": [
        {
          "name": "Perna, F.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Alternatively spliced cell surface proteins as drivers of leukemogenesis and targets for immunotherapy  \nAward Number: 5R21CA280367-02  \nSponsor: National Cancer Institute (NCI)  \nPerna, F. (PD/PI)",
      "title": "Alternatively spliced cell surface proteins as drivers of leukemogenesis and targets for immunotherapy",
      "award_number": "5R21CA280367-02",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Perna, F.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Identifying cell surface targets for innovative immunotherapy of Multiple Myeloma  \nAward Number: R37CA276939-02  \nSponsor: National Cancer Institute (NCI)  \nPerna, F. (PD/PI)",
      "title": "Identifying cell surface targets for innovative immunotherapy of Multiple Myeloma",
      "award_number": "R37CA276939-02",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Perna, F.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/PernaFabiana_35899.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=35899"
  },
  "content_hash": "251edd73c4b7b4bc4f1d7243292d414ce97a4841eedd60af9b8f9d4b8b9fc839",
  "researcher_name": "Fabiana Perna",
  "department": "BioEngineering"
}