{
  "profile_url": "https://www.moffitt.org/research-science/researchers/hatem-soliman",
  "last_updated": "2025-10-21T16:40:27.639050",
  "researcher_id": "4606",
  "degrees": [
    "MD"
  ],
  "title": "",
  "primary_program": "Breast Oncology",
  "research_program": "Immuno-Oncology Program",
  "overview": "My research focuses on the role of the immune system in the natural history of breast cancer and developing new immunotherapy strategies to improve outcomes in breast cancer.",
  "research_interests": [
    "Dr. Soliman's research focuses on the development of new immunotherapy treatments (vaccines, immune modulating drugs) in the treatment of breast cancer.\n  *"
  ],
  "associations": [
    "Breast Oncology",
    "Tumor Microenvironment and Metastasis",
    "Immuno-Oncology Program",
    "Experimental Therapeutics Program"
  ],
  "education": [
    {
      "type": "Medical School",
      "institution": "Medical College of Georgia",
      "degree": "MD"
    },
    {
      "type": "Residency",
      "institution": "University of South Florida",
      "position": "Intern",
      "specialty": "al Medicine"
    },
    {
      "type": "Fellowship",
      "institution": "University of South Florida",
      "specialty": "Hematology/Oncology"
    }
  ],
  "publications": [
    {
      "title": "Design of a cluster randomized multi-level intervention to decrease barriers to minority cancer patient referral and enrollment to cancer clinical trials: The ACT WONDER2S study",
      "pubmed_id": "40992541",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Rollison DE, Garcia MA, Amorrortu RP, Zhao Y, Mittman B, Turner K, Kirtane K, Soliman H, Byrne MM, Meade C, Gwede CK, Eschrich S, Yin J, Stanley NB, Fuzzell L, Hernandez D, Tapia-Kwan E, Vadaparampil ST",
      "journal": "Contemp Clin Trials"
    },
    {
      "title": "Abemaciclib Persistence in Patients with HR+, HER2-, Node-Positive Early Breast Cancer: a Real-World Analysis",
      "pubmed_id": "41039165",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Hudson K, Gathirua-Mwangi W, Williams LA, Cui ZL, Richey M, Grimes B, Wang J, Liepa AM, Brechtelsbauer E, Volodarsky R, Moreira K, Soliman H",
      "journal": "Oncol Ther"
    },
    {
      "title": "Quantitative habitat concentration analysis of triple negative breast cancer on MRI correlates with pathologic response to combination neoadjuvant immuno/chemotherapy",
      "pubmed_id": "40945432",
      "year": "2025",
      "publication_date": "2025 Nov",
      "authors": "Weinfurtner RJ, Ataya D, Funaro K, Bhatt A, Abdalah M, Stringfield O, Raghunand N, Thompson Z, Lee MC, Czerniecki B, Muller AS, Soliman H, Han H",
      "journal": "Clin Imaging"
    },
    {
      "title": "A pilot study incorporating HER2-directed dendritic cells into neoadjuvant therapy of early stage HER2+ER- breast cancer",
      "pubmed_id": "40097486",
      "pmc_id": "PMC11914126",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Soliman H, Aldrich A, Abdo N, Han H, Soyano A, Costa R, Armaghani A, Kiluk J, Khakpour N, Lee MC, Hoover S, Laronga C, Niell B, Mooney B, Weinfurtner RJ, Rosa M, Czerniecki B",
      "journal": "NPJ Breast Cancer"
    },
    {
      "title": "Tucatinib and trastuzumab in HER2-mutated metastatic breast cancer: a phase 2 basket trial",
      "pubmed_id": "39825152",
      "pmc_id": "PMC11922774",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Okines AFC, Curigliano G, Mizuno N, Oh DY, Rorive A, Soliman H, Takahashi S, Bekaii-Saab T, Burkard ME, Chung KY, Debruyne PR, Fox JR, Gambardella V, Gil-Martin M, Hamilton EP, Monk BJ, Nakamura Y, Nguyen D, O'Malley DM, Olawaiye AB, Pothuri B, Reck M, Sudo K, Sunakawa Y, Van Marcke C, Yu EY, Ramos J, Tan S, Bieda M, Stinchcombe TE, Pohlmann PR",
      "journal": "Nat Med"
    },
    {
      "title": "Immune Subtyping Identifies Patients With Hormone Receptor-Positive Early-Stage Breast Cancer Who Respond to Neoadjuvant Immunotherapy (IO): Results From Five IO Arms of the I-SPY2 Trial",
      "pubmed_id": "40526879",
      "pmc_id": "PMC12184982",
      "year": "2025",
      "publication_date": "2025 Jun",
      "authors": "Wolf DM, Yau C, Campbell M, Glas A, Barcaru A, Mittempergher L, Kuilman M, Brown-Swigart L, Hirst G, Basu A, Magbanua M, Sayaman R, Huppert L, Delson A, Symmans WF, Borowsky A, Pohlmann P, Rugo H, Clark A, Yee D, DeMichele A, Perlmutter J, Petricoin EF, Chien J, Stringer-Reasor E, Shatsky R, Liu M, Han H, Soliman H, Isaacs C, Nanda R, Hylton N, Pusztai L, Esserman L, van 't Veer L",
      "journal": "JCO Precis Oncol"
    },
    {
      "title": "Phase II trial of brain MRI surveillance in stage IV breast cancer",
      "pubmed_id": "39851040",
      "pmc_id": "PMC12309701",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Ahmed KA, Kim Y, Armaghani AJ, Arrington JA, Costa RL, Czerniecki BJ, Diaz R, Dowell RA, Extermann M, Forsyth PA, Lee KT, Loftus L, Mills MN, Phuoc VH, Rosa M, Soliman HH, Sam CS, Washington IR, Soyano AE, Han HS",
      "journal": "Neurooncol"
    },
    {
      "title": "Clinical Outcomes and Prognostic Factors in Epithelial-Myoepithelial Carcinoma (EMC) of the Breast",
      "pubmed_id": "39934001",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Joshi U, Budhathoki P, Gaire S, Yadav SK, Niu C, Agrawal V, Low SK, Soliman HH",
      "journal": "Clin Breast Cancer"
    },
    {
      "title": "Regional lymph node changes on breast MRI in patients with early-stage breast cancer receiving neoadjuvant chemo-immunotherapy",
      "pubmed_id": "39305392",
      "pmc_id": "PMC11785630",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Jacob S, Christofferson A, Fisch S, Norwood P, Castillo P, Yu H, Hirst G, Soliman H, Nanda R, Mukhtar RA, Ewing C, Majure M, Melisko M, Rugo HS, Esserman L, Price E, Chien AJ",
      "journal": "Breast Cancer Res Treat"
    },
    {
      "title": "Alteration of the Tumor Microenvironment With Intratumoral Dendritic Cells Before Chemotherapy in ERBB2 Breast Cancer: A Nonrandomized Clinical Trial",
      "pubmed_id": "39636623",
      "pmc_id": "PMC11622104",
      "year": "2025",
      "publication_date": "2025 Feb",
      "authors": "Han HS, Aldrich AL, Garg SK, Weinfurtner RJ, Nguyen JV, Mo Q, Whiting J, Childress J, Soliman H, Costa R, Armaghani A, Soyano A, Kiluk J, Hoover S, Lee MC, Khakpour N, Shenoi N, Jameel Z, Koski GK, Czerniecki BJ",
      "journal": "JAMA Oncol"
    }
  ],
  "grants": [
    {
      "description": "Title: Preclinical Studies to Guide Development of Clinical Trials of MEM-288 Oncolytic Virus to Target Localized Bladder Cancer and TNBC  \nAward Number: 19VA063-S3  \nSponsor: MEMGEN, INC.  \nBeg, A. (PD/PI), Pilon-Thomas, S. (Co-PD/PI), Ruffell, B. (Co-PD/PI), Soliman, H. (Co-PD/PI)",
      "title": "Preclinical Studies to Guide Development of Clinical Trials of MEM-288 Oncolytic Virus to Target Localized Bladder Cancer and TNBC",
      "award_number": "19VA063-S3",
      "sponsor": "MEMGEN, INC.",
      "investigators": [
        {
          "name": "Beg, A.",
          "role": "PD/PI"
        },
        {
          "name": "Thomas, S.",
          "role": "Co-PD/PI"
        },
        {
          "name": "Ruffell, B.",
          "role": "Co-PD/PI"
        },
        {
          "name": "Soliman, H.",
          "role": "Co-PD/PI"
        }
      ]
    },
    {
      "description": "Title: A Mixed-Methods Study to Develop a Culturally-Tailored Multi-Level Intervention to Increase the Racial/Ethnic Diversity of Clinical Trial Participants  \nAward Number: DMG2022-022  \nSponsor: V FOUNDATION  \nSoliman, H. (PD/PI), Lee, K. (Co-PD/PI)",
      "title": "A Mixed-Methods Study to Develop a Culturally-Tailored Multi-Level Intervention to Increase the Racial/Ethnic Diversity of Clinical Trial Participants",
      "award_number": "DMG2022-022",
      "sponsor": "V FOUNDATION",
      "investigators": [
        {
          "name": "Soliman, H.",
          "role": "PD/PI"
        },
        {
          "name": "Lee, K.",
          "role": "Co-PD/PI"
        }
      ]
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/SolimanHatem_4606.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=4606"
  },
  "content_hash": "b15f0e6e1ff62de170083344f8cf01a03ccbd1c3a9c9971071cb980253872834",
  "researcher_name": "Hatem Soliman",
  "department": "Tumor Microenvironment and Metastasis"
}