{
  "profile_url": "https://www.moffitt.org/research-science/researchers/hsiao-lan-wang/",
  "last_updated": "2025-11-21T22:50:24.037617",
  "researcher_id": "10509",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "",
  "research_program": "health outcomes & behavior",
  "overview": "",
  "research_interests": [
    "I have two research focuses. One is to improve head and neck cancer survivorship through a multidisciplinary and transitional approach. My current study is to understand whether a 10-week physical activity program can improve multiple symptoms. This program uses the existing Wii Fit software with a tailored Wii Fit routine prescribed by a personal trainer. The advisory board members designing this program include senior nursing scientists, a head and neck nurse practitioner, exercise physiologist, occupation therapist, and physical therapist. We are still waiting for follow up data collection of symptoms and planning on moving this study to the Moffitt Cancer Center. The second research focus is to promote colon cancer screening adherence. I have participated in a study that uses computer-tailored intervention to improve colon cancer screening adherence. I have participated in a study that uses computer-tailored intervention to improve colon cancer screening participations among African Americans (R01; PI; Susan M. Rawl). Currently, I am developing a manuscript to describe predictors of colon cancer screening stage of adoption among non-adherent African Americans. Grant development focusing on this area with a different population (e.g. Hispanics) will be anticipated in the future.\n  *"
  ],
  "associations": [
    "Health Outcomes & Behavior Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "Indiana University, MSN"
    },
    {
      "type": "Graduate",
      "institution": "Indiana University, PhD"
    },
    {
      "type": "Fellowship",
      "institution": "Indiana University",
      "specialty": "Behavioral Nursing Research"
    }
  ],
  "publications": [
    {
      "title": "Fatigue-related symptom clusters and functional status of older adults in hospice",
      "pubmed_id": "35676795",
      "year": "2023",
      "publication_date": "2023 Feb",
      "authors": "Abduljawad SF, Beckstead JW, Dobbs D, Visovsky C, Rodriguez CS, McMillan SC, Wang HL",
      "journal": "Palliat Support Care"
    },
    {
      "title": "The pre-efficacy phase testing for PAfitME™-A behavioral physical activity intervention to manage moderate and severe symptoms among advanced stage cancer patients",
      "pubmed_id": "33373078",
      "year": "2021",
      "publication_date": "2021 Feb",
      "authors": "Wang HL, Donovan KA, Rajasekhara S, Padhya T, Buck HG, Szalacha L, Chang JM, Brown JD, Smith B",
      "journal": "Res Nurs Health"
    },
    {
      "title": "Examining the Relationship Between Patient Fatigue-Related Symptom Clusters and Carer Depressive Symptoms in Advanced Cancer Dyads: A Secondary Analysis of a Large Hospice Data Set",
      "pubmed_id": "31361674",
      "year": "2020",
      "publication_date": "2020 Nov",
      "authors": "Buck HG, Benitez B, Fradley MG, Donovan KA, McMillan SC, Reich RR, Wang HL",
      "journal": "Cancer Nurs"
    },
    {
      "title": "Promoting Spiritual Healing by Stress Reduction Through Meditation for Employees at a Veterans Hospital: A CDC Framework-Based Program Evaluation",
      "pubmed_id": "31540567",
      "year": "2020",
      "publication_date": "2020 Apr",
      "authors": "Freeman RC, Sukuan N, Tota NM, Bell SM, Harris AG, Wang HL",
      "journal": "Workplace Health Saf"
    },
    {
      "title": "Cancer Pain and Quality of Life",
      "pubmed_id": "30829932",
      "year": "2019",
      "publication_date": "2019 Apr",
      "authors": "Rodriguez C, Ji M, Wang HL, Padhya T, McMillan SC",
      "journal": "J Hosp Palliat Nurs"
    },
    {
      "title": "Understanding Cancer Worry Among Patients in a Community Clinic-Based Colorectal Cancer Screening Intervention Study",
      "pubmed_id": "29870517",
      "pmc_id": "PMC6023767",
      "year": "2018",
      "publication_date": "2018 Jul",
      "authors": "Christy SM, Schmidt A, Wang HL, Sutton SK, Davis SN, Chavarria E, Abdulla R, Quinn GP, Vadaparampil ST, Schultz I, Roetzheim R, Shibata D, Meade CD, Gwede CK",
      "journal": "Nurs Res"
    },
    {
      "title": "Feasibility of the mobile mindfulness-based stress reduction for breast cancer (mMBSR(BC)) program for symptom improvement among breast cancer survivors",
      "pubmed_id": "28665541",
      "pmc_id": "PMC7771353",
      "year": "2018",
      "publication_date": "2018 Feb",
      "authors": "Lengacher CA, Reich RR, Ramesar S, Alinat CB, Moscoso M, Cousin L, Marino VR, Elias MN, Paterson CL, Rodriguez CS, Wang HL, Kip KE, Meng H, Park JY",
      "journal": "Psychooncology"
    },
    {
      "title": "Exergame Grading Scheme: Concept Development and Preliminary Psychometric Evaluations in Cancer Survivors",
      "pubmed_id": "29098087",
      "pmc_id": "PMC5643152",
      "year": "2017",
      "publication_date": "2017 Nov",
      "authors": "Wang HL, Liu CJ, Kilpatrick M, Jim H, McMillan S, Vijayakumar N, McDonald S, Padhya T, Russell J, Vondruska K, Visovsky C",
      "journal": "Rehabil Res Pract"
    },
    {
      "title": "Shoulder pain, functional status, and health-related quality of life after head and neck cancer surgery",
      "pubmed_id": "24455274",
      "pmc_id": "PMC3886217",
      "year": "2014",
      "publication_date": "2014 Jan",
      "authors": "Wang HL, Keck JF, Weaver MT, Mikesky A, Bunnell K, Buelow JM, Rawl SM",
      "journal": "Rehabil Res Pract"
    },
    {
      "title": "Wang HL, Christy SM, Skinner CS, Champion VL, Springston JK, Perkins SM, Tong Y, Krier C, Gebregziabher N, Rawl SM. Predictors of stage of adoption for colorectal cancer screening among African American primary care patients. Cancer Nurs. 2014.37(4):241-251. Pubmedid: [24145250](https://www.ncbi.nlm.nih.gov/pubmed/24145250). Pmcid: PMC3991768.",
      "pubmed_id": "24145250",
      "pmc_id": "PMC3991768",
      "year": "2014",
      "authors": ""
    }
  ],
  "grants": [],
  "participating_trials": [],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=10509"
  },
  "content_hash": "19a2bced0a0197e6523929f1986319a5142ec4c4267e8b0ad26ef6a9529118cc",
  "researcher_name": "hsiao lan wang",
  "department": ""
}