{
  "profile_url": "https://www.moffitt.org/research-science/researchers/issam-el-naqa",
  "last_updated": "2025-10-21T16:34:11.280114",
  "researcher_id": "27669",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "Machine Learning",
  "research_program": "Cancer Biology & Evolution Program",
  "overview": "Senior Member Imaging analytics, bioinformatics, and outcoming modelings. Dr. El Naqa is the founding chair of the department of Machine Learning at Moffitt Cancer Center, Tampa, Fl. He is an internationally recognized authority in the fields of machine learning, data analytics, and oncology outcomes modeling and has published extensively in these areas with more than 220+ peer-reviewed journal publications and 4 edited textbooks. He has been a member and fellow of several academic and professional societies including AAPM and IEEE. His research has been funded by several federal and private grants in Canada and the USA and served on national and international study sections. He acts as a peer-reviewer and editorial board member for several leading international journals in his areas of expertise.",
  "research_interests": [
    "Bioinformatics and outcome modeling: design and develop large-scale datamining machine/deep learning methods and software tools to identify robust biomarkers of radiotherapy treatment outcomes from clinical and preclinical data using complex systems analysis and machine learning approaches (radiogenomics). Multimodality image-guided targeting and adaptive radiotherapy: design and develop hardware tools and software algorithms for multimodality image analysis and understanding, feature extraction for outcome prediction (radiomics), real-time treatment optimization and targeting. Clinical decision support: develop and design methods and tools for reinforcement machine learning and optimization of decision making for radiotherapy. Medical physics radiation measurement: design and develop new technologies for radiation using optical and acoustics techniques to interrogate radiation response in real time for online targeting and adaptation. Radiobiology: design and develop predictive models of tumor and normal tissue response to radiotherapy (radiogenomics). Investigate the application of these methods to develop therapeutic interventions for protection of normal tissue toxicities. \n  *"
  ],
  "associations": [
    "Gastrointestinal Oncology",
    "Machine Learning",
    "Radiation Oncology",
    "Diagnostic Imaging and Interventional Radiology",
    "Cancer Biology & Evolution Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "Illinois Institute of Technology, PhD"
    },
    {
      "type": "Graduate",
      "institution": "University of Jordan, Amman, Jordan, MS"
    },
    {
      "type": "Graduate",
      "institution": "Washington University in St. Louis, MA"
    }
  ],
  "publications": [
    {
      "title": "Towards quantitative ionizing radiation acoustic imaging (iRAI) for radiation dose measurement: Validation from simulations to experiments",
      "pubmed_id": "40891090",
      "pmc_id": "PMC12402745",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Huang Y, Wei L, Litzenberg D, Li B, Ma C, Kim H, Liu Y, Zhang C, Carson PL, Naqa IE, Zhang W, Wang X",
      "journal": "Med Phys"
    },
    {
      "title": "General artificial intelligence for the diagnosis and treatment of cancer: the rise of foundation models",
      "pubmed_id": "41030612",
      "pmc_id": "PMC12478997",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Tarhini AA, Dave P, El Naqa I",
      "journal": "BJR Artif Intell"
    },
    {
      "title": "Using Bayesian Networks to Predict Urgent Care Visits in Patients Receiving Systemic Therapy for Non-Small Cell Lung Cancer",
      "pubmed_id": "40939115",
      "pmc_id": "PMC12483286",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Gonzalez BD, Li X, Gudenkauf LM, Pullukkara JJ, Oswald LB, Hoogland AI, Le T, El Naqa I, Saltos AN, Haura EB, Luo Y",
      "journal": "JCO Clin Cancer Inform"
    },
    {
      "title": "The Role of PET Image Quantification in Modern Radiation Therapy",
      "pubmed_id": "40816963",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Abdelrahman A, El Naqa I",
      "journal": "PET Clin"
    },
    {
      "title": "Software Support Tools for Reirradiation: A Report From Reirradiation Collaborative Group (ReCOG) 2024",
      "pubmed_id": "40240108",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Matrosic CK, Andrzejewski P, Bergman A, Chng N, Naqa IE, Freislederer P, Hoffmann L, Hope A, Jacqmin D, Kelly C, Kuo L, Lin H, Mayo C, Murrell DH, Ödén J, Svensson S, Thompson S, Osorio EV, West N, Wicha R, Yorke E, Appelt AL, Paradis KC",
      "journal": "Int J Radiat Oncol Biol Phys"
    },
    {
      "title": "Easy ensemble classifier-group and intersectional fairness and threshold (EEC-GIFT): a fairness-aware machine learning framework for lung cancer screening eligibility using real-world data",
      "pubmed_id": "40111867",
      "pmc_id": "PMC11986816",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Conahan P, Robinson LA, Le T, Valdes G, Schabath MB, Byrne MM, Green L, El Naqa I, Luo Y",
      "journal": "JNCI Cancer Spectr"
    },
    {
      "title": "Editorial: Artificial intelligence for cancer immunotherapy",
      "pubmed_id": "40568575",
      "pmc_id": "PMC12187814",
      "year": "2025",
      "publication_date": "2025 Jun",
      "authors": "El Naqa I, Pilon-Thomas S, Deutsch E",
      "journal": "Front Immunol"
    },
    {
      "title": "Does Time to Retreatment Matter? A Normal Tissue Complication Probability Model to Predict Radionecrosis After Repeat Stereotactic Radiosurgery for Recurrent Brain Metastases Incorporating Time-dependent Discounted Dose",
      "pubmed_id": "39900228",
      "year": "2025",
      "publication_date": "2025 Jun",
      "authors": "Sharma M, Naqa IE, Sneed PK",
      "journal": "Int J Radiat Oncol Biol Phys"
    },
    {
      "title": "CLONEID: A Framework for Longitudinal Integration of Phenotypic and Genotypic Data to Monitor and Steer Subclonal Dynamics",
      "pubmed_id": "40631300",
      "pmc_id": "PMC12236826",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Veith T, Beck R, Tagal V, Li T, Alahmari S, Cole J, Hannaby D, Kyei J, Yu X, Maksin K, Schultz A, Lee H, El Naqa I, Eschrich S, Ji HP, Diaz A, Andor N",
      "journal": "bioRxiv"
    },
    {
      "title": "The Biophysics of Flash Radiotherapy: Tools for Measuring Tumor and Normal Tissues Microenvironment",
      "pubmed_id": "40867798",
      "pmc_id": "PMC12383113",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "El Naqa I",
      "journal": "Antioxidants (Basel)"
    }
  ],
  "grants": [
    {
      "description": "Title: Use Machine Learning to Identify Novel Image-Based Markers That Can Distinguish Between ICUS, CCUS, and MDS and Aid in the Prediction of Disease Evolution, Survival, and Genetic Evolution in Patients with Pre-MDS Condition and MDS  \nAward Number:   \nSponsor: THE EDWARD P. EVANS FOUNDATION  \nEl N. (PD/PI), Komrokji, R. (Co-PD/PI)",
      "title": "Use Machine Learning to Identify Novel Image-Based Markers That Can Distinguish Between ICUS, CCUS, and MDS and Aid in the Prediction of Disease Evolution, Survival, and Genetic Evolution in Patients with Pre-MDS Condition and MDS",
      "award_number": "",
      "sponsor": "THE EDWARD P. EVANS FOUNDATION  \nEl N. (PD/PI),",
      "investigators": [
        {
          "name": "Komrokji, R.",
          "role": "Co-PD/PI"
        }
      ]
    },
    {
      "description": "Title: Optimal Decision Making in Radiotherapy Using Panomics Analytics  \nAward Number: 5R01CA233487-06  \nSponsor: National Cancer Institute (NCI)  \nEl N. (PD/PI)",
      "title": "Optimal Decision Making in Radiotherapy Using Panomics Analytics",
      "award_number": "5R01CA233487-06",
      "sponsor": "National Cancer Institute (NCI)  \nEl N. (PD/PI)",
      "source": "NCI"
    },
    {
      "description": "Title: Federated Learning for Optimal Decision Making in Radiotherapy Using Panomics Analytics  \nAward Number: 3R01CA233487-05S1  \nSponsor: National Cancer Institute (NCI)  \nEl N. (PD/PI)",
      "title": "Federated Learning for Optimal Decision Making in Radiotherapy Using Panomics Analytics",
      "award_number": "3R01CA233487-05S1",
      "sponsor": "National Cancer Institute (NCI)  \nEl N. (PD/PI)",
      "source": "NCI"
    },
    {
      "description": "Title: An Ionizing Radiation Acoustics Imaging (iRAI) Approach for Guided Flash Radiotherapy  \nAward Number: 5R01CA266803  \nSponsor: National Cancer Institute (NCI)  \nEl N. (PD/PI)",
      "title": "An Ionizing Radiation Acoustics Imaging (iRAI) Approach for Guided Flash Radiotherapy",
      "award_number": "5R01CA266803",
      "sponsor": "National Cancer Institute (NCI)  \nEl N. (PD/PI)",
      "source": "NCI"
    },
    {
      "description": "Title: Combined Radiation Acoustics and Ultrasound Imaging for Real-Time Guidance in Radiotherapy  \nAward Number: 5R37CA222215-07  \nSponsor: National Cancer Institute (NCI)  \nEl N. (PD/PI)",
      "title": "Combined Radiation Acoustics and Ultrasound Imaging for Real-Time Guidance in Radiotherapy",
      "award_number": "5R37CA222215-07",
      "sponsor": "National Cancer Institute (NCI)  \nEl N. (PD/PI)",
      "source": "NCI"
    },
    {
      "description": "Title: Data Science to Improve Treatment Planning for Advanced Prostate Cancer Patients Treated with Radiotherapy  \nAward Number: W81XWH-22-1-0277  \nSponsor: Department of Defense (DOD)  \nEl N. (PD/PI)",
      "title": "Data Science to Improve Treatment Planning for Advanced Prostate Cancer Patients Treated with Radiotherapy",
      "award_number": "W81XWH-22-1-0277",
      "sponsor": "Department of Defense (DOD)  \nEl N. (PD/PI)",
      "source": "DOD"
    },
    {
      "description": "Title: Medical Imaging and Data Resource Center (MIDRC) for Rapid Response to COVID-19 Pandemic  \nAward Number: Federal Contract75N92020D00021/75N92023F00001  \nSponsor: National Cancer Institute (NCI)  \nEl N. (PD/PI)",
      "title": "Medical Imaging and Data Resource Center (MIDRC) for Rapid Response to COVID-19 Pandemic",
      "award_number": "Federal Contract75N92020D00021/75N92023F00001",
      "sponsor": "National Cancer Institute (NCI)  \nEl N. (PD/PI)",
      "source": "NCI"
    },
    {
      "description": "Title: Data Science to Improve Treatment Planning for Bladder Cancer Patients Treated with Radiotherapy  \nAward Number: MOABA Grant Amendment 1  \nSponsor: Florida Department of Health  \nJim, H. (PD/PI), El N. (Co-PD/PI)",
      "title": "Data Science to Improve Treatment Planning for Bladder Cancer Patients Treated with Radiotherapy",
      "award_number": "MOABA Grant Amendment 1",
      "sponsor": "Florida Department of Health",
      "investigators": [
        {
          "name": "Jim, H.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Development of a FLASH Dosimetry System Based on Ionizing Radiation Acoustic Imaging  \nAward Number: 75N91024C00095  \nSponsor: National Institutes of Health (NIH)  \nOraiqat, I. (PD/PI), El N. (Co-PD/PI)",
      "title": "Development of a FLASH Dosimetry System Based on Ionizing Radiation Acoustic Imaging",
      "award_number": "75N91024C00095",
      "sponsor": "National Institutes of Health (NIH)",
      "source": "NIH",
      "investigators": [
        {
          "name": "Oraiqat, I.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/ElNaqaIssam_27669.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=27669"
  },
  "content_hash": "1f405bf82d645cd7f2cbf4ec60d99da73ae20f40227e0b7f5cefaf3b51b4efc7",
  "researcher_name": "Issam El Naqa",
  "department": "Machine Learning"
}