{
  "profile_url": "https://www.moffitt.org/research-science/researchers/jacob-kresovich",
  "last_updated": "2025-10-21T16:36:07.511633",
  "researcher_id": "32219",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "Cancer Epidemiology",
  "research_program": "Cancer Epidemiology Program",
  "overview": "Jacob K. Kresovich, PhD, MPH is a molecular cancer epidemiologist focused on identifying the biological processes that link aging and immune function to breast cancer development and survival.",
  "research_interests": [
    "Dr. Kresovich’s research is focused on characterizing molecular and immunological changes that occur before, during and after cancer development and treatment. Dr. Kresovich earned a PhD in Epidemiology from the University of Illinois at Chicago School of Public Health and an MPH in Epidemiology from Columbia University Mailman School of Public Health. He completed a Postdoctoral Fellowship at the Epidemiology Branch of the National Institute of Environmental Health Sciences, where his work focused on investigating the relationship between blood DNA methylation profiles and aging, environmental exposures, lifestyles, behaviors, and breast cancer risk. Since joining Moffitt, Dr. Kresovich has extended his research to include studies of how breast cancer treatments affects aging rates and cardiovascular disease risk. \n  *"
  ],
  "associations": [
    "Cancer Epidemiology",
    "Breast Oncology",
    "Cancer Epidemiology Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "Columbia University, MPH"
    },
    {
      "type": "Graduate",
      "institution": "University of Illinois at Chicago, PhD"
    }
  ],
  "publications": [
    {
      "title": "Comparison of volumetric and single-slice computed tomography body composition metrics for colorectal cancer survival",
      "pubmed_id": "40532592",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Jeong D, Richards AR, Jean-Baptiste E, Gomez MF, Thomas KL, Mo Q, Gigic B, Figueiredo JC, Li CI, Shibata D, Toriola AT, Byrd DA, Ulrich CM, Stewart PA, Siegel EM, Kresovich JK",
      "journal": "Eur J Radiol"
    },
    {
      "title": "Methylation-based biological age and cardiotoxicity risk in breast cancer patients treated with trastuzumab",
      "pubmed_id": "40349094",
      "pmc_id": "PMC12065287",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Mammadova J, Richards A, Gonzalez-Torriente A, Adler ER, Cruz RJ, Palfi S, Lee DH, Sam C, Al-Jumayli M, Berglund A, Park JY, Alomar M, Kresovich JK",
      "journal": "Cardiooncology"
    },
    {
      "title": "Diet quality and cardiometabolic health in breast cancer survivors: the Pathways Study",
      "pubmed_id": "39890673",
      "pmc_id": "PMC11952977",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Ergas IJ, Cheng RK, Roh JM, Kresovich JK, Iribarren C, Nguyen-Huynh M, Rana JS, Rillamas-Sun E, Laurent CA, Lee VS, Quesenberry CP, Bhatt A, Yao S, Kushi LH, Greenlee H, Kwan ML",
      "journal": "Breast Cancer Res Treat"
    },
    {
      "title": "DNA methylation-predicted plasma protein levels and breast cancer risk",
      "pubmed_id": "40140843",
      "pmc_id": "PMC11948855",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Kresovich JK, Reid BM, O'Brien KM, Xu Z, Byrd DA, Weinberg CR, Sandler DP, Taylor JA",
      "journal": "Breast Cancer Res"
    },
    {
      "title": "Blood-based epigenome-wide association study and prediction of alcohol consumption",
      "pubmed_id": "39863868",
      "pmc_id": "PMC11762500",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Bernabeu E, Chybowska AD, Kresovich JK, Suderman M, McCartney DL, Hillary RF, Corley J, Valdés-Hernández MDC, Maniega SM, Bastin ME, Wardlaw JM, Xu Z, Sandler DP, Campbell A, Harris SE, McIntosh AM, Taylor JA, Yousefi P, Cox SR, Evans KL, Robinson MR, Vallejos CA, Marioni RE",
      "journal": "Clin Epigenetics"
    },
    {
      "title": "Physical activity and incident cardiovascular disease in breast cancer survivors: the Pathways Study",
      "pubmed_id": "39693117",
      "pmc_id": "PMC11737308",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Kresovich JK, Richards AR, Ergas IJ, Cannioto R, Thomsen C, Laurent CA, Shariff-Marco S, Rillamas-Sun E, Kolevska T, Yao S, Ambrosone C, Kushi L, Greenlee H, Kwan ML",
      "journal": "JNCI Cancer Spectr"
    },
    {
      "title": "Association Between Body Iron Status and Biological Aging",
      "pubmed_id": "40362718",
      "pmc_id": "PMC12073140",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Von Holle A, Ramamurthy S, Díaz Santana MV, Kresovich JK, Taylor JA, Xu Z, O'Brien KM, Sandler DP, Weinberg CR",
      "journal": "Nutrients"
    },
    {
      "title": "Clonal Hematopoiesis in Patients With Human Immunodeficiency Virus and Cancer",
      "pubmed_id": "38657098",
      "year": "2024",
      "publication_date": "2024 Sep",
      "authors": "Gillis N, Dickey BL, Colin-Leitzinger C, Tang YH, Putney RM, Mesa TE, Yoder SJ, Suneja G, Spivak AM, Patel AB, Extermann M, Giuliano AR, Teng M, Kresovich J, Berglund A, Coghill AE",
      "journal": "J Infect Dis"
    },
    {
      "title": "Plasma prolactin and postmenopausal breast cancer risk: a pooled analysis of four prospective cohort studies",
      "pubmed_id": "39593118",
      "pmc_id": "PMC11590566",
      "year": "2024",
      "publication_date": "2024 Nov",
      "authors": "Kresovich JK, Guranich C, Houghton S, Qian J, Jones ME, Boutot ME, Dowsett M, Eliassen AH, Garcia-Closas M, Kraft P, Norman A, Pollak M, Rinaldi S, Rosner B, Schoemaker MJ, Scott C, Swerdlow AJ, Milne RL, Tworoger SS, Vachon CM, Hankinson SE",
      "journal": "Breast Cancer Res"
    },
    {
      "title": "methscore: a comprehensive R function for DNA methylation-based health predictors",
      "pubmed_id": "38702768",
      "pmc_id": "PMC11105949",
      "year": "2024",
      "publication_date": "2024 May",
      "authors": "Xu Z, Niu L, Kresovich JK, Taylor JA",
      "journal": "Bioinformatics"
    }
  ],
  "grants": [
    {
      "description": "Title: Deep Phenotypic Characterization of Colorectal Cancer Patients to Identify Novel Predictors of Disease Recurrence  \nAward Number: 5P30CA076292-25  \nSponsor: National Cancer Institute (NCI)  \nCleveland, J. (PD/PI), Siegel, E. (PD/PI), Kresovich, J. (Co-PD/PI), Stewart, P. (Co-PD/PI)",
      "title": "Deep Phenotypic Characterization of Colorectal Cancer Patients to Identify Novel Predictors of Disease Recurrence",
      "award_number": "5P30CA076292-25",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Cleveland, J.",
          "role": "PD/PI"
        },
        {
          "name": "Siegel, E.",
          "role": "PD/PI"
        },
        {
          "name": "Kresovich, J.",
          "role": "Co-PD/PI"
        },
        {
          "name": "Stewart, P.",
          "role": "Co-PD/PI"
        }
      ]
    },
    {
      "description": "Title: The Influence of Extreme Weather Events on Emergency Department Utilization Among Cancer Patients in Florida  \nAward Number: 1R21CA304866-01  \nSponsor: National Cancer Institute (NCI)  \nKresovich, J. (PD/PI)",
      "title": "The Influence of Extreme Weather Events on Emergency Department Utilization Among Cancer Patients in Florida",
      "award_number": "1R21CA304866-01",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Kresovich, J.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Aging, DNA Methylation, and Incident Cardiovascular Disease in Breast Cancer Survivors  \nAward Number: 1R37CA299472-01  \nSponsor: National Cancer Institute (NCI)  \nKresovich, J. (PD/PI)",
      "title": "Aging, DNA Methylation, and Incident Cardiovascular Disease in Breast Cancer Survivors",
      "award_number": "1R37CA299472-01",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Kresovich, J.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/KresovichJacob_32219.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=32219"
  },
  "content_hash": "63c68670566c45f21ae9d9aa937a2d4054ccede7957fc1021a4aa39fb3614758",
  "researcher_name": "Jacob Kresovich",
  "department": "Cancer Epidemiology"
}