{
  "profile_url": "https://www.moffitt.org/research-science/researchers/jad-chahoud/",
  "last_updated": "2025-11-21T22:50:24.170244",
  "researcher_id": "24125",
  "degrees": [
    "MD"
  ],
  "title": "",
  "primary_program": "genitourinary oncology",
  "research_program": "immuno-oncology",
  "overview": "RCC Rare cancers Immune and cellular based therapies",
  "research_interests": [
    "Dr. Jad Chahoud’s research is centered on advancing the treatment of renal cell carcinoma (RCC), rare genitourinary (GU) cancers, and developing cutting-edge immune and cellular therapies. With over 30 years of expertise in RCC and extensive work on rare GU malignancies, Dr. Chahoud is dedicated to addressing unmet clinical needs through innovative therapeutic approaches and clinical trial design. In RCC, Dr. Chahoud focuses on optimizing personalized treatments through biomarker-driven strategies, aiming to improve outcomes for patients by integrating insights from tumor biology and translational research. His work on rare GU cancers emphasizes increasing treatment options and developing tailored therapeutic protocols for understudied malignancies, leveraging targeted and immunotherapeutic strategies. Dr. Chahoud is also actively involved in immune and cellular therapies, including checkpoint inhibitors, tumor-infiltrating lymphocyte (TIL) therapies, and CAR-T cellular therapies. His research aims to unravel mechanisms of immune escape and enhance the efficacy of immune-based treatments by bridging basic science and clinical research. He emphasizes the importance of novel clinical trial designs to facilitate the translation of scientific discoveries into impactful therapies.\n  *"
  ],
  "associations": [
    "Genitourinary Oncology",
    "Immuno-Oncology Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of Texas Health Sciences Center, MPH"
    },
    {
      "type": "Medical School",
      "institution": "Lebanese University Faculty of Medical Sciences",
      "degree": "MD"
    },
    {
      "type": "Internship",
      "institution": "Staten Island University Hospital"
    },
    {
      "type": "Residency",
      "institution": "University of Texas Health Science Center",
      "specialty": ""
    },
    {
      "type": "Fellowship",
      "institution": "University of Texas MD Anderson Cancer Center",
      "specialty": ""
    }
  ],
  "publications": [
    {
      "title": "Evaluating the Evolving Treatment Landscape of Systemic Therapies in Penile Cancer",
      "pubmed_id": "41008800",
      "pmc_id": "PMC12468617",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Jaime-Casas S, Barragan-Carrillo R, Eskenazi F, Dugarte JP, Chahoud J, Spiess PE, Medina LG",
      "journal": "Cancers (Basel)"
    },
    {
      "title": "The opportunities and barriers for developing tumour-infiltrating lymphocyte therapy for patients with advanced genitourinary cancers",
      "pubmed_id": "41006825",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Potez M, Roman Souza G, Spiess PE, Pilon-Thomas S, Chahoud J",
      "journal": "Nat Rev Urol"
    },
    {
      "title": "Feasibility and Functional Reactivity of Expanded Tumor-infiltrating Lymphocytes from Non-clear-cell Renal Cell Carcinoma",
      "pubmed_id": "40962596",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Potez M, Jazayeri SB, Guske C, Miller J, Ali J, Carter M, Khambati F, Dhillon J, Sexton W, Zemp L, Manley B, Souza GR, Spiess PE, Beatty M, Pilon-Thomas S, Chahoud J",
      "journal": "Eur Urol"
    },
    {
      "title": "Management and optimization of chronic renal insufficiency in the setting of kidney cancer A Systematic Review",
      "pubmed_id": "40658472",
      "pmc_id": "PMC12539876",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Cobb JK, Miyagi H, Chahoud J, Bassil C, Spiess PE",
      "journal": "Int Braz J Urol"
    },
    {
      "title": "Germline whole-exome sequencing reveals FOXP3-related gene variants conferring urinary cancer susceptibility and associated with immune escape",
      "pubmed_id": "40962358",
      "pmc_id": "PMC12443205",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Feng BJ, Kohlmann W, Nix DA, Atkinson A, Boucher KM, Carroll C, Stubben CJ, Kolesar J, Singer EA, Riedlinger G, Edge S, Sahu KK, Churchman M, Graham L, Salhia B, Sanchez A, Zakharia Y, Schneider BP, Jain R, Byrne L, Moskaluk CA, Nepple K, Shabsigh A, Chahoud J, Cairns BR, Gupta S",
      "journal": "J Immunother Cancer"
    },
    {
      "title": "Phase 2 study of dostarlimab plus niraparib in stage III-IV recurrent or refractory Penile squamous cell carcinoma",
      "pubmed_id": "41163621",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Hatoum F, Souza GR, Johnson J, Miller J, Fazili A, Pettaway CA, Campbell MT, Neubauer R, Johns A, Mizelle SR, Kim Y, Chadha J, Zhang J, Jameel G, Oschmann E, Dhillon J, Moscu A, Janeway R, Harris W, Lu X, Spiess PE, Chahoud J",
      "journal": "Future Oncol"
    },
    {
      "title": "PV-10 Triggers Immunogenic Cell Death in Head and Neck Squamous Cell Carcinoma via Endoplasmic Reticulum Stress and Apoptosis",
      "pubmed_id": "40552938",
      "pmc_id": "PMC12327362",
      "year": "2025",
      "publication_date": "2025 Nov",
      "authors": "Thatikonda S, Chaudhary R, Meshkovska Y, Biernacki M, Slebos RJC, Song X, Hall MS, Lilley K, Pilon-Thomas S, Guevara-Patino JA, Spiess PE, Chahoud J, Amelio AL, Wachter EA, Rodrigues D, Chung CH",
      "journal": "Mol Cancer Ther"
    },
    {
      "title": "Authors' Reply to the Letter to the Editor by May et al: Optimized Prognostic Stratification in PSCC",
      "pubmed_id": "40340844",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Chahoud J, Spiess PE",
      "journal": "J Natl Compr Canc Ne"
    },
    {
      "title": "Progressive T cell exhaustion and predominance of aging tissue associated macrophages with advancing disease stage in penile squamous cell carcinoma",
      "pubmed_id": "40044748",
      "pmc_id": "PMC11882776",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Miyagi H, Yu X, Peak T, Dhillon J, Le C, Wang X, Yoder S, Marchion D, Lu X, Pettaway C, Moran Segura C, Zhang C, Roman Souza G, Yu A, Zemp L, Spiess P, Chahoud J",
      "journal": "Sci Rep"
    },
    {
      "title": "Outcomes of PeIN at the surgical margin: insights from an organ-sparing penile cancer database",
      "pubmed_id": "40478443",
      "year": "2025",
      "publication_date": "2025 Jun",
      "authors": "Jazayeri SB, Fazili A, Sirard RB, Zemp L, Johnstone PAS, Chahoud J, Spiess PE",
      "journal": "World J Urol"
    }
  ],
  "grants": [
    {
      "description": "Title: Phase II study Assessing the Feasibility and Clinical efficacy of adaptive immunotherapy combination with VEGFR-TKI in patients with advanced renal cell carcinoma   \nAward Number: NA  \nSponsor: Moffitt Cancer Center  \nChahoud, J. (PD/PI)",
      "title": "Phase II study Assessing the Feasibility and Clinical efficacy of adaptive immunotherapy combination with VEGFR-TKI in patients with advanced renal cell carcinoma",
      "award_number": "NA",
      "sponsor": "Moffitt Cancer Center",
      "investigators": [
        {
          "name": "Chahoud, J.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Developing isoform-selective Hsp90 inhibitors for monotherapy and enhanced immunotherapy against lethal prostate cancer  \nAward Number: 1R01CA297220-01A1  \nSponsor: National Institutes of Health (NIH)  \nChahoud, J. (PD/PI)",
      "title": "Developing isoform-selective Hsp90 inhibitors for monotherapy and enhanced immunotherapy against lethal prostate cancer",
      "award_number": "1R01CA297220-01A1",
      "sponsor": "National Institutes of Health (NIH)",
      "source": "NIH",
      "investigators": [
        {
          "name": "Chahoud, J.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Bench-bedside-bidirectional investigation of a new combinatorial immunotherapy strategy to treat platinum-resistant penile cancer  \nAward Number: HT94252310613  \nSponsor: Department of Defense (DOD)  \nChahoud, J. (PD/PI)",
      "title": "Bench-bedside-bidirectional investigation of a new combinatorial immunotherapy strategy to treat platinum-resistant penile cancer",
      "award_number": "HT94252310613",
      "sponsor": "Department of Defense (DOD)",
      "source": "DOD",
      "investigators": [
        {
          "name": "Chahoud, J.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Progressive immune dysfunction with advancing disease stage and immune changes post therapy in penile carcinoma  \nAward Number: 24K04  \nSponsor: Florida Department of Health  \nChahoud, J. (PD/PI)",
      "title": "Progressive immune dysfunction with advancing disease stage and immune changes post therapy in penile carcinoma",
      "award_number": "24K04",
      "sponsor": "Florida Department of Health",
      "investigators": [
        {
          "name": "Chahoud, J.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "participating_trials": [
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-21192/",
      "trial_id": "21192",
      "title": "A Phase 2 Study of the Combination Dostarlimab with Niraparib In Patients with Penile Carcinoma Who Have Progressed Following Chemotherapy",
      "condition": "Genitourinary",
      "intervention": "Dostarlimab (); Niraparib (); TSR-042 (Dostarlimab)",
      "status": "Open"
    }
  ],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/ChahoudJad_24125.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=24125"
  },
  "content_hash": "7d52ddf348619d37269c1f0f3320813c2a95bb97ea373d8385cd323d2d8048b3",
  "researcher_name": "jad chahoud",
  "department": ""
}