{
  "profile_url": "https://www.moffitt.org/research-science/researchers/jamie-teer",
  "last_updated": "2025-10-19T00:24:05.274941",
  "researcher_id": "10966",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "Biostatistics and Bioinformatics",
  "research_program": "Cancer Biology & Evolution Program",
  "overview": "Dr. Teer's research interests are focused on developing methods to analyze, interpret and visualize massively-parallel sequencing information in cancer genetics. This includes developing and applying computational methods and graphical tools to better detect genetic variations from sequencing data, understand the functional context of sequence changes, and visualize the results of large-scale genomics studies.",
  "research_interests": [
    "Dr. Teer's research interests are focused on developing methods to analyze, interpret and visualize massively-parallel sequencing information in cancer genetics. This includes developing and applying computational methods and graphical tools to better detect genetic variations from sequencing data, understand the functional context of sequence changes, and visualize the results of large-scale genomics studies.\n  *"
  ],
  "associations": [
    "Biostatistics and Bioinformatics",
    "Pathology",
    "Gastrointestinal Oncology",
    "Cancer Biology & Evolution Program",
    "Melanoma & Skin Cancer Center of Excellence",
    "Molecular Oncology & Drug Discovery Program",
    "Lung Cancer Center of Excellence"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "Harvard University, PhD"
    },
    {
      "type": "Fellowship",
      "institution": "National Human Genome Research Institute, NIH",
      "specialty": ""
    }
  ],
  "publications": [
    {
      "title": "Davis EW, Park MA, Basinski TL, Arnoletti JP, Bloomston M, Carson TL, Biachi De Castria T, Chen DT, Cortizas EM, Crowder SL, Genilo-Delgado M, Douglas WG, Huguet KL, Jiang K, Hodul PJ, Karolak A, Kim DW, Koomen JM, Menon AA, Mo Q, Mok SR, Molina-Vega MA, Moreno-Urazan L, Ahmed S, Parker NH, Pimiento JM, Rasool G, Sparks LM, Stewart PA, Tassielli AF, Teer JK, Trevino JG, Velanovich V, Wang X, Whelan CJ, Judge SM, Judge AR, Fleming JB, Malafa MP, Jeong D, Permuth JB. The Impact of Edema on Skeletal Muscle Changes among Patients with Pancreatic Ductal Adenocarcinoma. Cancer Epidemiol Biomarkers Prev",
      "pubmed_id": "40553455",
      "year": "2025",
      "journal": "34(9):1609-1617",
      "authors": ""
    },
    {
      "title": "Maura F, Bergsagel PL, Ziccheddu B, Kumar S, Maclachlan K, Derkach A, Garces JJ, Firestone R, Braggio E, Asmann Y, Durante M, Diamond BT, Papadimitriou M, Hultcrantz M, Marella A, Castellano G, Maeda A, Lionetti M, Matera A, Pioggia S, Da Vià MC, de Magistris C, Leongamornlert D, DeAvila D, Sudalagunta PR, Canevarolo RR, Siegel EM, Agius P, Teer J, McPherson A, Yamashita Y, Silva AS, Blaney P, Baz R, Patel KK, Campbell P, Morgan G, Fonseca R, Landgren O, Orlowski RZ, Shain KH, Bolli N, Usmani S, Rajkumar SV. Genomics Define Malignant Transformation in Myeloma Precursor Conditions. J Clin Oncol",
      "pubmed_id": "41061199",
      "year": "2025",
      "journal": "JCO2501733",
      "authors": ""
    },
    {
      "title": "Gatenby RA, Teer JK, Tsai KY, Brown JS. Parallel and convergent dynamics in the evolution of primary breast and lung adenocarcinomas. Commun Biol",
      "pubmed_id": "40399443",
      "pmc_id": "PMC12095661",
      "year": "2025",
      "journal": "8(1):775",
      "authors": ""
    },
    {
      "title": "Soupir A, Ospina OE, Hampton O, Churchman M, Radmacher M, Hedges D, McKean D, Agius P, Zeeshan S, Seligson ND, Pollock R, Liebner D, Chen JL, Tinoco G, Salhia B, McCarter M, Wilky BA, Miller BJ, Cavnar MJ, Groundland JS, Schneider BP, Riedlinger G, Edge SB, Moskaluk CA, Cardona K, Naqash AR, Gonzalez RJ, Mullinax JE, Joyce DM, Binitie O, Douglas Letson G, Naghavi AO, Druta M, Reed DR, Siegel EM, Teer JK, Fridley BL, Brohl AS. Genomic, transcriptomic, and immunogenomic landscape of over 1300 sarcomas of diverse histology subtypes. Nat Commun",
      "pubmed_id": "40328759",
      "pmc_id": "PMC12055966",
      "year": "2025",
      "journal": "16(1):4206",
      "authors": ""
    },
    {
      "title": "Coghill AE, Van Bibber N, Baiocchi RA, Arnold SM, Riedlinger G, Schneider BP, Zhang Y, Suneja G, Gomez Fontela M, Abate-Daga D, Teer JK. Elevated Tumor Mutation Burden in Cancer Patients with Underlying HIV Infection: Data from the Oncology Research Information Exchange Network (ORIEN). Cancer Epidemiol Biomarkers Prev",
      "pubmed_id": "40019488",
      "pmc_id": "PMC12048233",
      "year": "2025",
      "journal": "34(5):774-779",
      "authors": ""
    },
    {
      "title": "Wang C, Yu X, Teer JK, Yao J, Du D, Liu X, Thompson ZJ, Wang MH, Welsh EA, Memon D, Chan TA, Makarov V, Anadon CM, Saeed L, Boyle TA, Fang B, Koomen JM, Cox C, Landin AM, Yoder SJ, Kim S, Chen DT, Pilon-Thomas SA, Conejo-Garcia JR, Antonia SJ, Haura EB, Creelan BC. Impaired T cell and neoantigen retention in time-serial analysis of metastatic non-small cell lung cancer in patients unresponsive to TIL cell therapy. Nat Cancer",
      "pubmed_id": "40341231",
      "year": "2025",
      "journal": "6(5):801-819",
      "authors": ""
    },
    {
      "title": "Matejcic M, Teer JK, Hoehn HJ, Diaz DB, Shankar K, Gong J, Nguyen NT, Loroña NC, Coppola D, Fulmer CG, Saglam O, Jiang K, Cress WD, Muñoz-Antonia T, Flores I, Gordián ER, Oliveras Torres JA, Felder SI, Sanchez J, Fleming JB, Siegel EM, Freedman JA, Dutil J, Stern MC, Fridley BL, Figueiredo JC, Schmit SL. Colorectal Tumors in Diverse Patient Populations Feature a Spectrum of Somatic Mutational Profiles. Cancer Res",
      "pubmed_id": "40126181",
      "pmc_id": "PMC12234169",
      "year": "2025",
      "journal": "85(10):1928-1944",
      "authors": ""
    },
    {
      "title": "Bari S, Matejcic M, Kim RD, Xie H, Sahin IH, Powers BD, Teer JK, Chan TA, Felder SI, Schmit SL. Practice Patterns and Survival Outcomes of Immunotherapy for Metastatic Colorectal Cancer. JAMA Netw Open",
      "pubmed_id": "40111368",
      "pmc_id": "PMC11926646",
      "year": "2025",
      "journal": "8(3):e251186",
      "authors": ""
    },
    {
      "title": "Peeri NC, Teer JK, Thompson ZJ, Nabors LB, Brooks M, Sologon CM, Williams SL, Egan KM. Glioma grade and mortality in relation to sequence variation in the mitochondrial genome. Cancer Genet",
      "pubmed_id": "40382795",
      "pmc_id": "PMC12124938",
      "year": "2025",
      "journal": "294-295:171-180",
      "authors": ""
    },
    {
      "title": "Sudalagunta PR, Canevarolo RR, Meads MB, Silva M, Zhao X, Cubitt CL, Sansil SS, DeAvila G, Alugubelli RR, Bishop RT, Tungesvik A, Zhang Q, Hampton O, Teer JK, Welsh EA, Yoder SJ, Shah BD, Hazlehurst L, Gatenby RA, Van Domelen DR, Chai Y, Wang F, DeCastro A, Bloomer AM, Siegel EM, Lynch CC, Sullivan DM, Alsina M, Nishihori T, Brayer J, Cleveland JL, Dalton W, Walker CJ, Landesman Y, Baz R, Silva AS, Shain KH. The Functional Transcriptomic Landscape Informs Therapeutic Strategies in Multiple Myeloma. Cancer Res",
      "pubmed_id": "39476082",
      "pmc_id": "PMC11733535",
      "year": "2025",
      "journal": "85(2):378-398",
      "authors": ""
    }
  ],
  "grants": [
    {
      "description": "Title: Molecular Drivers of Lung Cancer in Hispanics  \nAward Number: 5R21CA259215-02  \nSponsor: National Cancer Institute (NCI)  \nCress, W. (PD/PI), Teer, J. (PD/PI)",
      "source": "NCI",
      "period": "9215-02"
    },
    {
      "description": "Title: Analysis of Genetic Ancestry Across the ORIEN Network  \nAward Number: 014487-00001  \nSponsor: COMMUNITY FOUNDATION OF TAMPA  \nTeer, J. (PD/PI)",
      "period": "4487-0000"
    },
    {
      "description": "Title: Biological Determinants of Colorectal Cancer Outcomes in Latinos of Diverse Ancestral Origins  \nAward Number: 5R01CA238087-05  \nSponsor: National Cancer Institute (NCI)  \nTeer, J. (PD/PI)",
      "source": "NCI",
      "period": "8087-05"
    },
    {
      "description": "Title: Variation in Tumor-Associated Immune Profiles and Colorectal Cancer Outcomes Across Populations of Diverse Ancestral Origins  \nAward Number: 5R01CA248931-03  \nSponsor: National Cancer Institute (NCI)  \nTeer, J. (PD/PI)",
      "source": "NCI",
      "period": "8931-03"
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/TeerJamie_10966.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=10966"
  },
  "content_hash": "94235fc70a53008d4156fba00ca622e8800502387b3e2fcd9fa995051ead35bd",
  "researcher_name": "Jamie Teer",
  "department": "Biostatistics and Bioinformatics"
}