{
  "profile_url": "https://www.moffitt.org/research-science/researchers/jenny-vidrine/",
  "last_updated": "2025-11-21T22:50:24.386297",
  "researcher_id": "24327",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "health outcomes and behavior",
  "research_program": "health outcomes & behavior",
  "overview": "Dr. Jennifer Vidrine's research program focuses broadly on tobacco cessation interventions for underserved populations and health care systems-level approaches to cessation.",
  "research_interests": [
    "Dr. Jennifer I. Vidrine’s research program focuses on eliminating health disparities through evaluating the impact of tailored health risk communications, examining potential mechanisms underlying changes in risk perceptions over time in the natural environment, smoking cessation interventions for vulnerable and underserved populations and the implementation of health care systems-level tobacco treatment interventions. Her research program has been continuously supported over the past 16 years by grants from the National Institutes of Health (National Cancer Institute), Centers for Disease Control and Prevention, Center for Medicare and Medicaid Services, and the Cancer Prevention Research Institute of Texas.\n  *"
  ],
  "associations": [
    "Health Outcomes and Behavior",
    "Thoracic Oncology",
    "Health Outcomes & Behavior Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of South Florida, PhD"
    },
    {
      "type": "Graduate",
      "institution": "The University of Central Florida, MS"
    }
  ],
  "publications": [
    {
      "title": "Mobile Health Technology for Personalized Tobacco Cessation Support Among Cancer Survivors and Caregivers in Laos (Project SurvLaos): Protocol for a Pilot Randomized Controlled Trial",
      "pubmed_id": "40736921",
      "pmc_id": "PMC12351191",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Keopaseuth P, Xangsayarath P, Kulkarni S, Phandouangsy K, Soulaphy C, Alounlungsy P, Dittaphong V, Xayavong D, Vongdala C, Siengsounthone L, Businelle M, Frank-Pearce SG, Vidrine DJ, Vidrine JI, Bui TC",
      "journal": "JMIR Res Protoc"
    },
    {
      "title": "Feasibility, Acceptability, and Outcomes of Project Rally: Pilot Study of a YMCA-Based Pickleball Program for Cancer Survivors",
      "pubmed_id": "39942445",
      "pmc_id": "PMC11817839",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Parker NH, de Cerqueira Santos A, Mintrone R, Turner K, Sutton SK, O'Connor T, Huang J, Lael M, Cruff S, Grassia K, De Vera MT, Bean M, Carmella R, Vadaparampil ST, Vidrine JI",
      "journal": "Healthcare (Basel)"
    },
    {
      "title": "Early Treatment Engagement and Long-Term Smoking Abstinence Among Women With Cervical Intraepithelial Neoplasia or Cervical Cancer",
      "pubmed_id": "40673008",
      "pmc_id": "PMC12264617",
      "year": "2025",
      "publication_date": "2025 Aug",
      "authors": "Hoogland CE, Sutton SK, Fennell BS, Simmons VN, Vinci C, Naqa IE, Salloum RG, Shete SS, Hembree T, Vidrine DJ, Vidrine JI",
      "journal": "AJPM Focus"
    },
    {
      "title": "Smoking Cessation by Cancer Treatment Status Among Cervical Cancer Survivors",
      "pubmed_id": "38342477",
      "pmc_id": "PMC11231988",
      "year": "2024",
      "publication_date": "2024 Jun",
      "authors": "Cottrell-Daniels C, Hoogland CE, Fennell BS, Simmons VN, Vidrine DJ, Vidrine JI",
      "journal": "Am J Prev Med"
    },
    {
      "title": "Improving Smoking Cessation Support for Patients With Cancer",
      "pubmed_id": "38181304",
      "pmc_id": "PMC10911543",
      "year": "2024",
      "publication_date": "2024 Feb",
      "authors": "Vidrine JI, Simmons VN, Vidrine DJ",
      "journal": "JCO Oncol Pract"
    },
    {
      "title": "In-clinic Versus Online Recruitment of Women With a History of Cervical Intraepithelial Neoplasia or Cervical Cancer to a Smoking Cessation Trial: A Post hoc Comparison of Participant Characteristics, Study Retention, and Cessation Outcomes",
      "pubmed_id": "38452212",
      "pmc_id": "PMC11339160",
      "year": "2024",
      "publication_date": "2024 Aug",
      "authors": "Fennell BS, Jones SR, Sutton SK, Hoogland CE, Cottrell-Daniels C, Wetter DW, Shih YT, Simmons VN, Stephens YP, Vidrine DJ, Vidrine JI",
      "journal": "Nicotine Tob Res"
    },
    {
      "title": "Efficacy of a Smoking Cessation Intervention for Survivors of Cervical Intraepithelial Neoplasia or Cervical Cancer: A Randomized Controlled Trial",
      "pubmed_id": "36921237",
      "year": "2023",
      "publication_date": "2023 May",
      "authors": "Vidrine JI, Sutton SK, Wetter DW, Shih YT, Ramondetta LM, Elting LS, Walker JL, Smith KM, Frank-Pearce SG, Li Y, Jones SR, Kendzor DE, Simmons VN, Vidrine DJ",
      "journal": "J Clin Oncol"
    },
    {
      "title": "Ending Tobacco Use Through Interactive Tailored Messaging for Cambodian People With HIV (Project EndIT): Protocol for a Randomized Controlled Trial",
      "pubmed_id": "37384390",
      "pmc_id": "PMC10365624",
      "year": "2023",
      "publication_date": "2023 Jun",
      "authors": "Bui TC, Hoogland CE, Chhea C, Sopheab H, Ouk V, Samreth S, Hor B, Vidrine JI, Businelle MS, Shih YCT, Sutton SK, Jones SR, Shorey Fennell B, Cottrell-Daniels C, Frank-Pearce SG, Ngor C, Kulkarni S, Vidrine DJ",
      "journal": "JMIR Res Protoc"
    },
    {
      "title": "Qualitative evaluation of the implementation and future sustainability of an e-referral system for smoking cessation at a US NCI-designated comprehensive cancer center: lessons learned",
      "pubmed_id": "37480364",
      "year": "2023",
      "publication_date": "2023 Jul",
      "authors": "Yang MJ, Martínez Ú, Fulton HJ, Maconi ML, Turner K, Powell ST, Chern JY, Brandon TH, Vidrine JI, Simmons VN",
      "journal": "Support Care Cancer"
    },
    {
      "title": "Enhancing long-term smoking abstinence among individuals with a history of cervical intraepithelial neoplasia or cervical cancer (Project ACCESS): protocol for a randomized clinical trial",
      "pubmed_id": "37403057",
      "pmc_id": "PMC10318835",
      "year": "2023",
      "publication_date": "2023 Jul",
      "authors": "Vidrine JI, Fennell BS, Simmons VN, Sutton SK, Jones SR, Woodward HW, Hoogland CE, Vidrine DJ",
      "journal": "BMC Public Health"
    }
  ],
  "grants": [
    {
      "description": "Title: CCSG Developmental Project: Pilot Project for Tobacco Cessation and Machine Learning  \nAward Number: 5P30CA076292-26  \nSponsor: National Cancer Institute (NCI)  \nCleveland, J. (PD/PI), Vidrine, J. (PD/PI)",
      "title": "CCSG Developmental Project: Pilot Project for Tobacco Cessation and Machine Learning",
      "award_number": "5P30CA076292-26",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Cleveland, J.",
          "role": "PD/PI"
        },
        {
          "name": "Vidrine, J.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Partnering with a State Food Bank to Provide Tobacco Treatment to Underserved Smokers  \nAward Number: 5R01CA231952-06  \nSponsor: National Cancer Institute (NCI)  \nVidrine, D. (PD/PI), Vidrine, J. (PD/PI)",
      "title": "Partnering with a State Food Bank to Provide Tobacco Treatment to Underserved Smokers",
      "award_number": "5R01CA231952-06",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Vidrine, D.",
          "role": "PD/PI"
        },
        {
          "name": "Vidrine, J.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Health Communications for Adults Smoking Nondaily  \nAward Number: 1R03CA286623-01A1  \nSponsor: National Cancer Institute (NCI)  \nVidrine, J. (PD/PI)",
      "title": "Health Communications for Adults Smoking Nondaily",
      "award_number": "1R03CA286623-01A1",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Vidrine, J.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Enhancing Long-Term Smoking Abstinence Among Cervical Cancer Survivors  \nAward Number: 22K02  \nSponsor: Florida Department of Health  \nVidrine, J. (PD/PI)",
      "title": "Enhancing Long-Term Smoking Abstinence Among Cervical Cancer Survivors",
      "award_number": "22K02",
      "sponsor": "Florida Department of Health",
      "investigators": [
        {
          "name": "Vidrine, J.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "participating_trials": [],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/VidrineJenny_24327.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=24327"
  },
  "content_hash": "e154c6b167bc06aaa2e7273e1ae40550cc23de6719cd1410e79c6297102ce0ef",
  "researcher_name": "jenny vidrine",
  "department": "health outcomes & behavior"
}