{
  "profile_url": "https://www.moffitt.org/research-science/researchers/jennifer-permuth/",
  "last_updated": "2025-11-21T22:50:24.366298",
  "researcher_id": "1761",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "cancer epidemiology",
  "research_program": "cancer epidemiology",
  "overview": "Areas of research relate to gastrointestinal cancer prevention, early detection, and therapeutics along with cancer disparities.",
  "research_interests": [
    "Dr. Permuth is a molecular epidemiologist whose research focuses on investigating the molecular basis of gastrointestinal malignancies. Her research portfolio is currently dedicated to three key areas: 1) developing early detection and prevention strategies for pancreatic cancer; 2) understanding and targeting biological reasons for the higher pancreatic cancer incidence and mortality rates observed among African Americans; and 3) studying inherited and acquired markers of cancer susceptibility, prognosis, and response to therapy. She is also a founding principal investigator of a multi-institutional partnership known as the Florida Pancreas Collaborative which aims to advance pancreatic cancer research in the state of Florida and beyond. Her team’s overarching goal is to develop and implement strategies to personalize care and improve outcomes for populations affected by or at risk for GI malignancies. In her leadership role as the first Vice Chair of Research in the Department of Gastrointestinal Oncology, she works with faculty, staff, and other stakeholders to develop, maintain, and lead active translational research programs in GI Oncology.\n  *"
  ],
  "associations": [
    "Cancer Epidemiology",
    "Gastrointestinal Oncology",
    "Cancer Epidemiology Program",
    "Cancer Chemoprevention Research Interest Group"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of Minnesota, MS"
    },
    {
      "type": "Graduate",
      "institution": "University of South Florida, PhD"
    }
  ],
  "publications": [
    {
      "title": "The Impact of Edema on Skeletal Muscle Changes among Patients with Pancreatic Ductal Adenocarcinoma",
      "pubmed_id": "40553455",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Davis EW, Park MA, Basinski TL, Arnoletti JP, Bloomston M, Carson TL, Biachi De Castria T, Chen DT, Cortizas EM, Crowder SL, Genilo-Delgado M, Douglas WG, Huguet KL, Jiang K, Hodul PJ, Karolak A, Kim DW, Koomen JM, Menon AA, Mo Q, Mok SR, Molina-Vega MA, Moreno-Urazan L, Ahmed S, Parker NH, Pimiento JM, Rasool G, Sparks LM, Stewart PA, Tassielli AF, Teer JK, Trevino JG, Velanovich V, Wang X, Whelan CJ, Judge SM, Judge AR, Fleming JB, Malafa MP, Jeong D, Permuth JB",
      "journal": "Cancer Epidemiol Biomarkers Prev"
    },
    {
      "title": "Linkage disequilibrium score regression identifies genetic correlations between hepatocellular carcinoma and clinically relevant traits",
      "pubmed_id": "41013983",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Han Y, Shaw VR, Byun J, Thrift AP, Zhu C, Li D, Hatia RI, Kelley RK, Cleary SP, Lok AS, Bracci PM, Permuth JB, Bucur R, Knox J, Yuan JM, Singal AG, Jalal PK, Ghobrial RM, Kono Y, Shah DP, Nguyen MH, Parikh ND, Kim R, Wu HC, El-Serag H, Chang P, Chun YS, Gu J, Huff C, Rashid A, Hwang LY, Klein AP, Khaderi SA, Kaseb AO, McGlynn KA, Roberts LR, Hassan MM, Amos CI",
      "journal": "Int J Cancer"
    },
    {
      "title": "Assessing outcomes of full-thickness resection in piecemeal polypectomy scar consolidation of colon adenomas containing cancer",
      "pubmed_id": "40932816",
      "pmc_id": "PMC12417760",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Radosavljevic I, Dam A, Luthra AK, Pena L, Cappelle S, Permuth JB, Felder S, Sanchez J, Stefanou A, Friedman M, Mok SR",
      "journal": "Endosc Int Open"
    },
    {
      "title": "Multimodal AI-driven Biomarker for Early Detection of Cancer Cachexia",
      "pubmed_id": "41001462",
      "pmc_id": "PMC12458964",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Ahmed S, Parker N, Park M, Davis EW, Jeong D, Permuth JB, Schabath MB, Yilmaz Y, Rasool G",
      "journal": "medRxiv"
    },
    {
      "title": "Lifetime stressor exposure and depression among patients with pancreatic cancer: insights from the Florida Pancreas Collaborative",
      "pubmed_id": "41062956",
      "pmc_id": "PMC12506433",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "DeSomma A, Maletz S, Basinski TL, Morales R, de Castria TB, Bloomston M, Chen DT, Douglas WG, Huguet KL, Jeong D, Jiang K, Kim DW, Luthra A, Pimiento JM, Rajasekhara S, Velanovich V, Park MA, Shields GS, Slavich GM, Permuth JB",
      "journal": "BMC Cancer"
    },
    {
      "title": "Early Supportive and Nutritional Care For Adults With Pancreatic Cancer: A Pilot Study",
      "pubmed_id": "40816695",
      "year": "2025",
      "publication_date": "2025 Nov",
      "authors": "Lin YC, Turner K, Rajasekhara S, Kim DW, de Castria TB, Nguyen OT, Hume E, Sprow O, Santiago C, Milano J, Riccardi D, Nardella N, Al-Jumayli M, Permuth JB, Hoffe S, Hembree T, Hong YR, Islam JY, Tabriz AA, Hodul PJ",
      "journal": "J Pain Symptom Manag"
    },
    {
      "title": "The Transcriptomic Landscapes of Appendiceal Primary and Metastatic Tumors are Distinct",
      "pubmed_id": "39987388",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Park MA, Jacobson R, Genilo-Delgado M, Mohammadi A, Moran-Segura C, Alhassan S, Nakanishi Y, Permuth JB, Imanirad I, Dineen SP",
      "journal": "Ann Surg Oncol"
    },
    {
      "title": "Correction: Park et al",
      "pubmed_id": "40149388",
      "pmc_id": "PMC11941415",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Park MA, Whelan CJ, Ahmed S, Boeringer T, Brown J, Carson TL, Crowder SL, Gage K, Gregg C, Jeong DK, Jim HSL, Judge AR, Mason TM, Parker N, Pillai S, Qayyum A, Rajasekhara S, Rasool G, Tinsley SM, Schabath MB, Stewart P, West J, McDonald P, Permuth JB",
      "journal": "Defining and Addressing Research Priorities in Cancer Cachexia through Transdisciplinary Collaboration"
    },
    {
      "title": "Influence of Coping, Esteem, and Resilience on Caregiver Distress in Pancreatic Cancer Patient-Caregiver Dyads",
      "pubmed_id": "39857142",
      "pmc_id": "PMC11765500",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Nardella N, Xia BT, Allenson K, Oraiqat A, Fan W, Mo Q, Permuth J, Kim DW, Hodul P",
      "journal": "Healthcare (Basel)"
    },
    {
      "title": "Developing and Assessing a Scalable Digital Health Tool for Pretest Genetic Education in Patients With Early-Onset Colorectal Cancer: Mixed Methods Design",
      "pubmed_id": "39819811",
      "pmc_id": "PMC11786131",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Rivera Rivera JN, Snir M, Simmons E, Schmidlen T, Sholeh M, Maconi ML, Geiss C, Fulton H, Barton L, Gonzalez BD, Permuth J, Vadaparampil S",
      "journal": "JMIR Cancer"
    }
  ],
  "grants": [
    {
      "description": "Title: Physical Activity and Nutrition to Halt Elevated Risk in the Pancreas Interception Center (PANTHER-PIC)  \nAward Number:   \nSponsor: Foundation Support-Rsch  \nMok, S. (PD/PI), Permuth, J. (PD/PI)",
      "title": "Physical Activity and Nutrition to Halt Elevated Risk in the Pancreas Interception Center (PANTHER-PIC)",
      "award_number": "",
      "sponsor": "Foundation Support-Rsch",
      "source": "Foundation",
      "investigators": [
        {
          "name": "Mok, S.",
          "role": "PD/PI"
        },
        {
          "name": "Permuth, J.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Pancreatic Cancer Early Detection (PRECEDE) Consortium  \nAward Number: 24MCC03877  \nSponsor: TrovaNOW  \nPermuth, J. (PD/PI)",
      "title": "Pancreatic Cancer Early Detection (PRECEDE) Consortium",
      "award_number": "24MCC03877",
      "sponsor": "TrovaNOW",
      "investigators": [
        {
          "name": "Permuth, J.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Using Radiogenomics to Noninvasively Predict the Malignant Potential of Intraductal Papillary Mucinous Neoplasms of the Pancreas and Uncover Hidden Biology  \nAward Number: 5R37CA229810-07  \nSponsor: National Cancer Institute (NCI)  \nJeong, D. (PD/PI), Permuth, J. (PD/PI)",
      "title": "Using Radiogenomics to Noninvasively Predict the Malignant Potential of Intraductal Papillary Mucinous Neoplasms of the Pancreas and Uncover Hidden Biology",
      "award_number": "5R37CA229810-07",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Jeong, D.",
          "role": "PD/PI"
        },
        {
          "name": "Permuth, J.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Evaluating Obesity-Mediated Mechanisms of Pancreatic Carcinogenesis in Minority Populations  \nAward Number: W81XWH-22-1-1021  \nSponsor: Department of Defense (DOD)  \nPermuth, J. (PD/PI)",
      "title": "Evaluating Obesity-Mediated Mechanisms of Pancreatic Carcinogenesis in Minority Populations",
      "award_number": "W81XWH-22-1-1021",
      "sponsor": "Department of Defense (DOD)",
      "source": "DOD",
      "investigators": [
        {
          "name": "Permuth, J.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: AR-agonist pre-treatment enables evolutionary steering in metastatic ER+ breast cancer  \nAward Number:   \nSponsor: Florida Department of Health  \nPermuth, J. (PD/PI), West, J. (PD/PI)",
      "title": "AR-agonist pre-treatment enables evolutionary steering in metastatic ER+ breast cancer",
      "award_number": "",
      "sponsor": "Florida Department of Health",
      "investigators": [
        {
          "name": "Permuth, J.",
          "role": "PD/PI"
        },
        {
          "name": "West, J.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Comparing the Morphology and Molecular Profile of Skeletal Muscle Tissue and the Influence of Tobacco and Obesity on Pancreatic Cancer Outcomes in a Diverse Cohort of Floridians  \nAward Number: 24K03  \nSponsor: Florida Department of Health  \nPermuth, J. (PD/PI)",
      "title": "Comparing the Morphology and Molecular Profile of Skeletal Muscle Tissue and the Influence of Tobacco and Obesity on Pancreatic Cancer Outcomes in a Diverse Cohort of Floridians",
      "award_number": "24K03",
      "sponsor": "Florida Department of Health",
      "investigators": [
        {
          "name": "Permuth, J.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: AI-Driven Early Detection of Cachexia in Pancreatic Cancer and Feasibility of Diet and Exercise Interventions  \nAward Number: 25C62  \nSponsor: Florida Department of Health  \nRasool, G. (PD/PI), Parker, N. (Co-PD/PI), Permuth, J. (Co-PD/PI), Shafer, S. (Co-PD/PI)",
      "title": "AI-Driven Early Detection of Cachexia in Pancreatic Cancer and Feasibility of Diet and Exercise Interventions",
      "award_number": "25C62",
      "sponsor": "Florida Department of Health",
      "investigators": [
        {
          "name": "Rasool, G.",
          "role": "PD/PI"
        },
        {
          "name": "Parker, N.",
          "role": "Co-PD/PI"
        },
        {
          "name": "Permuth, J.",
          "role": "Co-PD/PI"
        },
        {
          "name": "Shafer, S.",
          "role": "Co-PD/PI"
        }
      ]
    },
    {
      "description": "Title: Improving the Early Detection of Pancreatic Cancer by Developing a Multimodal Machine Learning Approach to Aid in Risk Stratification of Intraductal Papillary Mucinous Neoplasms (IPMNs)  \nAward Number:   \nSponsor: Support Accounts-Oper  \nPermuth, J. (PD/PI), Rasool, G. (PD/PI)",
      "title": "Improving the Early Detection of Pancreatic Cancer by Developing a Multimodal Machine Learning Approach to Aid in Risk Stratification of Intraductal Papillary Mucinous Neoplasms (IPMNs)",
      "award_number": "",
      "sponsor": "Support Accounts-Oper",
      "investigators": [
        {
          "name": "Permuth, J.",
          "role": "PD/PI"
        },
        {
          "name": "Rasool, G.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "participating_trials": [
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-20105/",
      "trial_id": "20105",
      "title": "Using Radiogenomics to Noninvasively Predict the Malignant Potential of Intraductal Papillary Mucinous Neoplasms (IPMNs) of the Pancreas and Uncover Hidden Biology",
      "condition": "Gastrointestinal Tumor",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-21962/",
      "trial_id": "21962",
      "title": "Evaluating Obesity-Mediated Mechanisms of Pancreatic Carcinogenesis in Minority Populations",
      "condition": "Gastrointestinal Tumor",
      "intervention": "Not Applicable ()",
      "status": "Open"
    }
  ],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/PermuthJennifer_1761.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=1761"
  },
  "content_hash": "d7a15c1e62bf352c25ff53ab93a3dfc0f57be571441a0947c74fad380d1f7d51",
  "researcher_name": "jennifer permuth",
  "department": "cancer epidemiology"
}