{
  "profile_url": "https://www.moffitt.org/research-science/researchers/jonathan-metts/",
  "last_updated": "2025-11-21T22:50:24.691667",
  "researcher_id": "unknown",
  "degrees": [
    "MD"
  ],
  "title": "",
  "primary_program": "sarcoma",
  "research_program": "cancer biology & evolution",
  "overview": "My research focuses on novel therapies for relapsed/refractory pediatric sarcomas and other solid tumors. This research into the biology of relapsed disease, outcomes of relapsed sarcoma patients, and development of novel chemotherapeutic and immunotherapeutic approaches to relapsed pediatric sarcoma and other solid tumors.",
  "research_interests": [
    "1. I study the development of novel therapies for high-risk and relapsed pediatric solid tumors, which confer dismal prognosis with very few therapeutic advances over the last 20 years. I have first-authored Phase I trial publications in relapsed CNS tumors and pediatric solid tumors. I am PI of multiple ongoing relapsed solid tumor studies I am currently engaged with Children’s Oncology Group to perform multiple secondary analyses on children treated on clinical trials with rhabdomyosarcoma. I have developed a robust Phase I trial program at Johns Hopkins All Children's Hospital, Moffitt's pediatric affiliate, for children with relapsed/refractory solid tumors. I am also engaged with the Moffitt Immunology Department on the study of TIL in pediatric solid tumors, including the development of the first Phase I trial of TIL therapy in pediatric solid tumors. \n  *"
  ],
  "associations": [
    "Sarcoma",
    "Cancer Biology & Evolution Program"
  ],
  "education": [],
  "publications": [
    {
      "title": "A Phase I Trial of Nab-Paclitaxel in Combination With Gemcitabine for Relapsed/Refractory Pediatric Solid Tumors",
      "pubmed_id": "41088849",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Metts J, Ginn K, He Z, Keesari R, Cook JC, Senn S, Schink M, Sansil S, Yin H, Cash T",
      "journal": "Pediatr Blood Cancer"
    },
    {
      "title": "Expansion of tumor-infiltrating and marrow-infiltrating lymphocytes from pediatric malignant solid tumors",
      "pubmed_id": "39243253",
      "pmc_id": "PMC11668621",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Metts J, Rodriguez-Valentin M, Hensel J, Alfaro A, Snyder CW, Binitie O, Chebli C, Monforte H, Pilon-Thomas S, Mullinax J",
      "journal": "Cytotherapy"
    },
    {
      "title": "Ewing Sarcoma, Desmoplastic Small Round Cell Tumor, and Other Round Cell Sarcomas",
      "pubmed_id": "40374389",
      "pmc_id": "PMC12232455",
      "year": "2025",
      "publication_date": "2025 Aug",
      "authors": "Underdown MJ, Kappa S, Metts J, Cash T",
      "journal": "Hematol Oncol Clin North Am"
    },
    {
      "title": "Adolescent and Young Adult Oncology in the United States in 2025: Finding Its Place in the Oncology World-Part 1 of 2",
      "pubmed_id": "40549895",
      "year": "2025",
      "publication_date": "2025 Aug",
      "authors": "Shaw PH, Castellino SM, Metts J, Guerrettaz R, Hayes-Lattin B, De Sa H, Bleyer A",
      "journal": "J Pediat Hematol Onc"
    },
    {
      "title": "Prioritization of novel agents for further investigation in pediatric non-rhabdomyosarcoma soft tissue sarcomas: A report from the Children's Oncology Group",
      "pubmed_id": "40651390",
      "pmc_id": "PMC12409922",
      "year": "2025",
      "publication_date": "2025 Aug",
      "authors": "Crane JN, Douglass DP, Oberoi S, Collins NB, Gupta A, Metts JL, Avutu V, Dela Cruz FS, Davis JL, Federman NC, Hiniker SM, Laetsch TW, Linardic CM, Navid F, Saab R, Shulman DS, Shern JF, Soragni A, Stewart EA, Terezakis S, Weigel BJ, Weiss AR",
      "journal": "Eur J Cancer"
    },
    {
      "title": "Lymph Node Staging and Treatment in Pediatric Patients With Soft Tissue Sarcomas: A Consensus Opinion From the Children's Oncology Group, European paediatric Soft Tissue Sarcoma Study Group, and the Cooperative Weichteilsarkom Studiengruppe",
      "pubmed_id": "39844722",
      "pmc_id": "PMC12083081",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Terwisscha van Scheltinga S, Schoot RA, Routh JC, Seitz G, Kao SC, de Keizer B, Shulkin B, Ewijk RV, McCarville B, Casey D, Allen-Rhoades W, Mercolini F, Merks H, Orbach D, Kapadia T, Walterhouse DO, Davila Fajardo R, Hiemcke-Jiwa L, Franzius C, De Corti F, Tang V, Metts J, Oberoi S, Vokuhl C, Dasgupta R, Birz S, Rodeberg D",
      "journal": "Pediatr Blood Cancer"
    },
    {
      "title": "Pediatric Leukemia Roadmaps Are a Guide for Positive Metastatic Bone Sarcoma Trials",
      "pubmed_id": "38843482",
      "year": "2024",
      "publication_date": "2024 Sep",
      "authors": "Reed DR, Tulpule A, Metts J, Trucco M, Robertson-Tessi M, O'Donohue TJ, Iglesias-Cardenas F, Isakoff MS, Mauguen A, Shukla N, Dela Cruz FS, Tap W, Kentsis A, Morris CD, Hameed M, Honeyman JN, Behr GG, Sulis ML, Ortiz MV, Slotkin E",
      "journal": "J Clin Oncol"
    },
    {
      "title": "Refractory juvenile xanthogranuloma of the mastoid bone responsive to trametinib",
      "pubmed_id": "39030859",
      "year": "2024",
      "publication_date": "2024 Oct",
      "authors": "Hauk I, Gonzalez-Gomes I, Chellapandian D, Metts J, Shaw PH",
      "journal": "Pediatr Blood Cancer"
    },
    {
      "title": "Roadmap for the next generation of Children's Oncology Group rhabdomyosarcoma trials",
      "pubmed_id": "38941509",
      "pmc_id": "PMC11511643",
      "year": "2024",
      "publication_date": "2024 Nov",
      "authors": "Metts JL, Aye JM, Crane JN, Oberoi S, Balis FM, Bhatia S, Bona K, Carleton B, Dasgupta R, Dela Cruz FS, Greenzang KA, Kaufman JL, Linardic CM, Parsons SK, Robertson-Tessi M, Rudzinski ER, Soragni A, Stewart E, Weigel BJ, Wolden SL, Weiss AR, Venkatramani R, Heske CM",
      "journal": "Cancer"
    },
    {
      "title": "Event-free survival in relapsed and refractory rhabdomyosarcoma treated on cooperative group phase II trials: A report from the Children's Oncology Group",
      "pubmed_id": "38627882",
      "pmc_id": "PMC11180298",
      "year": "2024",
      "publication_date": "2024 Jul",
      "authors": "Metts J, Xue W, Gao Z, Oberoi S, Weiss AR, Venkatramani R, Harrison DJ",
      "journal": "Pediatr Blood Cancer"
    }
  ],
  "grants": [
    {
      "description": "Title: The Sunshine Project 2024-2028  \nAward Number: n/a  \nSponsor: PEDIATRIC CANCER FOUNDATION  \nMetts, J. (PD/PI)",
      "title": "The Sunshine Project 2024-2028",
      "award_number": "n/a",
      "sponsor": "PEDIATRIC CANCER FOUNDATION",
      "investigators": [
        {
          "name": "Metts, J.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Tumor-Infiltrating Lymphocyte Therapy for High-Risk Solid Tumors  \nAward Number: N/A  \nSponsor: Cannonball Kids' cancer Foundation  \nMetts, J. (PD/PI)",
      "title": "Tumor-Infiltrating Lymphocyte Therapy for High-Risk Solid Tumors",
      "sponsor": "Cannonball Kids' cancer Foundation",
      "source": "Foundation",
      "investigators": [
        {
          "name": "Metts, J.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Feasibility of Generating Novel Translational and Therapeutic Strategies based on a Multicenter, Pediatric and AYA Evolutionary Tumor Board; pedsETB  \nAward Number: 23L11  \nSponsor: Florida Department of Health  \nMetts, J. (PD/PI), Anderson, A. (Co-PD/PI), Brown, J. (Co-PD/PI), Marusyk, A. (Co-PD/PI), Robertson-Tessi, M. (Co-PD/PI)",
      "title": "Feasibility of Generating Novel Translational and Therapeutic Strategies based on a Multicenter, Pediatric and AYA Evolutionary Tumor Board; pedsETB",
      "award_number": "23L11",
      "sponsor": "Florida Department of Health",
      "investigators": [
        {
          "name": "Metts, J.",
          "role": "PD/PI"
        },
        {
          "name": "Anderson, A.",
          "role": "Co-PD/PI"
        },
        {
          "name": "Brown, J.",
          "role": "Co-PD/PI"
        },
        {
          "name": "Marusyk, A.",
          "role": "Co-PD/PI"
        },
        {
          "name": "Tessi, M.",
          "role": "Co-PD/PI"
        }
      ]
    },
    {
      "description": "Title: Metastatic Ewing Sarcoma Trial Testing Schedule Enhancements to Improve Outcomes  \nAward Number: 24L03  \nSponsor: Florida Department of Health  \nMetts, J. (PD/PI)",
      "title": "Metastatic Ewing Sarcoma Trial Testing Schedule Enhancements to Improve Outcomes",
      "award_number": "24L03",
      "sponsor": "Florida Department of Health",
      "investigators": [
        {
          "name": "Metts, J.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": ""
    }
  ],
  "participating_trials": [
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23281/",
      "trial_id": "23281",
      "title": "Metastatic Ewing s Trial Testing Schedule Enhancement to Improve Outcomes",
      "condition": "Sarcoma",
      "intervention": "Actinomycin D (Dactinomycin); Adriamycin (doxorubicin); CPT-11 (irinotecan); Cabozantinib (XL 184); Camptosar (irinotecan); Dactinomycin (); Doxil (doxorubicin liposome); Etoposide (); Ifosfamide (); Radiotherapy (); Topotecan (); Vincristine (); cyclophosphamide (); cytoxan (cyclophosphamide); doxorubicin (); doxorubicin liposome (); irinotecan ()",
      "status": "Open"
    }
  ],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/MettsJonathan_31994.jpg",
  "contact": {},
  "content_hash": "ec61d73c51c9afed778db15bef0de104f2d78117c2a0f499f6025f7041290e74",
  "researcher_name": "jonathan metts",
  "department": ""
}