{
  "profile_url": "https://www.moffitt.org/research-science/researchers/julian-sanchez/",
  "last_updated": "2025-11-21T22:50:24.903163",
  "researcher_id": "12987",
  "degrees": [
    "MD"
  ],
  "title": "",
  "primary_program": "gastrointestinal oncology",
  "research_program": "health outcomes & behavior",
  "overview": "My research centers on cancer prevention and treatment among diverse populations with an emphasis on anal cancer screening, prevention, and therapy. I focus on high-risk populations including sexual and gender minority (LGBTQ+), persons living with HIV, and Latinx patients.",
  "research_interests": [
    "Dr. Sanchez's research interests are focused on anal cancer and colorectal cancer prevention. He has a special interest in minority health including Latino and gay populations.\n  *"
  ],
  "associations": [
    "Gastrointestinal Oncology",
    "Health Outcomes and Behavior",
    "Health Outcomes & Behavior Program"
  ],
  "education": [
    {
      "type": "Medical School",
      "institution": "Tufts University School of Medicine",
      "degree": "MD"
    },
    {
      "type": "Residency",
      "institution": "University of South Florida",
      "specialty": "General Surgery"
    },
    {
      "type": "Fellowship",
      "institution": "Cleveland Clinic, Ohio",
      "specialty": "Colorectal Surgery"
    }
  ],
  "publications": [
    {
      "title": "Assessing outcomes of full-thickness resection in piecemeal polypectomy scar consolidation of colon adenomas containing cancer",
      "pubmed_id": "40932816",
      "pmc_id": "PMC12417760",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Radosavljevic I, Dam A, Luthra AK, Pena L, Cappelle S, Permuth JB, Felder S, Sanchez J, Stefanou A, Friedman M, Mok SR",
      "journal": "Endosc Int Open"
    },
    {
      "title": "Incomplete Resection Is Twice as Likely in Locally Advanced Mucinous Compared to Nonmucinous Rectal Adenocarcinoma: A National Propensity-Matched Analysis",
      "pubmed_id": "39658830",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Hendrick LE, Naffouje S, Imanirad I, Pereira AL, Biachi T, Sanchez J, Dessureault S, Stefanou A, Dineen SP, Felder S",
      "journal": "J Surg Oncol"
    },
    {
      "title": "Colorectal Tumors in Diverse Patient Populations Feature a Spectrum of Somatic Mutational Profiles",
      "pubmed_id": "40126181",
      "pmc_id": "PMC12234169",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Matejcic M, Teer JK, Hoehn HJ, Diaz DB, Shankar K, Gong J, Nguyen NT, Loroña NC, Coppola D, Fulmer CG, Saglam O, Jiang K, Cress WD, Muñoz-Antonia T, Flores I, Gordián ER, Oliveras Torres JA, Felder SI, Sanchez J, Fleming JB, Siegel EM, Freedman JA, Dutil J, Stern MC, Fridley BL, Figueiredo JC, Schmit SL",
      "journal": "Cancer Res"
    },
    {
      "title": "Short- and Intermediate-Term Morbidity Following Total Pelvic Exenteration in Colorectal Cancer",
      "pubmed_id": "39848249",
      "pmc_id": "PMC11758541",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Guske C, Immen N, Conant D, Laborde J, Linscott J, Hayes M, Jazayeri SB, Fazili A, Siegel E, Dessureault S, Sanchez J, Stefanou A, Manley B, Felder S",
      "journal": "Cancer Control"
    },
    {
      "title": "Understanding Disclosure Decisions and Communication About HPV-Related Cancer: A Qualitative Exploration of Stigma and Social Support",
      "pubmed_id": "40361744",
      "pmc_id": "PMC12071953",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Villalona S, Sanchez J, Mangkalard P, Best AL",
      "journal": "Healthcare (Basel)"
    },
    {
      "title": "Building research infrastructure to advance precision medicine in colorectal cancer",
      "pubmed_id": "40111849",
      "pmc_id": "PMC12140009",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Schmit SL, Loroña NC, Sobieski D, Matejcic M, Nguyen NT, Hoehn HJ, Diaz DB, Shankar K, Cockman EM, Jean-Baptiste E, Tsai YY, Buchalter RB, Brito K, Wilson R, Coppola D, Fulmer C, Saglam O, Tassielli AF, Beato F, Dai R, Freedman JA, Purrington K, Hu B, Mcgrail D, Gibson H, Jiang K, Muñoz-Antonia T, Flores I, Gordian E, Oliveras Torres JA, Cheng I, Van Blarigan EL, Felder SI, Sanchez JA, Fleming JB, Siegel EM, Cress D, Thompson P, Stern MC, Teer JK, Figueiredo JC",
      "journal": "JNCI Cancer Spectr"
    },
    {
      "title": "A clinical overview of people living with HIV and genitourinary cancer care",
      "pubmed_id": "38238527",
      "year": "2024",
      "publication_date": "2024 Jun",
      "authors": "Suk-Ouichai C, Coghill AE, Schabath MB, Sanchez JA, Chahoud J, Necchi A, Giuliano AR, Spiess PE",
      "journal": "Nat Rev Urol"
    },
    {
      "title": "The role of rectal magnetic resonance imaging in accurate localization and designation of colorectal cancer for optimal management: Case study",
      "pubmed_id": "38745979",
      "pmc_id": "PMC11091459",
      "year": "2024",
      "publication_date": "2024 Aug",
      "authors": "Ogunleye O, Feuerlein S, Ahmed A, Parsee A, Jeong D, Henning J, Frakes J, Stefanou A, Sanchez J, Hoffe S, Dessureault S, Felder S, Costello J",
      "journal": "Radiol Case Rep"
    },
    {
      "title": "Return to intended oncologic therapy after colectomy for stage III colon adenocarcinoma: Does surgical approach matter?",
      "pubmed_id": "37553808",
      "year": "2023",
      "publication_date": "2023 Sep",
      "authors": "Pointer DT, Felder SI, Powers BD, Dessureault S, Sanchez JA, Imanirad I, Sahin I, Xie H, Naffouje SA",
      "journal": "Colorectal Dis"
    },
    {
      "title": "Clinical Tools for Rectal Cancer Response Assessment following Neoadjuvant Treatment in the Era of Organ Preservation",
      "pubmed_id": "38067239",
      "year": "2023",
      "publication_date": "2023 Nov",
      "authors": "Stefanou AJ, Dessureault S, Sanchez J, Felder S",
      "journal": "Cancers (Basel)"
    }
  ],
  "grants": [
    {
      "description": "Title: Health Equity Leadership Program (HELP): An Equity of Care Catalyst Development Program  \nAward Number: 11455, First Amendment  \nSponsor: FLORIDA BLUE  \nVillarroel d. (PD/PI), Green, B. (Co-PD/PI), Sanchez, J. (Co-PD/PI)",
      "title": "Health Equity Leadership Program (HELP): An Equity of Care Catalyst Development Program",
      "award_number": "11455, First Amendment",
      "sponsor": "FLORIDA BLUE  \nVillarroel d. (PD/PI),",
      "investigators": [
        {
          "name": "Green, B.",
          "role": "Co-PD/PI"
        },
        {
          "name": "Sanchez, J.",
          "role": "Co-PD/PI"
        }
      ]
    }
  ],
  "participating_trials": [],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/SanchezJulian_12987.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=12987"
  },
  "content_hash": "60fbc2331d2ba9447c8987b44ee84b6109ed3274d5dcc78fc02cb55b4f43715a",
  "researcher_name": "julian sanchez",
  "department": "health outcomes & behavior"
}