{
  "profile_url": "https://www.moffitt.org/research-science/researchers/karen-mann",
  "last_updated": "2025-10-19T00:25:52.202630",
  "researcher_id": "17771",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "Molecular Oncology",
  "research_program": "Cancer Biology & Evolution Program",
  "overview": "Pancreatic ductal adenocarcinoma (PDAC) is highly metastatic, and most patients die within a year of diagnosis. Survival rates have not significantly changed over the past couple of decades, illustrating the unmet need for identifying therapeutic targets and development of treatments to improve patient survival and quality of life. The research in my laboratory utilizes genetic, epigenetic and proteomic approaches in ex vivo and in vivo model systems to gain mechanistic insight into the role and regulation of transcriptional reprogramming and alternative splicing driving pancreatic cancer progression and metastasis to identify novel opportunities for therapeutic intervention.",
  "research_interests": [
    "Many solid tumor types, including pancreatic cancer, are highly molecularly heterogeneous, which poses a major challenge for identifying genetic and epigenetic events that actively contribute to tumor progression. Using a high-throughput in vivo genetic screening approach in a PDAC mouse model, we identified several novel tumor suppressors that cooperate with oncogenic KRAS to promote disease progression and metastasis through transcriptional rewiring and alternative splicing programs. My lab is focused on characterizing novel progression drivers we identified in our screen involved in gene transcription and alternative splicing, respectively, and the contribution of their deregulated gene networks in cancer progression and metastatic disease. TCF12 encodes a bHLH transcription factor with divergent roles in gene regulation in stem cells and differentiating cells during development. We found TCF12 levels are significantly decreased in invasive pancreatic adenocarcinoma compared to nonmalignant pancreatic lesions and that TCF12 depletion in orthotopic models of pancreatic cancer drives metastatic disease. We have recently expanded our studies of TCF12 in lung adenocarcinoma. Our current studies, in collaboration with Xiaoqing Yu and Paul Stewart, employ multiomics approaches to dissect (i) the transcriptional reprogramming driven by TCF12 downregulation during tumor progression and metastasis and (ii) how TCF12 transcriptome remodeling enhances oncogenic signaling. In collaboration with Lixin Wan, we are investigating mechanisms of TCF12 turnover through E3 ubiquitin-mediated degradation during PDAC progression. Recent data highlights splicing regulation as an important process driving cancer progression. Exon splicing profiles are shared among cancers of epithelial origin, suggesting that biological processes important to cancer development are commonly regulated by alternative exon splicing. We identified the RNA binding proteins RBFOX2 and MBNL1 as splicing regulators important for pancreatic cancer progression. My lab has recently shown RBFOX2 is regulated at both the transcriptional and post-transcriptional level in pancreatic cancer. Our functional validation studies demonstrated RBFOX2 reduction drives a highly metastatic disease in orthotopic mouse models, potentially through splicing modulation of transcripts involved in cell migration and invasion. In collaboration with Xiaoqing Yu and Moffitt Cancer Center and Mik Black at the University of Otago, New Zealand, we identified exon splicing events regulated by RBFOX2 enriched in transcripts encoding proteins involved in cytoskeletal remodeling and invadopodia formation. Our analyses of human PDAC RNASeq data show skipping of RBFOX2-target exons is prominent in human PDAC and metastases. Our current studies, in collaboration with Lancia Darville-Bowleg and John Koomen, are investigating how alternative splicing modulates protein isoforms with distinct or enhanced protein-protein interactions and phosphorylation modifications that promote cancer progression. In collaboration with Dae Kim and Margaret Park at Moffitt Cancer Center, we are investigating how loss of RBFOX2 and the resulting splicing dysregulation impacts disease progression and recurrence in patients. In collaboration with Ernesto Guccione at the Icahn School of Medicine, Mt. Sinai, NY, we are taking ex vivo and in vivo approaches to address how exon skipping of RBFOX2 and MBNL1 target exons enhances cell survival, metastasis and disease recurrence. Using Antisense Oligonucleotides as novel tool compounds, we are investigating the feasibility of targeting progression-associated exon splicing events in vivo to prevent or reduce metastasis. \n  *"
  ],
  "associations": [
    "Gastrointestinal Oncology",
    "Molecular Oncology",
    "Malignant Hematology",
    "Cancer Biology & Evolution Program",
    "Center of Excellence for Evolutionary Therapy"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "Case Western Reserve University, PhD"
    },
    {
      "type": "Fellowship",
      "institution": "National Cancer Institute",
      "specialty": ""
    },
    {
      "type": "Fellowship",
      "institution": "Institute of Molecular and Cell Biology",
      "specialty": ""
    }
  ],
  "publications": [
    {
      "title": "Crawford KJ, Humphrey KS, Cortes E, Wang J, Kumarasamy V, Wan Y, Long MD, Feigin ME, Witkiewicz AK, Mann KM, Knudsen ES, Abel EV. Targeting FGFR4 abrogates HNF1A-driven metastasis in pancreatic ductal adenocarcinoma. Mol Cancer",
      "pubmed_id": "40731412",
      "pmc_id": "PMC12306140",
      "year": "2025",
      "journal": "24(1):208",
      "authors": ""
    },
    {
      "title": "Mann KM. POGK is a domesticated KRAB domain-containing transposable element with tumor suppressive functions in breast cancer. Trends Cell Biol",
      "pubmed_id": "39547880",
      "year": "2025",
      "journal": "35(1):4-5",
      "authors": ""
    },
    {
      "title": "Maurin M, Ranjouri M, Megino-Luque C, Newberg JY, Du D, Martin K, Miner RE, Prater MS, Wee DKB, Centeno B, Pruett-Miller SM, Stewart P, Fleming JB, Yu X, Bravo-Cordero JJ, Guccione E, Black MA, Mann KM. RBFOX2 deregulation promotes pancreatic cancer progression and metastasis through alternative splicing. Nat Commun",
      "pubmed_id": "38114498",
      "pmc_id": "PMC10730836",
      "year": "2023",
      "journal": "14(1):8444",
      "authors": ""
    },
    {
      "title": "Vaishnavi A, Juan J, Jacob M, Stehn C, Gardner EE, Scherzer MT, Schuman S, van Veen JE, Murphy B, Hackett CS, Dupuy AJ, Chmura SA, van der Weyden L, Newberg JY, Liu A, Mann K, Rust AG, Weiss WA, Kinsey CG, Adams DJ, Grossmann A, Mann MB, McMahon M. Transposon Mutagenesis Reveals RBMS3 Silencing as a Promoter of Malignant Progression of BRAFV600E-Driven Lung Tumorigenesis. Cancer Res",
      "pubmed_id": "36112789",
      "pmc_id": "PMC9664136",
      "year": "2022",
      "journal": "82(22):4261-4273",
      "authors": ""
    },
    {
      "title": "Ho JS, Di Tullio F, Schwarz M, Low D, Incarnato D, Gay F, Tabaglio T, Zhang J, Wollmann H, Chen L, An O, Chan THM, Hall Hickman A, Zheng S, Roudko V, Chen S, Karz A, Ahmed M, He HH, Greenbaum BD, Oliviero S, Serresi M, Gargiulo G, Mann KM, Hernando E, Mulholland D, Marazzi I, Wee DKB, Guccione E. HNRNPM controls circRNA biogenesis and splicing fidelity to sustain cancer cell fitness. Elife",
      "pubmed_id": "34075878",
      "pmc_id": "PMC8346284",
      "year": "2021",
      "journal": "10",
      "authors": ""
    },
    {
      "title": "Aiderus A, Contreras-Sandoval AM, Meshey AL, Newberg JY, Ward JM, Swing DA, Copeland NG, Jenkins NA, Mann KM, Mann MB. Promoterless Transposon Mutagenesis Drives Solid Cancers via Tumor Suppressor Inactivation. Cancers (Basel)",
      "pubmed_id": "33435458",
      "pmc_id": "PMC7827284",
      "year": "2021",
      "journal": "13(2)",
      "authors": ""
    },
    {
      "title": "Aiderus A, Newberg JY, Guzman-Rojas L, Contreras-Sandoval AM, Meshey AL, Jones DJ, Amaya-Manzanares F, Rangel R, Ward JM, Lee SC, Ban KH, Rogers K, Rogers SM, Selvanesan L, McNoe LA, Copeland NG, Jenkins NA, Tsai KY, Black MA, Mann KM, Mann MB. Transposon mutagenesis identifies cooperating genetic drivers during keratinocyte transformation and cutaneous squamous cell carcinoma progression. PLoS Genet",
      "pubmed_id": "34398873",
      "pmc_id": "PMC8389471",
      "year": "2021",
      "journal": "17(8):e1009094",
      "authors": ""
    },
    {
      "title": "Newberg JY, Black MA, Jenkins NA, Copeland NG, Mann KM, Mann MB. SB Driver Analysis: a Sleeping Beauty cancer driver analysis framework for identifying and prioritizing experimentally actionable oncogenes and tumor suppressors. Nucleic Acids Res",
      "pubmed_id": "29846651",
      "pmc_id": "PMC6144815",
      "year": "2018",
      "journal": "46(16):e94",
      "authors": ""
    },
    {
      "title": "Newberg JY, Mann KM, Mann MB, Jenkins NA, Copeland NG. SBCDDB: Sleeping Beauty Cancer Driver Database for gene discovery in mouse models of human cancers. Nucleic Acids Res",
      "pubmed_id": "29059366",
      "pmc_id": "PMC5753260",
      "year": "2018",
      "journal": "46(D1):D1011-D1017",
      "authors": ""
    },
    {
      "title": "Mann KM, Newberg JY, Black MA, Jones DJ, Amaya-Manzanares F, Guzman-Rojas L, Kodama T, Ward JM, Rust AG, van der Weyden L, Yew CC, Waters JL, Leung ML, Rogers K, Rogers SM, McNoe LA, Selvanesan L, Navin N, Jenkins NA, Copeland NG, Mann MB. Analyzing tumor heterogeneity and driver genes in single myeloid leukemia cells with SBCapSeq. Nat Biotechnol",
      "pubmed_id": "27479497",
      "pmc_id": "PMC6124494",
      "year": "2016",
      "journal": "34(9):962-972",
      "authors": ""
    }
  ],
  "grants": [
    {
      "description": "Title: MBNL1 is a latent tumor suppressor in pancreatic cancer metastasis  \nAward Number:   \nSponsor: Foundation Support-Rsch  \nMann, K. (PD/PI)",
      "source": "Foundation"
    },
    {
      "description": "Title: RBFOX2 deregulation promotes pancreatic cancer progression through alternative splicing  \nAward Number: 1R01CA279713-01  \nSponsor: National Cancer Institute (NCI)  \nMann, K. (PD/PI)",
      "source": "NCI",
      "period": "9713-01"
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/MannKaren_17771.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=17771"
  },
  "content_hash": "0a450f47ff6d90a3512ce321c2db8f3dbf4e89c5bb3844149ff8bc1abc09ee5f",
  "researcher_name": "Karen Mann",
  "department": "Molecular Oncology"
}