{
  "profile_url": "https://www.moffitt.org/research-science/researchers/lynn-moscinski/",
  "last_updated": "2025-11-21T22:50:25.478350",
  "researcher_id": "1583",
  "degrees": [
    "MD"
  ],
  "title": "",
  "primary_program": "pathology",
  "research_program": "molecular medicine",
  "overview": "Dr. Moscinski’s clinical and research interests have centered in the areas of leukemia and myelodysplasia, exemplified by her publications and participation in numerous clinical trials.",
  "research_interests": [
    "Hematopathologists continue to play an important role in the discovery and implementation of biomarker driven diagnosis and development of biomarker driven prognostic models. The development of molecular diagnostic strategies in patients with hematopoietic neoplasms developed as an early off shoot of studies aimed at understanding basic cellular mechanisms. As a hematopathologist, Dr. Moscinski was trained in the biology of hematologic neoplasms, the application of technology to diagnosis, and the need for high level quality assurance and clinical grade controls in development of diagnostic assays. The translation of polymerase chain reaction (PCR) and sequencing methodologies to the emerging molecular diagnostics field required both an understanding of patient and treating physician needs, bone marrow and lymph node histology, and basic molecular pathways and techniques, so-called “bench to bedside” translation. Her laboratory was instrumental in the development of several molecular assays used in the detection of minimal residual disease (MRD) in patients with hematopoietic neoplasms. These assays were among the fore runners of modern molecular diagnostic strategies in use today. Dr. Moscinski’s recent work focuses on developing clinical grade molecular and flow cytometry based assays, in a CLIA environment, to support clinical investigators and clinical treatment trials for patients with hematologic malignancies. As department Chair and Director of the clinical laboratories (including molecular diagnostics), her responsibilities include assuring the coordination and smooth translation of new biomarker studies into clinical research and guiding a team of hematopathologists in the implementation and development of new strategies.\n  *"
  ],
  "associations": [
    "Pathology",
    "Experimental Therapeutics Program",
    "Molecular Medicine Program"
  ],
  "education": [
    {
      "type": "Medical School",
      "institution": "Medical College of Wisconsin",
      "degree": "MD"
    },
    {
      "type": "Residency",
      "institution": "University of Colorado",
      "specialty": "Anatomic and Clinical Pathology"
    },
    {
      "type": "Fellowship",
      "institution": "Hospital of the University of Pennsylvania",
      "specialty": "Hematopathology"
    }
  ],
  "publications": [
    {
      "title": "Comparison of the clinicopathological features in myeloproliferative or myelodysplastic neoplasms with SF3B1/JAK2, SF3B1/CALR, or SF3B1/MPL co-mutations",
      "pubmed_id": "41074577",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Shao R, Wang L, Zhang H, Martin M, Moscinski L, Li A, Li J, Song J",
      "journal": "Leuk Lymphoma"
    },
    {
      "title": "Current Advances in the Diagnosis and Treatment of Major Myeloproliferative Neoplasms",
      "pubmed_id": "40507313",
      "pmc_id": "PMC12153907",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Wang L, Li J, Arbitman L, Zhang H, Shao H, Martin M, Moscinski L, Song J",
      "journal": "Cancers (Basel)"
    },
    {
      "title": "Molecular landscape and clinical outcome of SRSF2/TET2 Co-mutated myeloid neoplasms",
      "pubmed_id": "39611281",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Cockey SG, Zhang H, Hussaini M, Zhang L, Moscinski L, Yang E, Li J, Wang L, Song J",
      "journal": "Leuk Lymphoma"
    },
    {
      "title": "Discordant pathologic diagnoses of myelodysplastic neoplasms and their implications for registries and therapies",
      "pubmed_id": "37552083",
      "pmc_id": "PMC10582385",
      "year": "2023",
      "publication_date": "2023 Oct",
      "authors": "Gorak E, Otterstatter M, Al Baghdadi T, Gillis N, Foran JM, Liu JJ, Bejar R, Gore SD, Kroft SH, Harrington AM, Saber W, Starczynowski DT, Rollison DE, Zhang L, Moscinski LC, Wilson SH, Thompson J, Borchert C, Sherman S, Hebert D, Walker ME, Padron E, DeZern A, Sekeres MA",
      "journal": "Blood Adv"
    },
    {
      "title": "Review and Updates on Systemic Mastocytosis and Related Entities",
      "pubmed_id": "38067330",
      "year": "2023",
      "publication_date": "2023 Nov",
      "authors": "Li JY, Ryder CB, Zhang H, Cockey SG, Hyjek E, Moscinski LC, Sagatys E, Song J",
      "journal": "Cancers (Basel)"
    },
    {
      "title": "Co-mutation of ASXL1 and SF3B1 Predicts Poorer Overall Survival Than Isolated ASXL1 or SF3B1 Mutations",
      "pubmed_id": "37103105",
      "pmc_id": "PMC10188047",
      "year": "2023",
      "publication_date": "2023 May",
      "authors": "Song J, Moscinski L, Yang E, Shao H, Hussaini M, Zhang H",
      "journal": "In Vivo"
    },
    {
      "title": "Clinical Response to Upfront Targeted Tyrosine Kinase Inhibitors among Patients with Myeloid/Lymphoid Neoplasms with Eosinophilia and Tyrosine Kinase Gene Fusion",
      "pubmed_id": "36624015",
      "year": "2023",
      "publication_date": "2023 Mar",
      "authors": "Zhang Y, Nguyen L, Lu CM, Wang E, Lauw MIS, Ball S, Dong N, Moscinski L, Chan O, Yun S, Sallman D, Sokol L, Shah B, Knepper T, Lancet J, Komrokji R, Padron E, Kuykendall A, Zhang L",
      "journal": "Clin Lymphoma Myeloma Leuk"
    },
    {
      "title": "Clinicopathologic characteristics, genetic features, and treatment options for acute lymphoblastic leukemia with JAK2 rearrangement-A 10-case study and literature review",
      "pubmed_id": "36958463",
      "year": "2023",
      "publication_date": "2023 Jun",
      "authors": "Zhang L, Shah B, Zhang Y, Tashkandi H, Xiao W, Fernandez-Pol S, Vergara-Lluri M, Hussaini M, Song J, Lancet J, Moscinski L, Yun S, Lu CM, Medeiros LJ, Tang G",
      "journal": "Hum Pathol"
    },
    {
      "title": "Case report: Co-existing chronic myeloid leukemia and chronic myelomonocytic leukemia-A clinically important but challenging scenario",
      "pubmed_id": "37415731",
      "pmc_id": "PMC10319893",
      "year": "2023",
      "publication_date": "2023 Jun",
      "authors": "Song J, Moscinski L, Zhang L, Zhang H",
      "journal": "Leuk Res Rep"
    },
    {
      "title": "Incidental Gastric Langerhans Cell Histiocytosis and Synchronous Adenocarcinoma of the Colon: An Interesting Case Report and Literature Review",
      "pubmed_id": "36632587",
      "pmc_id": "PMC9801445",
      "year": "2023",
      "publication_date": "2023 Jan",
      "authors": "Mora LB, Hough M, Moscinski L, Gomez J, Coppola D",
      "journal": "Cancer Diagn Progn"
    }
  ],
  "grants": [],
  "participating_trials": [],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/MoscinskiLynn_1583.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=1583"
  },
  "content_hash": "173e83735fd376cc356005f1044033f7c889428e41a7d5878fc8ed7b89d06f90",
  "researcher_name": "lynn moscinski",
  "department": ""
}