{
  "profile_url": "https://www.moffitt.org/research-science/researchers/marilyn-stern/",
  "last_updated": "2025-11-21T22:50:25.586883",
  "researcher_id": "12881",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "",
  "research_program": "health outcomes & behavior",
  "overview": "",
  "research_interests": [
    "Dr. Stern’s primary professional focus in pediatric psychosocial oncology has been in children and adolescents with cancer, communication, and transition to survivorship; developing interventions to reduce childhood and adolescent obesity, and the vulnerable child syndrome. Dr. Stern has been recognized for her scholarship and has been: elected Fellow of the American Psychological Association (Divisions 38, 54 and 17), recipient of the Dorothy Booz Black Award for Outstanding Scholarship in Counseling Health Psychology, named an Outstanding Alumni, University at Buffalo Graduate School and was twice awarded a senior Fulbright scholarship for international work and named a 2014 Lady Davis fellow. Dr. Stern also regularly teaches research methods, health psychology and does clinical supervision at the graduate level and has chaired or served as a member on over 70 students’ thesis and dissertations. Dr. Stern leads an active lab: Interventions for Health-promotion in Oncology and Obesity in Pediatrics (I-HOPE) and is currently leading several grants from the National Institutes of Health to support her intervention work in pediatric psychosocial oncology and obesity. 1) R01CA240319-01A1 -- to conduct a randomized control trial to test the efficacy of our intervention, NOURISH-T+, across a diverse sample of pediatric cancer survivors and their parents at multiple pediatric oncology clinics, with the goal of establishing a framework for future translation and dissemination of NOURISHT+; 2) R34AT010661-01 -- to refine and test the acceptability and feasibility of a culturally competent, evidence-based, community-centered obesity intervention, ADAPT+, to address obesity in Latino youth living in rural communities and 3) 3R34AT010661-02S1—to assess COVID-19 testing and vaccine uptake attitudes and behaviors among rural Latino migrants in Southwest Florida. Dr. Stern is also involved in several other grant projects as a co-Investigator, all related to pediatric oncology and obesity. https://protect-us.mimecast.com/s/XfMUCjRA7rh9ln1vc5javQ?domain=usf.edu) https://protect-us.mimecast.com/s/66cWCgJ71oTkPA57FoRNeg?domain=ncbi.nlm.nih.gov). \n  *"
  ],
  "associations": [
    "Health Outcomes & Behavior Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "State University of New York at Buffalo, PhD"
    },
    {
      "type": "Fellowship",
      "institution": "Roswell Park Cancer Institute",
      "specialty": "Health Psychology"
    }
  ],
  "publications": [
    {
      "title": "Factors impacting physical activity among post-treatment pediatric cancer survivors with overweight and obesity",
      "pubmed_id": "38668797",
      "year": "2024",
      "publication_date": "2024 Jul",
      "authors": "Brown NI, Sauls R, Almendares M, Gray HL, Stern M",
      "journal": "Eur J Pediatr"
    },
    {
      "title": "Quality of life in the digital age: young adult hematopoietic stem cell transplantation patients and healthcare providers' views of telehealth",
      "pubmed_id": "38578444",
      "year": "2024",
      "publication_date": "2024 Apr",
      "authors": "Sauls R, Crowder SL, James C, Khimani F, Stern M",
      "journal": "Support Care Cancer"
    },
    {
      "title": "Multi-Level Determinants of Food Insecurity among Racially and Ethnically Diverse College Students",
      "pubmed_id": "37764847",
      "pmc_id": "PMC10535142",
      "year": "2023",
      "publication_date": "2023 Sep",
      "authors": "Brown NI, Buro AW, Jones R, Himmelgreen D, Dumford AD, Conner K, Stern M, DeBate R",
      "journal": "Nutrients"
    },
    {
      "title": "Mediators of Social Acceptance Among Emerging Adult Survivors of Childhood Cancer",
      "pubmed_id": "36795980",
      "pmc_id": "PMC10611963",
      "year": "2023",
      "publication_date": "2023 Oct",
      "authors": "Crowder SL, Foster RH, Buro AW, Dillon R, Godder K, Stern M",
      "journal": "J Adolesc Young Adult Oncol"
    },
    {
      "title": "Qualitative assessment of uptake retention and evaluation of prevention materials for skin cancer among Hispanics",
      "pubmed_id": "37028174",
      "pmc_id": "PMC10164708",
      "year": "2023",
      "publication_date": "2023 Jul",
      "authors": "Crowder SL, Buro AW, Lacson JCA, Del Rio J, Kim Y, Roetzheim RG, Sutton SK, Vadaparampil ST, Soto-Torres B, Stern M, Kanetsky PA",
      "journal": "Patient Educ Couns"
    },
    {
      "title": "The Lived Experience of Young Adult Cancer Survivors after Treatment: A Qualitative Study",
      "pubmed_id": "37513563",
      "pmc_id": "PMC10385438",
      "year": "2023",
      "publication_date": "2023 Jul",
      "authors": "Crowder SL, Sauls R, Gudenkauf LM, James C, Skinner A, Reed DR, Stern M",
      "journal": "Nutrients"
    },
    {
      "title": "Lifestyle Interventions with Mind-Body or Stress-Management Practices for Cancer Survivors: A Rapid Review",
      "pubmed_id": "36834048",
      "pmc_id": "PMC9964062",
      "year": "2023",
      "publication_date": "2023 Feb",
      "authors": "Buro AW, Crowder SL, Rozen E, Stern M, Carson TL",
      "journal": "Int J Environ Res Public Health"
    },
    {
      "title": "Challenges and adaptations for a cluster-randomized control trial targeting parents of pediatric cancer survivors with obesity during the COVID-19 pandemic",
      "pubmed_id": "36327379",
      "pmc_id": "PMC9972348",
      "year": "2023",
      "publication_date": "2023 Feb",
      "authors": "Buro AW, Gray HL, Ruble K, Soca Lozano S, Sauls R, Albizu-Jacob A, Crowder SL, Mazzeo SE, Stern M",
      "journal": "Transl Behav Med"
    },
    {
      "title": "Nutritional status and body mass index before hematopoietic stem cell transplantation (HSCT) and associated outcomes: a rapid review",
      "pubmed_id": "38129689",
      "year": "2023",
      "publication_date": "2023 Dec",
      "authors": "Sauls R, Buro AW, Montgomery L, Stern M, Khimani F, Crowder SL",
      "journal": "Support Care Cancer"
    },
    {
      "title": "Infection risk among long-term pediatric cancer survivors: conceptual framework for health promotion and call for inquiry",
      "pubmed_id": "38197099",
      "pmc_id": "PMC10772843",
      "year": "2023",
      "publication_date": "2023 Dec",
      "authors": "Buro AW, Stern M",
      "journal": "Transl Pediatr"
    }
  ],
  "grants": [],
  "participating_trials": [],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers/SternMarilyn_12881.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=12881"
  },
  "content_hash": "dd406c5d23e884f1de05e719834e264f230003b1a55b328a2fbc17a06089e012",
  "researcher_name": "marilyn stern",
  "department": ""
}