{
  "profile_url": "https://www.moffitt.org/research-science/researchers/mark-ji",
  "last_updated": "2025-10-21T16:37:04.895264",
  "researcher_id": "17534",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "Drug Discovery",
  "research_program": "Molecular Medicine Program",
  "overview": "The Ji research laboratory focuses on rational design and development of potent and selective small-molecule inhibitors for protein–protein interactions (PPIs). To achieve this goal, we examine the crystal structures of PPI complex structures and design scaffolds to mimic key binding features of the ligand proteins to initiate the research. Our areas of research include developing new technologies to design and characterize PPI inhibitors, designing and synthesizing potent and selective inhibitors for important PPI targets, and developing PPI inhibitors into candidates ready for in vivo studies. This synthetic medicinal chemistry laboratory has three research components: data mining and structure-based drug design, synthetic organic chemistry, and biochemistry and cell-based studies.",
  "research_interests": [
    "Developing a new class of α-helix mimetics called binding-mode α-helical hot spot mimetics. Generalizable scaffolds that mimic α-helical hot spots can greatly facilitate medicinal chemistry to discover drug-like potent inhibitors for α-helix mediated PPIs. Previous studies from Ji laboratory observed the side chains of hydrophobic α-helical hot spots are convergent to the limited spatial areas when forming PPI complex structures. This observation allows us to develop a new class of α-helix mimetics, binding-mode α-helical hot spot mimetics. Developing first-in-class small-molecule antagonists for the β-catenin/B-cell lymphoma 9 (BCL9) protein–protein interaction (PPI). Hyperactive β-catenin signaling is a cancer hallmark and plays an important role in cancer recurrence, metastasis, and immune evasion. Disruption of β-catenin/BCL9 PPI to abolish hyperactive β-catenin signaling has great therapeutic potential. BCL9 or BCL9L uses an α-helical domain to bind to β-catenin. We have been collaborating with other Moffitt researchers to develop first-in-class small-molecule preclinical candidates for the disruption of β-catenin/BCL9 PPI. Developing cell-permeable phosphotyrosine mimetics. Protein tyrosine phosphorylation is a key molecular mechanism to regulate intracellular signaling. Aberrant activation of phosphotyrosine signaling plays a key role in many pathological processes. Peptides, peptidomimetics, and small molecules have been developed to bind with the pTyr-binding pockets with the goal to regulate intracellular phophotyrosine-binding domains. However, all of them display low cell permeability, which is mainly caused by the highly polar and negatively charged phosphate or phosphate-like groups. We are developing novel cell-permeable phosphotyrosine mimetics.\n  *"
  ],
  "associations": [
    "Breast Oncology",
    "Drug Discovery",
    "Molecular Medicine Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "Second Military Medical University, PhD"
    },
    {
      "type": "Fellowship",
      "institution": "Northwestern University",
      "specialty": "Chemistry"
    }
  ],
  "publications": [
    {
      "title": "Fragment hopping protocol for the design of small-molecule protein-protein interaction inhibitors",
      "pubmed_id": "35749838",
      "year": "2022",
      "publication_date": "2022 Sep",
      "authors": "Kell SR, Wang Z, Ji H",
      "journal": "Bioorg Med Chem"
    },
    {
      "title": "Common Structural Features of Hydrophobic α-Helical Hot Spots: Insights for the Design of Novel α-Helix Mimetics",
      "pubmed_id": "36262397",
      "pmc_id": "PMC9575182",
      "year": "2022",
      "publication_date": "2022 Oct",
      "authors": "Kell SR, Wang Z, Ji H",
      "journal": "ACS Med Chem Lett"
    },
    {
      "title": "New ZW4864 Derivatives as Small-Molecule Inhibitors for the β-Catenin/BCL9 Protein-Protein Interaction",
      "pubmed_id": "35586435",
      "pmc_id": "PMC9109161",
      "year": "2022",
      "publication_date": "2022 May",
      "authors": "Wang Z, Zhang M, Thompson HM, Ji H",
      "journal": "ACS Med Chem Lett"
    },
    {
      "title": "Characterization of Hydrophilic α-Helical Hot Spots on the Protein-Protein Interaction Interfaces for the Design of α-Helix Mimetics",
      "pubmed_id": "35385659",
      "year": "2022",
      "publication_date": "2022 Apr",
      "authors": "Wang Z, Ji H",
      "journal": "J Chem Inf Model"
    },
    {
      "title": "Preclinical evaluation of [225Ac]Ac-DOTA-TATE for treatment of lung neuroendocrine neoplasms",
      "pubmed_id": "33772332",
      "year": "2021",
      "publication_date": "2021 Oct",
      "authors": "Tafreshi NK, Pandya DN, Tichacek CJ, Budzevich MM, Wang Z, Reff JN, Engelman RW, Boulware DC, Chiappori AA, Strosberg JR, Ji H, Wadas TJ, El-Haddad G, Morse DL",
      "journal": "Eur J Nucl Med Mol Imaging"
    },
    {
      "title": "Synthesis and structural characterization of a monocarboxylic inhibitor for GRB2 SH2 domain",
      "pubmed_id": "34506932",
      "pmc_id": "PMC8526398",
      "year": "2021",
      "publication_date": "2021 Nov",
      "authors": "Xiao T, Sun L, Zhang M, Li Z, Haura EB, Schonbrunn E, Ji H",
      "journal": "Bioorg Med Chem Lett"
    },
    {
      "title": "Discovery of 2-(3-(3-Carbamoylpiperidin-1-yl)phenoxy)acetic Acid Derivatives as Novel Small-Molecule Inhibitors of the β-Catenin/B-Cell Lymphoma 9 Protein-Protein Interaction",
      "pubmed_id": "33902288",
      "year": "2021",
      "publication_date": "2021 May",
      "authors": "Wang Z, Zhang M, Luo W, Zhang Y, Ji H",
      "journal": "J Med Chem"
    },
    {
      "title": "Direct targeting of β-catenin in the Wnt signaling pathway: Current progress and perspectives",
      "pubmed_id": "33475177",
      "pmc_id": "PMC8217106",
      "year": "2021",
      "publication_date": "2021 Jul",
      "authors": "Wang Z, Li Z, Ji H",
      "journal": "Med Res Rev"
    },
    {
      "title": "Discovery of 1-Benzoyl 4-Phenoxypiperidines as Small-Molecule Inhibitors of the β-Catenin/B-Cell Lymphoma 9 Protein-Protein Interaction",
      "pubmed_id": "34270257",
      "year": "2021",
      "publication_date": "2021 Aug",
      "authors": "Li Z, Zhang M, Teuscher KB, Ji H",
      "journal": "J Med Chem"
    },
    {
      "title": "Discovery of an Orally Bioavailable Small-Molecule Inhibitor for the β-Catenin/B-Cell Lymphoma 9 Protein-Protein Interaction",
      "pubmed_id": "34382808",
      "pmc_id": "PMC8817233",
      "year": "2021",
      "publication_date": "2021 Aug",
      "authors": "Wang Z, Zhang M, Quereda V, Frydman SM, Ming Q, Luca VC, Duckett DR, Ji H",
      "journal": "J Med Chem"
    }
  ],
  "grants": [
    {
      "description": "Title: Developing a First-in-Class -Catenin/BCL9 PPI Inhibitor  \nAward Number: 21-0038-S1, Work Plan No. 1, Amendment 2  \nSponsor: BAYFIELD THERAPEUTICS, LLC  \nJi, H. (PD/PI), Duckett, D. (Co-PD/PI)",
      "title": "Developing a First-in-Class -Catenin/BCL9 PPI Inhibitor",
      "award_number": "21-0038-S1, Work Plan No. 1, Amendment 2",
      "sponsor": "BAYFIELD THERAPEUTICS, LLC",
      "investigators": [
        {
          "name": "Ji, H.",
          "role": "PD/PI"
        },
        {
          "name": "Duckett, D.",
          "role": "Co-PD/PI"
        }
      ]
    },
    {
      "description": "Title: Developing GRB2-PROTACs for Treatment of Lung Cancer  \nAward Number: 1R21CA267283-02  \nSponsor: National Cancer Institute (NCI)  \nJi, H. (PD/PI)",
      "title": "Developing GRB2-PROTACs for Treatment of Lung Cancer",
      "award_number": "1R21CA267283-02",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Ji, H.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Orexin receptor agonist discovery for development of colon cancer targeted alpha particle therapy  \nAward Number: NA  \nSponsor: Foundation Support-Rsch  \nDuckett, D. (PD/PI), Ji, H. (PD/PI), Morse, D. (PD/PI)",
      "title": "Orexin receptor agonist discovery for development of colon cancer targeted alpha particle therapy",
      "award_number": "NA",
      "sponsor": "Foundation Support-Rsch",
      "source": "Foundation",
      "investigators": [
        {
          "name": "Duckett, D.",
          "role": "PD/PI"
        },
        {
          "name": "Ji, H.",
          "role": "PD/PI"
        },
        {
          "name": "Morse, D.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/JiMark_17534.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=17534"
  },
  "content_hash": "7e0ccb6507484c6b0ef23426142ee77854f3e0c877220075226094bfe4827c0f",
  "researcher_name": "Mark Ji",
  "department": "Drug Discovery"
}