{
  "profile_url": "https://www.moffitt.org/research-science/researchers/mark-robertson-tessi",
  "last_updated": "2025-10-21T16:34:03.195271",
  "researcher_id": "unknown",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "Integrated Mathematical Oncology",
  "research_program": "Cancer Biology & Evolution Program",
  "overview": "My research focuses on the integration of mathematical modeling with both experimental and clinical data to deepen our understanding of the dynamic mechanisms at work in cancer. A primary goal of these efforts is to develop decision support tools that leverage longitudinal data to guide personalized therapy.",
  "research_interests": [
    "1) Dynamic clinical decision support frameworks for implementing evolutionary therapies. Many challenges exist to implementing a real-time decision support framework based on large data sets and mathematical modeling. I have been tackling aspects of this problem since my first year at Moffitt, when I helped develop a decision support tool for undetectable breast cancer metastases in the inaugural IMO workshop. More recently, the opportunity to implement these ideas in the clinic became reality with the clinical trial for the Evolutionary Tumor Board (ETB), where mathematical modeling and data analysis are used to generate predictions of patient response to available treatment options. My role in the ETB, which has been enrolling patients since 2020, was to develop and implement novel techniques for using both individual and cohort patient data to predict treatment response and identify alternative optimal strategies for patients. To date, we have enrolled 21 patients in the trial and have developed many novel methods that will serve as the foundation for upcoming evolutionary therapy trials. We are in the process of submitting the first two papers on the ETB, and the approach is extending into a number of new trials in this space, including a multi-institution ETB for pediatric cancers (MCC 22170) of which I am co-PI with Jonathan Metts. 2) Tumor-immune interactions and immunotherapies. Starting with my Ph.D. research and continuing at Moffitt, I have studied the dynamics of immune cells and associated signaling molecules in response to a growing tumor. The complex and dual-edged nature of the immune response, with its pro- and anti-tumor elements, leads to a rich landscape of interactions that benefits from mathematical modeling approaches. Across several diverse tumor-immune models, the repeated observation of personalized “Goldilocks windows” of immunotherapy suggests that there is room to improve the delivery of such treatments in the clinic. 3) Phenotypic heterogeneity, natural selection, and the tumor microenvironment. My major project upon starting as a postdoc was developing a detailed and calibrated mechanistic model of vascular tumor growth, in the context of aerobic glycolysis and acid-mediated invasion. The model included evolving cellular metabolism and a dynamic microenvironment. This work drew upon the interdisciplinary knowledge and data being generated by Moffitt’s Physical Sciences in Oncology U54 center grant. The model predicted many interesting and unintuitive phenomena that were subsequently validated in parallel experimental systems. Several additional studies extended and adapted this model, leading the conceptualization and development of a model-building platform (Hybrid Automata Library, aka HAL) that is now being used in the wider mathematical oncology field. In addition, the model was the basis of the ‘Cancer Crusade’ mobile game, an NIH funded citizen-science initiative that led to a subsequent collaboration with Lawrence Livermore National Laboratory, where we used machine learning approaches to identify optimal treatment policies for patient cohorts.\n  *"
  ],
  "associations": [
    "Integrated Mathematical Oncology",
    "Cancer Biology & Evolution Program"
  ],
  "education": [],
  "publications": [
    {
      "title": "Evolutionary double-bind treatment using radiotherapy and NK cell-based immunotherapy in prostate cancer",
      "pubmed_id": "40998270",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Luddy KA, West J, Robertson-Tessi M, Desai B, Ojeda A, Newman H, Estrella V, Bursell TM, Barrett S, O'Sullivan J, Marignol L, Gatenby RA, Brown JS, Anderson AR, O'Farrelly C",
      "journal": "Int J Radiat Oncol Biol Phys"
    },
    {
      "title": "Mathematical Oncology: How Modeling Is Transforming Clinical Decision Making",
      "pubmed_id": "41105675",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Scibilia KR, Gallagher K, Masud MA, Robertson-Tessi M, Gatenbee CD, West J, Llamas P, Prabhakaran S, Gallaher J, Anderson ARA",
      "journal": "Cancer Res"
    },
    {
      "title": "Pediatric Leukemia Roadmaps Are a Guide for Positive Metastatic Bone Sarcoma Trials",
      "pubmed_id": "38843482",
      "year": "2024",
      "publication_date": "2024 Sep",
      "authors": "Reed DR, Tulpule A, Metts J, Trucco M, Robertson-Tessi M, O'Donohue TJ, Iglesias-Cardenas F, Isakoff MS, Mauguen A, Shukla N, Dela Cruz FS, Tap W, Kentsis A, Morris CD, Hameed M, Honeyman JN, Behr GG, Sulis ML, Ortiz MV, Slotkin E",
      "journal": "J Clin Oncol"
    },
    {
      "title": "Roadmap for the next generation of Children's Oncology Group rhabdomyosarcoma trials",
      "pubmed_id": "38941509",
      "pmc_id": "PMC11511643",
      "year": "2024",
      "publication_date": "2024 Nov",
      "authors": "Metts JL, Aye JM, Crane JN, Oberoi S, Balis FM, Bhatia S, Bona K, Carleton B, Dasgupta R, Dela Cruz FS, Greenzang KA, Kaufman JL, Linardic CM, Parsons SK, Robertson-Tessi M, Rudzinski ER, Soragni A, Stewart E, Weigel BJ, Wolden SL, Weiss AR, Venkatramani R, Heske CM",
      "journal": "Cancer"
    },
    {
      "title": "To modulate or to skip: De-escalating PARP inhibitor maintenance therapy in ovarian cancer using adaptive therapy",
      "pubmed_id": "38772367",
      "pmc_id": "PMC11190943",
      "year": "2024",
      "publication_date": "2024 Jun",
      "authors": "Strobl MAR, Martin AL, West J, Gallaher J, Robertson-Tessi M, Gatenby R, Wenham R, Maini PK, Damaghi M, Anderson ARA",
      "journal": "Cell Syst"
    },
    {
      "title": "Tumor-immune metaphenotypes orchestrate an evolutionary bottleneck that promotes metabolic transformation",
      "pubmed_id": "38426105",
      "pmc_id": "PMC10902449",
      "year": "2024",
      "publication_date": "2024 Feb",
      "authors": "West J, Rentzeperis F, Adam C, Bravo R, Luddy KA, Robertson-Tessi M, Anderson ARA",
      "journal": "Front Immunol"
    },
    {
      "title": "Treatment of evolving cancers will require dynamic decision support",
      "pubmed_id": "37777307",
      "year": "2023",
      "publication_date": "2023 Oct",
      "authors": "Strobl MAR, Gallaher J, Robertson-Tessi M, West J, Anderson ARA",
      "journal": "Ann Oncol"
    },
    {
      "title": "Modeling phenotypic heterogeneity towards evolutionarily inspired osteosarcoma therapy",
      "pubmed_id": "37978271",
      "pmc_id": "PMC10656496",
      "year": "2023",
      "publication_date": "2023 Nov",
      "authors": "Welch DL, Fridley BL, Cen L, Teer JK, Yoder SJ, Pettersson F, Xu L, Cheng CH, Zhang Y, Alexandrow MG, Xiang S, Robertson-Tessi M, Brown JS, Metts J, Brohl AS, Reed DR",
      "journal": "Sci Rep"
    },
    {
      "title": "A survey of open questions in adaptive therapy: Bridging mathematics and clinical translation",
      "pubmed_id": "36952376",
      "pmc_id": "PMC10036119",
      "year": "2023",
      "publication_date": "2023 Mar",
      "authors": "West J, Adler F, Gallaher J, Strobl M, Brady-Nicholls R, Brown J, Robertson-Tessi M, Kim E, Noble R, Viossat Y, Basanta D, Anderson ARA",
      "journal": "Elife"
    },
    {
      "title": "Adaptive therapy for ovarian cancer: An integrated approach to PARP inhibitor scheduling",
      "pubmed_id": "36993591",
      "pmc_id": "PMC10055330",
      "year": "2023",
      "publication_date": "2023 Mar",
      "authors": "Strobl M, Martin AL, West J, Gallaher J, Robertson-Tessi M, Gatenby R, Wenham R, Maini P, Damaghi M, Anderson A",
      "journal": "bioRxiv"
    }
  ],
  "grants": [
    {
      "description": "Title: Creating a digitally enabled clinical R&D platform to delivery precision medicine adaptable to every-changing patient conditions in real-world practice  \nAward Number: 24-0147-AR  \nSponsor: MITSUI & CO. (USA), INC  \nAnderson, A. (PD/PI), Gatenby, R. (Co-PD/PI), Robertson-Tessi, M. (Co-PD/PI)",
      "title": "Creating a digitally enabled clinical R&D platform to delivery precision medicine adaptable to every-changing patient conditions in real-world practice",
      "award_number": "24-0147-AR",
      "sponsor": "MITSUI & CO. (USA), INC",
      "investigators": [
        {
          "name": "Anderson, A.",
          "role": "PD/PI"
        },
        {
          "name": "Gatenby, R.",
          "role": "Co-PD/PI"
        },
        {
          "name": "Tessi, M.",
          "role": "Co-PD/PI"
        }
      ]
    },
    {
      "description": "Title: Feasibility of Generating Novel Translational and Therapeutic Strategies based on a Multicenter, Pediatric and AYA Evolutionary Tumor Board; pedsETB  \nAward Number: 23L11  \nSponsor: Florida Department of Health  \nMetts, J. (PD/PI), Anderson, A. (Co-PD/PI), Brown, J. (Co-PD/PI), Marusyk, A. (Co-PD/PI), Robertson-Tessi, M. (Co-PD/PI)",
      "title": "Feasibility of Generating Novel Translational and Therapeutic Strategies based on a Multicenter, Pediatric and AYA Evolutionary Tumor Board; pedsETB",
      "award_number": "23L11",
      "sponsor": "Florida Department of Health",
      "investigators": [
        {
          "name": "Metts, J.",
          "role": "PD/PI"
        },
        {
          "name": "Anderson, A.",
          "role": "Co-PD/PI"
        },
        {
          "name": "Brown, J.",
          "role": "Co-PD/PI"
        },
        {
          "name": "Marusyk, A.",
          "role": "Co-PD/PI"
        },
        {
          "name": "Tessi, M.",
          "role": "Co-PD/PI"
        }
      ]
    }
  ],
  "photo_url": "",
  "contact": {},
  "content_hash": "4dbda17f9e3a5366bb2959a6c2046a8e57cef9a6eb4a5c6e76dd0c88d8c9260e",
  "researcher_name": "Mark Robertson Tessi",
  "department": "Integrated Mathematical Oncology"
}