{
  "profile_url": "https://www.moffitt.org/research-science/researchers/martina-molgora",
  "last_updated": "2025-10-21T16:40:19.255129",
  "researcher_id": "39484",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "Immunology",
  "research_program": "Immuno-Oncology Program",
  "overview": "My main interest is the orchestration of the innate immune response in tumors, with a focus on myeloid cells as key players in immune evasion. I aim to investigate the role of innate immune cells in both resistance and response to therapy, elucidating their intricate interactions within the tumor microenvironment. My ultimate goal is to identify novel therapeutic targets and strategies to enhance treatment efficacy.",
  "research_interests": [
    "Identity and function of TREM2 macrophages in tumors: During my postdoctoral research, I identified TREM2 as a marker of immunosuppressive macrophages in tumors. I found that TREM2 blockade promotes tumor control and response to therapy and is associated with a beneficial immune response. I now aim at understanding the mechanism and pathways by which TREM2 macrophages develop and accumulate in tumors, with the goal to identify strategies to prevent their expansion and therefore favor the anti-tumor immune response. Impact of soluble TREM2 in cancer: TREM2 is a transmembrane receptor highly expressed in tumor-associated macrophages. TREM2 can be cleaved and released as a soluble form, named soluble TREM2. The impact of soluble TREM2 in cancer is currently unknown. I aim at understanding the potential role of soluble TREM2 as a diagnostic, prognostic and therapeutic factor in different tumor types. I also aim at exploring the mechanisms by which soluble TREM2 might influence the tumor microenvironment. Influence of gut-trafficking cells on systemic immunity and distant-site tumors: Numerous studies have reported the impact of the gut environment on different conditions, although the underlying molecular mechanism still needs to be fully elucidated and multiple questions remain open regarding the interaction between the gut and immune responses at distant sites. Gut-resident cells can sense local signals from both microbes and other cells and represent a potential intermediary element between the gut and distant site organs. My goal is to explore the impact of gut-trafficking cells in tumors and in different physiological and pathological scenarios. \n  *"
  ],
  "associations": [
    "Immunology",
    "Gastrointestinal Oncology",
    "Immuno-Oncology Program"
  ],
  "education": [],
  "publications": [
    {
      "title": "Targeting brain macrophages: NF-κB as a therapeutic gateway in melanoma brain metastasis",
      "pubmed_id": "40068588",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Molgora M, Colonna M",
      "journal": "Cancer Cell"
    },
    {
      "title": "Amplification of autoimmune organ damage by NKp46-activated ILC1s",
      "pubmed_id": "39137897",
      "year": "2024",
      "publication_date": "2024 Oct",
      "authors": "Biniaris-Georgallis SI, Aschman T, Stergioula K, Schreiber F, Jafari V, Taranko A, Karmalkar T, Kasapi A, Lenac Rovis T, Jelencic V, Bejarano DA, Fabry L, Papacharalampous M, Mattiola I, Molgora M, Hou J, Hublitz KW, Heinrich F, Guerra GM, Durek P, Patone G, Lindberg EL, Maatz H, Hölsken O, Krönke G, Mortha A, Voll RE, Clarke AJ, Hauser AE, Colonna M, Thurley K, Schlitzer A, Schneider C, Stamatiades EG, Mashreghi MF, Jonjic S, Hübner N, Diefenbach A, Kanda M, Triantafyllopoulou A",
      "journal": "Nature"
    },
    {
      "title": "Comparing neoantigen cancer vaccines and immune checkpoint therapy unveils an effective vaccine and anti-TREM2 macrophage-targeting dual therapy",
      "pubmed_id": "39446585",
      "year": "2024",
      "publication_date": "2024 Nov",
      "authors": "Keshari S, Shavkunov AS, Miao Q, Saha A, Minowa T, Molgora M, Williams CD, Chaib M, Highsmith AM, Pineda JE, Alekseev S, Alspach E, Hu KH, Colonna M, Pauken KE, Chen K, Gubin MM",
      "journal": "Cell Rep"
    },
    {
      "title": "TREM2 deficiency reprograms intestinal macrophages and microbiota to enhance anti-PD-1 tumor immunotherapy",
      "pubmed_id": "38758808",
      "pmc_id": "PMC11299520",
      "year": "2024",
      "publication_date": "2024 May",
      "authors": "Di Luccia B, Molgora M, Khantakova D, Jaeger N, Chang HW, Czepielewski RS, Helmink BA, Onufer EJ, Fachi JL, Bhattarai B, Trsan T, Rodrigues PF, Hou J, Bando JK, da Silva CS, Cella M, Gilfillan S, Schreiber RD, Gordon JI, Colonna M",
      "journal": "Sci Immunol"
    },
    {
      "title": "Inositol phosphatase INPP4B sustains ILC1s and intratumoral NK cells through an AKT-driven pathway",
      "pubmed_id": "38197946",
      "pmc_id": "PMC10783437",
      "year": "2024",
      "publication_date": "2024 Mar",
      "authors": "Peng V, Trsan T, Sudan R, Bhattarai B, Cortez VS, Molgora M, Vacher J, Colonna M",
      "journal": "J Exp Med"
    },
    {
      "title": "At the Interface of Tumor-Associated Macrophages and Fibroblasts: Immune-Suppressive Networks and Emerging Exploitable Targets",
      "pubmed_id": "39311702",
      "year": "2024",
      "publication_date": "2024 Dec",
      "authors": "Timperi E, Croizer H, Khantakova D, Rana M, Molgora M, Guerriero JL, Mechta-Grigoriou F, Romano E",
      "journal": "Clin Cancer Res"
    },
    {
      "title": "TREM2 macrophages drive NK cell paucity and dysfunction in lung cancer",
      "pubmed_id": "37081148",
      "pmc_id": "PMC11088947",
      "year": "2023",
      "publication_date": "2023 May",
      "authors": "Park MD, Reyes-Torres I, LeBerichel J, Hamon P, LaMarche NM, Hegde S, Belabed M, Troncoso L, Grout JA, Magen A, Humblin E, Nair A, Molgora M, Hou J, Newman JH, Farkas AM, Leader AM, Dawson T, D'Souza D, Hamel S, Sanchez-Paulete AR, Maier B, Bhardwaj N, Martin JC, Kamphorst AO, Kenigsberg E, Casanova-Acebes M, Horowitz A, Brown BD, De Andrade LF, Colonna M, Marron TU, Merad M",
      "journal": "Nat Immunol"
    },
    {
      "title": "TREM2: A new player in the tumor microenvironment",
      "pubmed_id": "36989543",
      "year": "2023",
      "publication_date": "2023 May",
      "authors": "Molgora M, Liu YA, Colonna M, Cella M",
      "journal": "Semin Immunol"
    },
    {
      "title": "A Cre-deleter specific for embryo-derived brain macrophages reveals distinct features of microglia and border macrophages",
      "pubmed_id": "36791722",
      "pmc_id": "PMC10175109",
      "year": "2023",
      "publication_date": "2023 May",
      "authors": "Brioschi S, Belk JA, Peng V, Molgora M, Rodrigues PF, Nguyen KM, Wang S, Du S, Wang WL, Grajales-Reyes GE, Ponce JM, Yuede CM, Li Q, Baer JM, DeNardo DG, Gilfillan S, Cella M, Satpathy AT, Colonna M",
      "journal": "Immunity"
    },
    {
      "title": "Lipid-Associated Macrophages Are Induced by Cancer-Associated Fibroblasts and Mediate Immune Suppression in Breast Cancer",
      "pubmed_id": "35862581",
      "year": "2022",
      "publication_date": "2022 Sep",
      "authors": "Timperi E, Gueguen P, Molgora M, Magagna I, Kieffer Y, Lopez-Lastra S, Sirven P, Baudrin LG, Baulande S, Nicolas A, Champenois G, Meseure D, Vincent-Salomon A, Tardivon A, Laas E, Soumelis V, Colonna M, Mechta-Grigoriou F, Amigorena S, Romano E",
      "journal": "Cancer Res"
    }
  ],
  "grants": [
    {
      "description": "Title: IMPACT OF TREM2 ON GASTRIC CANCER  \nAward Number: AGA2023-13-06  \nSponsor: American Gastroenterological Association (AGA)  \nMolgora, M. (PD/PI)",
      "title": "IMPACT OF TREM2 ON GASTRIC CANCER",
      "award_number": "AGA2023-13-06",
      "sponsor": "American Gastroenterological Association (AGA)",
      "investigators": [
        {
          "name": "Molgora, M.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/MolgoraMartina_39484.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=39484"
  },
  "content_hash": "22334558fcbfedd138dbf573de357a080b417bbf48eaa1163887a2f351f4d923",
  "researcher_name": "Martina Molgora",
  "department": "Immunology"
}