{
  "profile_url": "https://www.moffitt.org/research-science/researchers/matthew-schabath",
  "last_updated": "2025-10-21T16:35:31.572511",
  "researcher_id": "4627",
  "degrees": [
    "PhD",
    "MD"
  ],
  "title": "",
  "primary_program": "Cancer Epidemiology",
  "research_program": "Cancer Epidemiology Program",
  "overview": "I am Senior Member (Tenured) with joint appointments in the Departments of Cancer Epidemiology and Thoracic Oncology. I have expertise in quantitative imaging/radiomics, molecular epidemiology, and health disparities among LGBTQ/SGM populations.",
  "research_interests": [
    "I am a Moffitt Distinguished Scholar, Co-Leader of the Cancer Epidemiology Program, and Senior Member in the Department of Cancer Epidemiology and Department of Thoracic Oncology at the Moffitt Cancer Center. I have published over 230 peer-reviewed papers (Pubmed, IEEE, SPIE) and have research expertise in quantitative imaging/radiomics, molecular epidemiology, and cancer care disparities and health equity. My h-index is 67 with over 22,000 citations. My career started in molecular epidemiology studying germline genetic variations on lung cancer risk and I have been continuously publishing in this area for over 24 years. I am a co-developer on one of the earliest lung cancer risk models (PMID: 17470739) and author for the first GWAS of pulmonary function (PMID: 20010835). I am one of the first epidemiologists to conduct research utilizing artificial intelligence (AI) approaches to analyze medical images to identify image-based biomarkers (e.g., radiomics/quantitative imaging) across the cancer care continuum including risk prediction, early detection, diagnosis, and patient outcomes. I have been publishing and funded in this area for over 14 years with a successful funding history from National Cancer Institute (NCI) Early Detection Research Network (EDRN), NCI Quantitative Imaging Network (QIN), NCI Consortium for Molecular and Cellular Characterization of Screen-Detected Lesions (MCL), and multiple R01-equivalent awards from the Florida Biomedical Research Program (FBRP). I have co-led several multi-institutional studies building large data and medical image repositories to conduct biomarker development studies. I have consented 1000s of patients to multiple prospective observational trials including several that are currently actively recruiting patients and banking images, data, and biospecimens. In addition to my areas of research, I have been active within the scientific community as an editorial board member, regular reviewer for journals, an active participant in many professional societies, a reviewer for NIH/ NCI study sections, and I am also a member of the NCCN Lung Cancer Screening guidelines committee. I also am Programmatic Member of the Department of Defense Lung Cancer Research Program (LCRP). With respect to health equity research, I have conducted numerous studies measuring oncology care providers’ attitudes, knowledge, and affirming practices of SGM/LGBTQ+ patients. These studies consistently revealed providers had limited knowledge about SGM/LGBTQ+ health care needs but a high interest in receiving education regarding these communities. As such, I co-led the development of the first-ever educational curriculum for SGM/LGBTQ+ cultural humility for oncologists called COLORS: Curriculum for Oncologists on LGBT populations to Optimize Relevance & Skills. To test the efficacy of COLORS, I led three randomized pragmatic trial which showed COLORS was effective at improving knowledge, attitudes, and affirming practices regarding the care of SGM/LGBTQ+ patients with cancer. In 2015, I co-led a catchment area survey study among SGM populations in the Tampa Bay region which revealed high rates of disclosure of sexual orientation and gender identity (SOGI) to their healthcare providers (HCPs), and low rates of negative reactions from their HCPs. Based on this publication, Moffitt Cancer Center implemented SOGI collection as standard-of-care demographic items in an institution-wide patient intake form and SOGI has been disclosed over 150,000 patients. To follow-up on these efforts, I recently received a P30 Cancer Center Support Grant-supplement to conduct a mixed methods approach to assess implementation outcomes, barriers, and facilitators of SOGI data collection and SGM healthcare delivery. Because of my passion for eliminating cancer disparities, I recently accepted an invitation to serve on the Steering Committee for the AACR Cancer Disparities Progress Report 2024, and in June 2023 I was awarded the “2023 Florida LGBTQ+ Ally Award” from the Florida Diversity Council. I am PI of a research protocol at the Moffitt Cancer Center focused on characterizing patient outcomes regarding SGM patients with cancer and I am co-chair of the SGM working group in the ECOG-ACRIN Cancer Research Group. A complete listing of publications can be found at: Pubmed: https://pubmed.ncbi.nlm.nih.gov/?term=schabath+m&sort=date ResearchGate: https://www.researchgate.net/profile/Matthew_Schabath2 Google Scholar: https://scholar.google.com/citations?hl=en&user=W_8qYaIAAAAJ&view_op=list_works&sortby=pubdate nstitute of Electrical and Electronics Engineers (IEEE): https://ieeexplore.ieee.org/search/searchresult.jsp?queryText=Schabath&highlight=true&returnFacets=ALL&returnType=SEARCH&matchPubs=true&sortType=newest SPIE, the international society for optics and photonics: https://www.spiedigitallibrary.org/Search?term=Schabath&sortBy=PubDateDesc\n  *"
  ],
  "associations": [
    "Cancer Epidemiology",
    "Thoracic Oncology",
    "Cancer Epidemiology Program",
    "Lung Cancer Center of Excellence",
    "Center for Immunization & Infection Research in Cancer",
    "Cancer Chemoprevention Research Interest Group"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of Texas School of Public Health, MS"
    },
    {
      "type": "Graduate",
      "institution": "University of Texas School of Public Health, PhD"
    },
    {
      "type": "Fellowship",
      "institution": "University of Texas MD Anderson Cancer Center",
      "specialty": "Cancer Epidemiology & Prevention"
    }
  ],
  "publications": [
    {
      "title": "Utilizing Clinicopathological and Radiomic Features for Risk Stratification of Lung Cancer Recurrence",
      "pubmed_id": "40379589",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Ho WLJ, Fetisov N, Hall LO, Goldgof D, Schabath MB",
      "journal": "Acad Radiol"
    },
    {
      "title": "The Association Between Alcohol Consumption and Anal Human Papillomavirus in the HPV Infection in Men Study",
      "pubmed_id": "40475161",
      "pmc_id": "PMC12140543",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Mohammed-Ali S, Umutoni V, Schabath MB, Nyitray AG, Sirak B, Lazcano-Ponce E, Villa L, Giuliano AR, Sudenga SL",
      "journal": "medRxiv"
    },
    {
      "title": "Real-world comparative outcomes of EGFR-TKIs for first-line treatment of EGFR+ metastatic non-small-cell lung cancer",
      "pubmed_id": "40120239",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Kim K, Syeed S, Au T, Diaz A, Schabath MB, Cass A, Hall R, Pai L, Li C, Balmaceda N, Palumbo A, Carey A, Lalla M, Henry M, Brixner D, Stenehjem D",
      "journal": "Cancer Treat Res Commun"
    },
    {
      "title": "Correction: Park et al",
      "pubmed_id": "40149388",
      "pmc_id": "PMC11941415",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Park MA, Whelan CJ, Ahmed S, Boeringer T, Brown J, Carson TL, Crowder SL, Gage K, Gregg C, Jeong DK, Jim HSL, Judge AR, Mason TM, Parker N, Pillai S, Qayyum A, Rajasekhara S, Rasool G, Tinsley SM, Schabath MB, Stewart P, West J, McDonald P, Permuth JB",
      "journal": "Defining and Addressing Research Priorities in Cancer Cachexia through Transdisciplinary Collaboration"
    },
    {
      "title": "Deciphering lung adenocarcinoma evolution and the role of LINE-1 retrotransposition",
      "pubmed_id": "40161734",
      "pmc_id": "PMC11952568",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Zhang T, Zhao W, Wirth C, Díaz-Gay M, Yin J, Cecati M, Marchegiani F, Hoang PH, Leduc C, Baine MK, Travis WD, Sholl LM, Joubert P, Sang J, McElderry JP, Klein A, Khandekar A, Hartman C, Rosenbaum J, Colón-Matos FJ, Miraftab M, Saha M, Lee OW, Jones KM, Caporaso NE, Wong MP, Leung KC, Agnes Hsiung C, Chen CY, Edell ES, Martínez Santamaría J, Schabath MB, Yendamuri SS, Manczuk M, Lissowska J, Świątkowska B, Mukeria A, Shangina O, Zaridze D, Holcatova I, Mates D, Milosavljevic S, Savic M, Bossé Y, Gould Rothberg BE, Christiani DC, Gaborieau V, Brennan P, Liu G, Hofman P, Homer R, Yang SR, Pesatori AC, Consonni D, Yang L, Zhu B, Shi J, Brown K, Rothman N, Chanock SJ, Alexandrov LB, Choi J, Cardelli M, Lan Q, Nowak MA, Wedge DC, Landi MT",
      "journal": "bioRxiv"
    },
    {
      "title": "Difference-Makers for Collecting Sexual Orientation and Gender Identity Data in Oncology Settings",
      "pubmed_id": "40047060",
      "pmc_id": "PMC11883291",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Pratt-Chapman ML, Miech EJ, Mullins MA, Chang S, Quinn GP, Maingi S, Schabath MB, Kamen C",
      "journal": "Cancer Med"
    },
    {
      "title": "Easy ensemble classifier-group and intersectional fairness and threshold (EEC-GIFT): a fairness-aware machine learning framework for lung cancer screening eligibility using real-world data",
      "pubmed_id": "40111867",
      "pmc_id": "PMC11986816",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Conahan P, Robinson LA, Le T, Valdes G, Schabath MB, Byrne MM, Green L, El Naqa I, Luo Y",
      "journal": "JNCI Cancer Spectr"
    },
    {
      "title": "Privacy-preserving Federated Learning and Uncertainty Quantification in Medical Imaging",
      "pubmed_id": "40366260",
      "pmc_id": "PMC12319697",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Koutsoubis N, Waqas A, Yilmaz Y, Ramachandran RP, Schabath MB, Rasool G",
      "journal": "Radiol Artif Intell"
    },
    {
      "title": "Self-Normalizing Multi-Omics Neural Network for Pan-Cancer Prognostication",
      "pubmed_id": "40806487",
      "pmc_id": "PMC12347193",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Waqas A, Tripathi A, Ahmed S, Mukund A, Farooq H, Johnson JO, Stewart PA, Naeini M, Schabath MB, Rasool G",
      "journal": "Int J Mol Sci"
    },
    {
      "title": "Genome-wide association study for lung cancer in 6531 African Americans reveals new susceptibility loci",
      "pubmed_id": "40341939",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Byun J, Han Y, Choi J, Sun R, Shaw VR, Zhu C, Xiao X, Lusk C, Badr H, Lee HS, Jang HJ, Li Y, Lim H, Long E, Liu Y, Kachuri L, Walsh KM, Wiencke JK, Albanes D, Lam S, Tardon A, Neuhouser ML, Barnett MJ, Chen C, Bojesen S, Brenner H, Landi MT, Johansson M, Risch A, Wichmann HE, Bickeböller H, Christiani DC, Rennert G, Arnold S, Field JK, Shete S, Le Marchand L, Liu G, Andrew AS, Zienolddiny S, Grankvist K, Johansson M, Caporaso N, Taylor F, Lazarus P, Schabath MB, Aldrich MC, Patel A, Lin X, Zanetti KA, Harris CC, Chanock S, McKay J, Schwartz AG, Hung RJ, Amos CI",
      "journal": "Hum Mol Genet"
    }
  ],
  "grants": [
    {
      "description": "Title: Quantitative Imaging Clinical Validation Center at Moffitt Cancer Center  \nAward Number: 5U01CA200464-08  \nSponsor: National Cancer Institute (NCI)  \nHeine, J. (PD/PI), Schabath, M. (PD/PI)",
      "title": "Quantitative Imaging Clinical Validation Center at Moffitt Cancer Center",
      "award_number": "5U01CA200464-08",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Heine, J.",
          "role": "PD/PI"
        },
        {
          "name": "Schabath, M.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Patient-Reported Outcomes as Novel Biomarkers for Monitoring Cancer Progression and Response to Treatment: A Validation Study  \nAward Number: 25C20  \nSponsor: Florida Department of Health  \nJim, H. (PD/PI), Brady, R. (Co-PD/PI), Schabath, M. (Co-PD/PI)",
      "title": "Patient-Reported Outcomes as Novel Biomarkers for Monitoring Cancer Progression and Response to Treatment: A Validation Study",
      "award_number": "25C20",
      "sponsor": "Florida Department of Health",
      "investigators": [
        {
          "name": "Jim, H.",
          "role": "PD/PI"
        },
        {
          "name": "Brady, R.",
          "role": "Co-PD/PI"
        },
        {
          "name": "Schabath, M.",
          "role": "Co-PD/PI"
        }
      ]
    },
    {
      "description": "Title: Radiomic Biomarkers for Clinical Decision Support That Predict Patient Outcomes in Serous Ovarian Carcinoma  \nAward Number: 1R56CA279060-01A1  \nSponsor: National Cancer Institute (NCI)  \nPeres, L. (PD/PI), Schabath, M. (PD/PI)",
      "title": "Radiomic Biomarkers for Clinical Decision Support That Predict Patient Outcomes in Serous Ovarian Carcinoma",
      "award_number": "1R56CA279060-01A1",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Peres, L.",
          "role": "PD/PI"
        },
        {
          "name": "Schabath, M.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Automated De-Identification of Pathology and Radiology Data  \nAward Number: Federal Contract75N91023C00041  \nSponsor: National Cancer Institute (NCI)  \nRasool, G. (PD/PI), Bui, M. (Co-PD/PI), Farinhas, J. (Co-PD/PI), Schabath, M. (Co-PD/PI)",
      "title": "Automated De-Identification of Pathology and Radiology Data",
      "award_number": "Federal Contract75N91023C00041",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Rasool, G.",
          "role": "PD/PI"
        },
        {
          "name": "Bui, M.",
          "role": "Co-PD/PI"
        },
        {
          "name": "Farinhas, J.",
          "role": "Co-PD/PI"
        },
        {
          "name": "Schabath, M.",
          "role": "Co-PD/PI"
        }
      ]
    },
    {
      "description": "Title: Pre- and Post-Diagnosis Metformin Use and Ovarian Cancer Survival  \nAward Number: RSG-22-047-01 - HOPS  \nSponsor: American Cancer Society, Inc. (ACS)  \nSchabath, M. (PD/PI)",
      "title": "Pre- and Post-Diagnosis Metformin Use and Ovarian Cancer Survival",
      "award_number": "RSG-22-047-01 - HOPS",
      "sponsor": "American Cancer Society, Inc. (ACS)",
      "source": "American Cancer Society",
      "investigators": [
        {
          "name": "Schabath, M.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Identification of Ovarian Cancer Risk Factors Among Women with Endometriosis  \nAward Number: CARE-R-2024-2-1275012  \nSponsor: Ovarian Cancer Research Alliance (OCRA)  \nSchabath, M. (PD/PI)",
      "title": "Identification of Ovarian Cancer Risk Factors Among Women with Endometriosis",
      "award_number": "CARE-R-2024-2-1275012",
      "sponsor": "Ovarian Cancer Research Alliance (OCRA)",
      "investigators": [
        {
          "name": "Schabath, M.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: A Pilot Study of a Novel Lung Cancer Diagnostic Using an Exhaled Breath Platform  \nAward Number: 23-0154-S1  \nSponsor: DETECT-ION  \nSchabath, M. (PD/PI)",
      "title": "A Pilot Study of a Novel Lung Cancer Diagnostic Using an Exhaled Breath Platform",
      "award_number": "23-0154-S1",
      "sponsor": "DETECT-ION",
      "investigators": [
        {
          "name": "Schabath, M.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Intratumoral Microbiota and Immune Predictors of Response to Immunotherapy in Lung Cancer  \nAward Number: 5R01CA285882-02  \nSponsor: National Cancer Institute (NCI)  \nSchabath, M. (PD/PI)",
      "title": "Intratumoral Microbiota and Immune Predictors of Response to Immunotherapy in Lung Cancer",
      "award_number": "5R01CA285882-02",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Schabath, M.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Non-invasive radiomic biomarkers to predict treatment response for immunotherapy of lung cancer  \nAward Number: 21B12  \nSponsor: Florida Department of Health  \nSchabath, M. (PD/PI)",
      "title": "Non-invasive radiomic biomarkers to predict treatment response for immunotherapy of lung cancer",
      "award_number": "21B12",
      "sponsor": "Florida Department of Health",
      "investigators": [
        {
          "name": "Schabath, M.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Infrastructure Expansion for an Enduring Rapid Tissue Donation Program  \nAward Number: 24K02  \nSponsor: Florida Department of Health  \nSchabath, M. (PD/PI), Boyle, T. (Co-PD/PI)",
      "title": "Infrastructure Expansion for an Enduring Rapid Tissue Donation Program",
      "award_number": "24K02",
      "sponsor": "Florida Department of Health",
      "investigators": [
        {
          "name": "Schabath, M.",
          "role": "PD/PI"
        },
        {
          "name": "Boyle, T.",
          "role": "Co-PD/PI"
        }
      ]
    },
    {
      "description": "Title: Landscape of Lung Cancer Survivorship Survey  \nAward Number:   \nSponsor: American Cancer Society, Inc. (ACS)  \nSchabath, M. (PD/PI)",
      "title": "Landscape of Lung Cancer Survivorship Survey",
      "award_number": "",
      "sponsor": "American Cancer Society, Inc. (ACS)",
      "source": "American Cancer Society",
      "investigators": [
        {
          "name": "Schabath, M.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/SchabathMatthew_4627.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=4627"
  },
  "content_hash": "2b0a2ea7996e56a770f7bff9c004e881ee10a22bf7ec0e51ea90ced3f79b41c6",
  "researcher_name": "Matthew Schabath",
  "department": "Cancer Epidemiology"
}