{
  "profile_url": "https://www.moffitt.org/research-science/researchers/melissa-alsina/",
  "last_updated": "2025-11-21T22:50:25.758798",
  "researcher_id": "36",
  "degrees": [
    "MD"
  ],
  "title": "",
  "primary_program": "blood and marrow transplant and cellular immunotherapy",
  "research_program": "molecular medicine",
  "overview": "I am a myeloma specialist focusing on novel treatments and immunotherapy in myeloma. Also interested in risk and response adapted approach to therapy, as well as in immunotherapy related toxicities.",
  "research_interests": [
    "Dr. Alsina is a specialist in multiple myeloma and bone marrow transplantation and cellular immunotherapy. Her clinical research focuses on the evaluation of novel drugs and combinations to treat myeloma and target minimal residual disease. She is the principal investigator of multiple myeloma studies focusing on maintenance therapy both post transplants;ant and post CART and novel immunotherapies in the relapsed and newly diagnosed settings. Dr. Alsina has served as a member of NCCN Myeloma Panel and the NCI Myeloma Steering Committee, as well as professional organizations such as the International Myeloma Society and the American Society of Hematology. She is actively involved in organizing educational programs for myeloma patients and co-chairs the Annual Hematologic Malignancies Program. \n  *"
  ],
  "associations": [
    "Blood and Marrow Transplant and Cellular Immunotherapy",
    "Pentecost Family Myeloma Research Center",
    "Molecular Medicine Program"
  ],
  "education": [
    {
      "type": "Medical School",
      "institution": "University of Puerto Rico, School of Medicine",
      "degree": "MD"
    },
    {
      "type": "Internship",
      "institution": "San Juan Veterans Adm Hospital, Puerto Rico",
      "position": "Intern",
      "specialty": "Medicine"
    },
    {
      "type": "Residency",
      "institution": "San Juan Veterans Adm Hospital, Puerto Rico",
      "specialty": "Medicine"
    },
    {
      "type": "Fellowship",
      "institution": "San Juan Hospital, Puerto Rico",
      "specialty": "Hematology"
    },
    {
      "type": "Fellowship",
      "institution": "University of Texas Health Science Center",
      "specialty": "Hematology/Oncology"
    }
  ],
  "publications": [
    {
      "title": "Expert Perspectives on Current Challenges and Emerging Approaches for Multiple Myeloma: Narrative Review of an Inaugural Bridging the Gaps in Leukemia, Lymphoma, and Multiple Myeloma",
      "pubmed_id": "40175263",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Chari A, Bal S, Ailawadhi S, Krishnan A, Patel KK, Berdeja JG, Garfall A, Callander N, Banerjee R, Alsina M, Nooka AK, Dhakal B, Gasparetto C, Costello C",
      "journal": "Clin Lymphoma Myeloma Leuk"
    },
    {
      "title": "Target antigen and plasma cell phenotype are critical factors for sensitivity to response-adapted daratumumab therapy",
      "pubmed_id": "40983035",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Meads MB, Zhao X, Noyes DR, Sudalagunta P, Achille A, Zhang C, Renatino Canevarolo R, Silva M, Magaletti D, DeAvila D, Toska S, Oates A, Lastorino D, Idiaquez DW, Song J, Sansil S, Yoder SJ, Grajales-Cruz AF, Blue BJ, Freeman CL, Kim J, Alsina M, Brayer J, Siqueira Silva A, Song X, Shain KH, Baz RC",
      "journal": "Blood"
    },
    {
      "title": "Sequential targeting in multiple myeloma: talquetamab, a GPRC5D bispecific antibody, as a bridge to BCMA CAR-T therapy",
      "pubmed_id": "40749169",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Dhakal B, Akhtar OS, Fandrei D, Jensen A, Banerjee R, Pan D, Richard S, Friend R, Rees MJ, Costello P, Vazquez Martinez MA, Pasvolsky O, Wagner CB, Davis JA, Castaneda Puglianini OA, Reshef R, Afrough A, Dima D, Bhutani M, Nadeem O, Parrondo RD, Freeman CL, Mikkilineni L, Raza S, Anderson LD, Kapoor P, Hosoya H, Chhabra S, Grajales-Cruz A, Gaballa MR, Midha S, Alsina M, Sborov DW, Patel KK, Lin Y, Ferreri CJ, Gagelmann N, Kumar AD, Hansen DK, Cowan AJ, Costa LJ, Merz M, Sidana S",
      "journal": "Blood"
    },
    {
      "title": "Outcomes of elderly patients with relapsed refractory multiple myeloma (RRMM) treated with teclistamab: a multicenter study from the U",
      "pubmed_id": "40346049",
      "pmc_id": "PMC12064690",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Pasvolsky O, Dima D, Feng L, Dong W, Richards T, Davis JA, Afrough A, Vazquez-Martinez M, Sannareddy A, Goel U, Banerjee R, Khouri J, Cervoni F, Gaballa MR, Lieberman-Cribbin A, Rana MS, Julian K, Ferreri CJ, Shune L, DeJarnette S, Bhurtel E, Susanibar Adaniya S, Portuguese A, Hosoya H, Mikkilineni L, Kaur G, Rossi A, Herr MM, Schrum D, Lin C, Raza S, Lin Y, Midha S, Omar N, Atarsh S, McGuirk J, Sborov D, Voorhees P, Anwer F, Alsina M, Freeman C, Garfall AL, Razzo BM, Sidana S, Cowan AJ, Anderson LD, Hansen DK, Richard S, Patel KK, Lee HC, Grajales-Cruz A",
      "journal": "S"
    },
    {
      "title": "Comparison of Standard-of-Care Idecabtagene Vicleucel and Ciltacabtagene Autoleucel in Relapsed/Refractory Multiple Myeloma",
      "pubmed_id": "39965175",
      "pmc_id": "PMC12037312",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Hansen DK, Peres LC, Dima D, Richards A, Shune L, Afrough A, Midha S, Dhakal B, Kocoglu MH, Atrash S, Ferreri C, Castaneda O, Davis JA, Bhurtel E, McGuirk J, Wagner C, Bansal R, Costello P, Smith K, Lieberman-Cribbin A, De Avila G, Purvey S, Hosoya H, Mikkilineni L, Oswald LB, Kaur G, Pasvolsky O, Gaballa M, Herr MM, Forsberg P, Janakiram M, Htut M, Asoori Maringanti S, Kalariya N, Hashmi H, Reshef R, Sborov DW, Nadeem O, Anwer F, Khouri J, Raza S, Atanackovic D, Alsina M, Freeman CL, Locke FL, Voorhees P, Anderson LD, Richard S, Martin T, Lin Y, Patel KK, Sidana S",
      "journal": "J Clin Oncol"
    },
    {
      "title": "Cytopenias and infections following ciltacabtagene autoleucel in heavily-pretreated relapsed or refractory multiple myeloma",
      "pubmed_id": "40637727",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Dima D, Logue JM, Waqar SHB, Peres LC, Colin-Leitzinger CM, De Avila G, Smith EC, Skelson L, Matte KL, Blue B, Hovanky VN, Gaballa M, Pasvolsky O, Oswald LB, Fortuna GGM, Wagner CB, DeJarnette S, Dillard C, Perna F, Mikkilineni L, Hosoya H, Freeman CL, Shain KH, Baz RC, Grajales-Cruz A, Puglianini OC, Alsina M, Locke FL, Shune LO, Sborov DW, Patel KK, Sidana S, Hansen DK",
      "journal": "Haematologica"
    },
    {
      "title": "Safety and efficacy of standard-of-care ciltacabtagene autoleucel for relapsed/refractory multiple myeloma",
      "pubmed_id": "39365257",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Sidana S, Patel KK, Peres LC, Bansal R, Kocoglu MH, Shune L, Atrash S, Smith K, Midha S, Ferreri CJ, Dhakal B, Dima D, Costello P, Wagner C, Reshef R, Hosoya H, Mikkilineni L, Atanackovic D, Chhabra S, Parrondo RD, Nadeem O, Mann H, Kalariya N, Hovanky V, DeAvila G, Freeman CL, Locke FL, Alsina M, Wong S, Herr MM, Htut M, McGuirk JP, Sborov DW, Khouri J, Martin T, Janakiram M, Lin Y, Hansen DK",
      "journal": "Blood"
    },
    {
      "title": "The Functional Transcriptomic Landscape Informs Therapeutic Strategies in Multiple Myeloma",
      "pubmed_id": "39476082",
      "pmc_id": "PMC11733535",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Sudalagunta PR, Canevarolo RR, Meads MB, Silva M, Zhao X, Cubitt CL, Sansil SS, DeAvila G, Alugubelli RR, Bishop RT, Tungesvik A, Zhang Q, Hampton O, Teer JK, Welsh EA, Yoder SJ, Shah BD, Hazlehurst L, Gatenby RA, Van Domelen DR, Chai Y, Wang F, DeCastro A, Bloomer AM, Siegel EM, Lynch CC, Sullivan DM, Alsina M, Nishihori T, Brayer J, Cleveland JL, Dalton W, Walker CJ, Landesman Y, Baz R, Silva AS, Shain KH",
      "journal": "Cancer Res"
    },
    {
      "title": "Enhanced CAR-T cell function and mitochondrial fitness from earlier unfractionated stem cell product in multiple myeloma",
      "pubmed_id": "40253586",
      "pmc_id": "PMC12461620",
      "year": "2025",
      "publication_date": "2025 Aug",
      "authors": "Freeman CL, Abraham-Miranda J, Menges M, Atkins RM, Noble J, Liu H, Corallo S, Cuadrado Delgado LA, Ribickas AJ, Savid-Frontera C, de Avila G, Castaneda Puglianini OA, Ochoa-Bayona J, Hansen DK, Alsina M, Baz R, Nishihori T, Shain KH, Locke FL",
      "journal": "Mol Ther"
    },
    {
      "title": "Establishing a successful outpatient CAR T-Cell program with cilta-cel: real-world experience from an expert roundtable",
      "pubmed_id": "40098471",
      "pmc_id": "PMC11988239",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Alsina M, Dhakal B, Pantin J, Huff CA, Janakiram M",
      "journal": "Future Oncol"
    }
  ],
  "grants": [
    {
      "description": "Title: Educational Program on the Implementation and Therapy Management of B-cell Maturation Antigen (BCMA) targeting Bi-Specific Antibodies in Relapsed Myeloma in Florida and Puerto Rico  \nAward Number: 99517835  \nSponsor: PFIZER INC.  \nAlsina, M. (PD/PI), Baz, R. (Co-PD/PI)",
      "title": "Educational Program on the Implementation and Therapy Management of B-cell Maturation Antigen (BCMA) targeting Bi-Specific Antibodies in Relapsed Myeloma in Florida and Puerto Rico",
      "award_number": "99517835",
      "sponsor": "PFIZER INC.",
      "investigators": [
        {
          "name": "Alsina, M.",
          "role": "PD/PI"
        },
        {
          "name": "Baz, R.",
          "role": "Co-PD/PI"
        }
      ]
    }
  ],
  "participating_trials": [
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-22177/",
      "trial_id": "22177",
      "title": "Intermediate-Size Population Expanded Access Program (EAP) for Ciltacabtagene Autoleucel (cilta-cel) Out-of-Specification (OOS) in Patients with Multiple Myeloma",
      "condition": "Malignant Hematology",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-22256/",
      "trial_id": "22256",
      "title": "A Phase 3, Two-stage, Randomized, Multi-center, Controlled, Open-label Study Comparing Iberdomide Maintenance to Lenalidomide Maintenance Treatment after Autologous Stem Cell Transplantation (ASCT) in Participants with Newly Diagnosed Multiple Myeloma (NDMM)",
      "condition": "Malignant Hematology",
      "intervention": "CC-5013 (Lenalidomide); Iberdomide (); Lenalidomide (Revlimid)",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23422/",
      "trial_id": "23422",
      "title": "Long-term Follow-up Study for Participants Previously Treated with Ciltacabtagene Autoleucel",
      "condition": "Malignant Hematology",
      "intervention": "Not Applicable ()",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23564/",
      "trial_id": "23564",
      "title": "Phase II study of Elranatamab as maintenance therapy post ciltacabtagene-autoleucel(cilta-cel) in patients with clinical high risk relapsed myeloma",
      "condition": "Malignant Hematology",
      "intervention": "Elranatamab ()",
      "status": "Open"
    }
  ],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/AlsinaMelissa_36.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=36"
  },
  "content_hash": "e6867a57c4b62aa10fcf870370a40a42b71ce88fccd93c448f876e437c5c51dc",
  "researcher_name": "melissa alsina",
  "department": ""
}