{
  "profile_url": "https://www.moffitt.org/research-science/researchers/michael-poch/",
  "last_updated": "2025-11-21T22:50:25.788698",
  "researcher_id": "10769",
  "degrees": [
    "MD"
  ],
  "title": "",
  "primary_program": "genitourinary oncology",
  "research_program": "health outcomes & behavior",
  "overview": "Dr. Poch's research interests include health-related quality of life outcomes after oncologic surgery with a focus on post-operative body image and mental health assessments.",
  "research_interests": [
    "Dr. Poch's research interests include health-related quality of life outcomes after oncologic surgery with a focus on post-operative body image and mental health assessments. His current research projects include assessment of patient-centered treatment preferences for urinary diversion after bladder removal surgery. In addition, he is involved in active enrollment of patients to Moffitt sponsored clinical trials. Additional research interests include immunotherapy for bladder cancer, specifically evaluating the potential growth and expansion of tumor infiltrating lymphocytes.\n  *"
  ],
  "associations": [
    "Genitourinary Oncology",
    "Immunology",
    "Health Outcomes & Behavior Program",
    "Cancer Chemoprevention Research Interest Group"
  ],
  "education": [
    {
      "type": "Medical School",
      "institution": "Alpert Medical School at Brown University",
      "degree": "MD"
    },
    {
      "type": "Residency",
      "institution": "Rhode Island Hospital, Brown University",
      "specialty": "General Surgery and Urology"
    },
    {
      "type": "Fellowship",
      "institution": "Rosewell Park Cancer Institute",
      "specialty": "Urologic Oncology"
    }
  ],
  "publications": [
    {
      "title": "Cisplatin-ineligible patients with muscle-invasive bladder cancer demonstrate poor long-term survival following immediate radical cystectomy",
      "pubmed_id": "40932312",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Fazili A, Jazayeri SB, Rose KM, Guske C, Wen L, Durant A, Prunty M, Bukavina L, Tyson MD, Grass GD, Xu H, Spiess PE, Gilbert SM, Sexton WJ, Zemp L, Pessoa RR, Poch M, Lerner SP, Li R",
      "journal": "BJU Int"
    },
    {
      "title": "Exenteration after exenteration: A vulvar pagetoid recurrence following radical resection of urothelial carcinoma",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Yasukawa M, Rivera L, Poch MA, Wenham RM, Hakam A, Avila M",
      "journal": "Annals of Surgical Case Reports & Images"
    },
    {
      "title": "Nivolumab adjuvant to chemo-radiation in localized muscle-invasive urothelial cancer: primary analysis of a multicenter, single-arm, phase II, investigator-initiated trial (NEXT)",
      "pubmed_id": "40102029",
      "pmc_id": "PMC11927433",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Galarza Fortuna GM, Grass D, Maughan BL, Jain RK, Dechet C, Beck J, Schuetz E, Sanchez A, O'Neil B, Poch M, Li R, Lloyd S, Tward J, Phunrab T, Hawks JL, Swami U, Boucher KM, Agarwal N, Gupta S",
      "journal": "J Immunother Cancer"
    },
    {
      "title": "Oncolytic immunotherapy with nivolumab in muscle-invasive bladder cancer: a phase 1b trial",
      "pubmed_id": "39521884",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Li R, Villa NY, Yu X, Johnson JO, Borjas G, Dhillon J, Moran-Segura CM, Kim Y, Francis N, Dorman D, Powers JJ, Sexton WJ, Spiess PE, Poch MA, Zemp L, Gilbert SM, Zhang J, Pow-Sang JM, Anderson ARA, Li T, Wang X, Grass GD, Burke JM, Dinney CPN, Rodriguez PC, Jain RK, Mulé JJ, Conejo-Garcia JR",
      "journal": "Nat Med"
    },
    {
      "title": "Gold standard nephroureterectomy, chemoprophylaxis and surveillance in upper tract urothelial carcinoma",
      "pubmed_id": "39529478",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Basile G, Bandini M, Li R, Poch MA, Necchi A, Spiess PE",
      "journal": "Curr Opin Urol"
    },
    {
      "title": "Assessing the Impact of Treatment Timing Protocols in Clinical Trials for Bacillus Calmette-Guérin-unresponsive Non-muscle-invasive Bladder Cancer",
      "pubmed_id": "40670271",
      "year": "2025",
      "publication_date": "2025 Aug",
      "authors": "Guske C, Jazayeri SB, Harrs C, Rao N, Davaro F, Xu H, Zemp L, Yu A, Gilbert SM, Poch M, Spiess PE, Sexton W, Linscott J, Li R",
      "journal": "Eur Urol Oncol"
    },
    {
      "title": "Efficacy of Intravesical Nadofaragene Firadenovec for Patients With Bacillus Calmette-Guérin-Unresponsive Nonmuscle-Invasive Bladder Cancer: 5-Year Follow-Up From a Phase 3 Trial",
      "pubmed_id": "38704840",
      "year": "2024",
      "publication_date": "2024 Jul",
      "authors": "Narayan VM, Boorjian SA, Alemozaffar M, Konety BR, Shore ND, Gomella LG, Kamat AM, Bivalacqua TJ, Montgomery JS, Lerner SP, Busby JE, Poch M, Crispen PL, Steinberg GD, Schuckman AK, Downs TM, Mashni J, Lane BR, Guzzo TJ, Bratslavsky G, Karsh LI, Woods ME, Brown G, Canter D, Luchey A, Lotan Y, Inman BA, Williams MB, Cookson MS, Chang SS, Sankin AI, O'Donnell MA, Sawutz D, Philipson R, Parker NR, Yla-Herttuala S, Rehm D, Jakobsen JS, Juul K, Dinney CPN",
      "journal": "J Urol"
    },
    {
      "title": "A Single Institution Experience in the Management of Localized Neuroendocrine Carcinoma of the Bladder",
      "pubmed_id": "39353214",
      "year": "2024",
      "publication_date": "2024 Dec",
      "authors": "Liveringhouse C, Sim AJ, Zhang J, Jain RK, Naidu SU, Linkowski L, Zemp LW, Yu A, Sexton WJ, Spiess PE, Gilbert SM, Poch MA, Pow-Sang J, Li R, Manley BJ, Vosoughi A, Dhillon J, Xu H, Torres-Roca JF, Johnstone PAS, Yamoah K, Grass GD",
      "journal": "Clin Genitourin Cancer"
    },
    {
      "title": "From Detection to Cure - Emerging Roles for Urinary Tumor DNA (utDNA) in Bladder Cancer",
      "pubmed_id": "38837106",
      "year": "2024",
      "publication_date": "2024 Aug",
      "authors": "Linscott JA, Miyagi H, Murthy PB, Yao S, Grass GD, Vosoughi A, Xu H, Wang X, Yu X, Yu A, Zemp L, Gilbert SM, Poch MA, Sexton WJ, Spiess PE, Li R",
      "journal": "Curr Oncol Rep"
    },
    {
      "title": "Impact of surgical margin and extent of lymphadenectomy on oncologic outcomes in plasmacytoid urothelial carcinoma",
      "pubmed_id": "36959058",
      "year": "2023",
      "publication_date": "2023 Sep",
      "authors": "Davaro F, Davaro E, Rose K, Murthy P, Naidu S, Camperlengo L, Grass GD, Vosoughi A, Jain RK, Zemp L, Yu A, Poch MA, Spiess PE, Gilbert SM, Sexton WJ, Li R",
      "journal": "Urol Oncol"
    }
  ],
  "grants": [
    {
      "description": "Title: Development of Adoptive T-Cell Therapy in Bladder Cancer Incorporating Patient-Specific Tumor Microenvironment  \nAward Number: W81XWH2210339  \nSponsor: Department of Defense (DOD)  \nPoch, M. (PD/PI)",
      "title": "Development of Adoptive T-Cell Therapy in Bladder Cancer Incorporating Patient-Specific Tumor Microenvironment",
      "award_number": "W81XWH2210339",
      "sponsor": "Department of Defense (DOD)",
      "source": "DOD",
      "investigators": [
        {
          "name": "Poch, M.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": ""
    }
  ],
  "participating_trials": [],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/PochMichael_10769.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=10769"
  },
  "content_hash": "1527cef0c28e246f5b7b33512fce7086ad88fd0989f450c284bf8a214d9b1f77",
  "researcher_name": "michael poch",
  "department": "immunology"
}