{
  "profile_url": "https://www.moffitt.org/research-science/researchers/michael-wach/",
  "last_updated": "2025-11-21T22:50:25.881161",
  "researcher_id": "unknown",
  "degrees": [
    "MD"
  ],
  "title": "",
  "primary_program": "gastrointestinal oncology",
  "research_program": "cancer biology & evolution",
  "overview": "I am an academic surgical oncologist with a focus on Gastrointestinal Surgical Oncology. In general, my research interests relate to patients with metastatic or advanced GI cancers, with a particular interest in determining the best treatments for patients with peritoneal surface malignancies and in collaborating with scientists at my institution to develop new therapeutics for these diseases. My objective is to continue clinical and translational research at Moffitt Cancer Center, and help find new treatments for my patients that alleviate symptoms and prolong survival.",
  "research_interests": [
    "Dr. Wach’s clinical interests are in treating patients with cancers of the gastrointestinal tract specifically those that spread to the peritoneum using cytoreductive surgery and heated intraperitoneal chemotherapy. His research interests are in exploring new therapies for metastatic cancer to the peritoneum and finding ways for better detection and surveillance of peritoneal disease. Additionally, he is interested in multidisciplinary collaborations to develop models to better study metastatic cancer in the preclinical setting.In general, my research interests relate to patients with metastatic or advanced GI cancers, with a particular interest in developing therapeutics for patients with peritoneal surface malignancies. Patients with peritoneal-only metastatic disease have a uniquely aggressive tumor biology and respond differently to treatment than patients with hematogenous metastases. Drug delivery is often more difficult and mucinous components and immunosuppression can inhibit effectiveness. Patients often exhibit significant disability due to malignant ascites, bowel obstruction, and malnutrition and thus have debilitating morbidity and drastically limited survival compared to metastatic disease at other sites (ex. Lungs or liver). Due to difficulties with detecting peritoneal disease on conventional imaging (and thus assessing response to therapies), there is a paucity of research for peritoneal malignancies in comparison to other cancers and fewer active clinical trials. My goal is to help identify new and better treatment options for this underserved patient population that prolong life and alleviate symptoms.\n  *"
  ],
  "associations": [
    "Gastrointestinal Oncology",
    "Cancer Biology & Evolution Program"
  ],
  "education": [],
  "publications": [
    {
      "title": "ASO Practice Guideline Series: Management of Colorectal Peritoneal Metastases",
      "pubmed_id": "40587073",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Wach MM, Dineen SP",
      "journal": "Ann Surg Oncol"
    },
    {
      "title": "Expression of IMPACT curtails metabolic plasticity and augments NK cell killing to abrogate metastatic growth",
      "pubmed_id": "40736016",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Sinha S, Panda AK, Xavier das Neves R, Nwosu ZC, Xu K, van Beek E, Desai PP, Sindiri S, Chempati S, Remmert K, Gasmi B, Bojmar L, Zambirinis C, Rossi AJ, Ayabe RI, Wach MM, McDonald JD, Ruff SM, Verbus EA, Saif A, Eade AV, Larrain CM, Friedman LR, Gupta S, Ranjan A, Teke ME, Khan TM, Pu T, Sarvestani AL, Ryan CE, Lambdin JT, Luberice K, Gregory SN, Lux SC, Hong H, Luna AJ, Alexander IA, Akmal SR, Rehman SU, Rainey A, Prickett TD, Koparde VN, Sevilla S, Kuhn SA, Chan K, Sun Z, Bubunenko N, Li E, Hannah C, Gaga G, Andresson T, Cam MC, Wu X, Jenkins LM, Blakely AM, Davis JL, Trinchieri G, Singh PK, Yang JC, Pasca di Magliano M, Lyssiotis CA, Yaffe MB, Shevach EM, Hernandez JM",
      "journal": "Cancer Discov"
    },
    {
      "title": "Combined hepatic resection and ablation for high burden of colorectal liver metastases demonstrates safety and durable survival",
      "pubmed_id": "38008683",
      "year": "2024",
      "publication_date": "2024 Mar",
      "authors": "Wach MM, Washburn LA, Alvikas J, Qu LT, Zhang M, Etherington MS, Rieser C, Haykal T, Pingpank JF, Zureikat AH, Geller DA, Hoehn RS, Tohme S",
      "journal": "HPB (Oxford)"
    },
    {
      "title": "Normal CEA Levels After Neoadjuvant Chemotherapy and Cytoreduction with Hyperthermic Intraperitoneal Chemoperfusion Predict Improved Survival from Colorectal Peritoneal Metastases",
      "pubmed_id": "38270826",
      "year": "2024",
      "publication_date": "2024 Apr",
      "authors": "Wach MM, Nunns G, Hamed A, Derby J, Jelinek M, Tatsuoka C, Holtzman MP, Zureikat AH, Bartlett DL, Ahrendt SA, Pingpank JF, Choudry MHA, Ongchin M",
      "journal": "Ann Surg Oncol"
    },
    {
      "title": "An assessment of perioperative outcomes for open, laparoscopic, and robot-assisted pancreaticoduodenectomy in New York State",
      "pubmed_id": "35986891",
      "year": "2022",
      "publication_date": "2022 Dec",
      "authors": "Wach MM, Myneni AA, Miller L, Boccardo J, Ibrahim-Zada I, Schwaitzberg SS, Noyes K, Gajdos C",
      "journal": "J Surg Oncol"
    },
    {
      "title": "Recombinant human Hsp110-gp100 chaperone complex vaccine is nontoxic and induces response in advanced stage melanoma patients",
      "pubmed_id": "35254331",
      "pmc_id": "PMC8985419",
      "year": "2022",
      "publication_date": "2022 Apr",
      "authors": "Wach MM, Subjeck JR, Wang XY, Repasky E, Matsuzaki J, Yu H, Wang C, Fisher D, Skitzki JJ, Kane JM",
      "journal": "Melanoma Res"
    },
    {
      "title": "A Survey of the Complex General Surgical Oncology Fellowship Programs Regarding Applicant Selection and Rank",
      "pubmed_id": "31011903",
      "pmc_id": "PMC6684844",
      "year": "2019",
      "publication_date": "2019 Apr",
      "authors": "Wach MM, Ayabe RI, Ruff SM, D'Angelica M, Dineen SP, Grubbs EG, Shibata D, Shirley L, Weiss MJ, Davis JL, Hernandez JM",
      "journal": "Ann Surg Oncol"
    },
    {
      "title": "An Examination of Applicants and Factors Associated with Matriculation to Complex General Surgical Oncology Fellowship Training Programs",
      "pubmed_id": "30054823",
      "pmc_id": "PMC6191290",
      "year": "2018",
      "publication_date": "2018 Nov",
      "authors": "Wach MM, Ruff SM, Ayabe RI, Martin SP, Diggs LP, Alexander IA, Steinberg SM, Davis JL, Hernandez JM",
      "journal": "Ann Surg Oncol"
    }
  ],
  "grants": [],
  "participating_trials": [
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23796/",
      "trial_id": "23796",
      "title": "Characterization of a Distinct Tumor Microenvironment in Colorectal Peritoneal Metastases",
      "condition": "Gastrointestinal Tumor",
      "status": "Open"
    }
  ],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/WachMichael_41606.jpg",
  "contact": {},
  "content_hash": "a7a2f0442c8edcdcab54719015cd64536fd2eb3be088c72adc31ce30dd0945b1",
  "researcher_name": "michael wach",
  "department": ""
}