{
  "profile_url": "https://www.moffitt.org/research-science/researchers/nagi-kumar",
  "last_updated": "2025-10-21T16:36:11.090650",
  "researcher_id": "1278",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "Cancer Epidemiology",
  "research_program": "Cancer Epidemiology Program",
  "overview": "Dr. Kumar is a Senior Member of the Cancer Epidemiology, Genitourinary and Breast Oncology Departments at the Moffitt Cancer Center. She collaborates with investigators in basic, population, and clinical sciences, both nationally and internationally, and has developed a program to accelerate agent development and biomarker validation for cancer chemoprevention.",
  "research_interests": [
    "Using a multi-disciplinary science-based approach and the rigor with which other therapeutic agents are tested, Dr. Kumar has initiated several epidemiological, laboratory, preclinical and phase I-II clinical trials evaluating safety, effectiveness and potential molecular targets of several agents for cancer chemoprevention, including green tea catechins, isoflavones, tannic acid, n-3 fatty acids, metformin, anthocyanins, sulforaphanes, Quercetin, n-3 fatty acids, curcumin, and combination agents for cancer chemoprevention. She leads two active phase II secondary chemoprevention trials targeting men with localized prostate cancer. Informed by her laboratory and early phase clinical trials, the goal of these randomized clinical trials is to comprehensively and rigorously evaluate the safety, effectiveness, and mechanism of green tea catechins on clinical and biological intermediate endpoint markers, implicated in prostate carcinogenesis, that will ultimately inform development of Phase III clinical trials for secondary chemoprevention of prostate cancer in men on active surveillance. And these trials will create a specimen repository with which to test future and evolving novel hypotheses to assess other genetic or environmental factors that may influence incidence and progression of prostate cancer. Dr. Kumar also leads a phase II chemoprevention trial evaluating a combination of curcumin and n-3 fatty acids to modulate lung nodules in former smokers. And she has developed and tested multimodal interventions to characterize and ameliorate symptoms of cancer treatment including for hypothyroidism, cancer cachexia, and cognitive impairment. Her goal for cancer chemoprevention at Moffitt Cancer Center is to utilize a systematic, broad spectrum approach to identify agents that can: (a) produce robust and concurrent inhibition of multiple hallmark-associated pathways in target (precursor or early stage tumor) tissue/microenvironment, (b) addressing the underlying biology of carcinogenesis; (c) enhance bioavailability and half-life, (d) with minimum toxicity, (e) in exceptionally high risk populations.\n  *"
  ],
  "associations": [
    "Cancer Epidemiology",
    "Genitourinary Oncology",
    "Breast Oncology",
    "Cancer Epidemiology Program",
    "Cancer Chemoprevention Research Interest Group"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of South Florida, Tampa, Florida, MA"
    },
    {
      "type": "Graduate",
      "institution": "University of South Florida, Tampa, Florida, PhD"
    },
    {
      "type": "Internship",
      "institution": "City Hospital Center at Elmhurst, Mt. Sinai School of Medicine, New York",
      "position": "Intern",
      "specialty": "Dietetic"
    }
  ],
  "publications": [
    {
      "title": "Contemporary Strategies for Clinical Chemoprevention of Localized Prostate Cancer",
      "pubmed_id": "39573923",
      "pmc_id": "PMC11583501",
      "year": "2024",
      "publication_date": "2024 Jan",
      "authors": "Kumar NB",
      "journal": "Cancer Control"
    },
    {
      "title": "Alternative dosing regimen of exemestane in a randomized presurgical trial: the role of obesity in biomarker modulation",
      "pubmed_id": "38238336",
      "pmc_id": "PMC10796398",
      "year": "2024",
      "publication_date": "2024 Jan",
      "authors": "Johansson H, Guerrieri-Gonzaga A, Gandini S, Bertelsen BE, Macis D, Serrano D, Mellgren G, Lazzeroni M, Thomas PS, Crew KD, Kumar NB, Briata IM, Galimberti V, Viale G, Vornik LA, Aristarco V, Buttiron Webber T, Spinaci S, Brown PH, Heckman-Stoddard BM, Szabo E, Bonanni B, DeCensi A",
      "journal": "NPJ Breast Cancer"
    },
    {
      "title": "Drug and biomarker tissue levels in a randomized presurgical trial on exemestane alternative schedules",
      "pubmed_id": "39110531",
      "pmc_id": "PMC11630545",
      "year": "2024",
      "publication_date": "2024 Dec",
      "authors": "Serrano D, Johansson H, Bertelsen BE, Gandini S, Mellgren G, Thomas P, Crew KD, Kumar NB, Macis D, Aristarco V, Guerrieri-Gonzaga A, Lazzeroni M, D'Amico M, Buttiron-Webber T, Briata IM, Spinaci S, Galimberti V, Vornik LA, Villar-Sanchez E, Brown PH, Heckman-Stoddard BM, Szabo E, Bonanni B, Decensi A",
      "journal": "J Natl Cancer Inst"
    },
    {
      "title": "Efficacy of Alternative Dose Regimens of Exemestane in Postmenopausal Women With Stage 0 to II Estrogen Receptor-Positive Breast Cancer: A Randomized Clinical Trial",
      "pubmed_id": "36951827",
      "pmc_id": "PMC10037202",
      "year": "2023",
      "publication_date": "2023 May",
      "authors": "Serrano D, Gandini S, Thomas P, Crew KD, Kumar NB, Vornik LA, Lee JJ, Veronesi P, Viale G, Guerrieri-Gonzaga A, Lazzeroni M, Johansson H, D'Amico M, Guasone F, Spinaci S, Bertelsen BE, Mellgren G, Bedrosian I, Weber D, Castile T, Dimond E, Heckman-Stoddard BM, Szabo E, Brown PH, DeCensi A, Bonanni B",
      "journal": "JAMA Oncol"
    },
    {
      "title": "Challenges to Recruiting Men on Active Surveillance for Prostate Cancer in Clinical Chemoprevention Trials",
      "pubmed_id": "36831597",
      "pmc_id": "PMC9954186",
      "year": "2023",
      "publication_date": "2023 Feb",
      "authors": "Kumar NB, Bahl S, Dhillon J, Poch M, Manley B, Li R, Schell M, Powsang J",
      "journal": "Cancers (Basel)"
    },
    {
      "title": "Polyphenon E Effects on Gene Expression in PC-3 Prostate Cancer Cells",
      "pubmed_id": "36430806",
      "pmc_id": "PMC9697490",
      "year": "2022",
      "publication_date": "2022 Nov",
      "authors": "Carastro LM, Vallebuona EJ, Cordova R, Gannon AN, Kim SJ, Costello CM, Declet-Bauzo RA, Kumar N, Park JY",
      "journal": "Int J Mol Sci"
    },
    {
      "title": "Effects of Green Tea Catechins on Prostate Cancer Chemoprevention: The Role of the Gut Microbiome",
      "pubmed_id": "36010981",
      "pmc_id": "PMC9406482",
      "year": "2022",
      "publication_date": "2022 Aug",
      "authors": "Kumar NB, Hogue S, Pow-Sang J, Poch M, Manley BJ, Li R, Dhillon J, Yu A, Byrd DA",
      "journal": "Cancers (Basel)"
    },
    {
      "title": "Intercepting Premalignant, Preinvasive Breast Lesions Through Vaccination",
      "pubmed_id": "34899753",
      "pmc_id": "PMC8652247",
      "year": "2021",
      "publication_date": "2021 Nov",
      "authors": "Zachariah NN, Basu A, Gautam N, Ramamoorthi G, Kodumudi KN, Kumar NB, Loftus L, Czerniecki BJ",
      "journal": "Front Immunol"
    },
    {
      "title": "The Promise of Nutrient-Derived Bioactive Compounds and Dietary Components to Ameliorate Symptoms of Chemotherapy-Related Cognitive Impairment in Breast Cancer Survivors",
      "pubmed_id": "34110516",
      "year": "2021",
      "publication_date": "2021 Jun",
      "authors": "Kumar NB",
      "journal": "CURR TREAT OPTION ON"
    },
    {
      "title": "The Florida Pancreas Collaborative Next-Generation Biobank: Infrastructure to Reduce Disparities and Improve Survival for a Diverse Cohort of Patients with Pancreatic Cancer",
      "pubmed_id": "33671939",
      "pmc_id": "PMC7919015",
      "year": "2021",
      "publication_date": "2021 Feb",
      "authors": "Permuth JB, Dezsi KB, Vyas S, Ali KN, Basinski TL, Utuama OA, Denbo JW, Klapman J, Dam A, Carballido E, Kim DW, Pimiento JM, Powers BD, Otto AK, Choi JW, Chen DT, Teer JK, Beato F, Ward A, Cortizas EM, Whisner SY, Williams IE, Riner AN, Tardif K, Velanovich V, Karachristos A, Douglas WG, Legaspi A, Allan BJ, Meredith K, Molina-Vega MA, Bao P, St Julien J, Huguet KL, Green L, Odedina FT, Kumar NB, Simmons VN, George TJ, Vadaparampil ST, Hodul PJ, Arnoletti JP, Awad ZT, Bose D, Jiang K, Centeno BA, Gwede CK, Malafa M, Judge SM, Judge AR, Jeong D, Bloomston M, Merchant NB, Fleming JB, Trevino JG",
      "journal": "Cancers (Basel)"
    }
  ],
  "grants": [
    {
      "description": "Title: Phase II Clinical Trial of GTC in Men on Active Surveillance  \nAward Number: 5R01CA235032-06  \nSponsor: National Cancer Institute (NCI)  \nKumar, N. (PD/PI)",
      "title": "Phase II Clinical Trial of GTC in Men on Active Surveillance",
      "award_number": "5R01CA235032-06",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Kumar, N.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/KumarNagi_1278.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=1278"
  },
  "content_hash": "25657df992b5ca0acb84a7f9e3e69725ce3a51ce97cd2505173fea587d0aeafa",
  "researcher_name": "Nagi Kumar",
  "department": "Cancer Epidemiology"
}