{
  "profile_url": "https://www.moffitt.org/research-science/researchers/natarajan-raghunand",
  "last_updated": "2025-10-19T00:27:51.225277",
  "researcher_id": "14306",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "Metabolism and Physiology",
  "research_program": "Molecular Medicine Program",
  "overview": "Quantitative image analytics and machine learning on radiologic and digital pathology images.",
  "research_interests": [
    "Dr. Natarajan Raghunand's research focus is on the development of clinically translatable radiologic biomarkers for the management of cancer. Collaborative clinical-translational research projects in his group include machine learning analysis of multiplexed immunofluorescence data from pre-operative biopsy tissue to predict upstaging of DCIS, deep learning to predict optimal dose maps for stereotactic radiosurgery of breast cancer metastases to the brain, prospective radiologic imaging in cancer clinical trials, and imaging biomarkers to guide adaptive therapy of recurrent high-grade glioma and metastatic Ewing sarcoma.\n  *"
  ],
  "associations": [
    "Metabolism and Physiology",
    "Molecular Medicine Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "Texas A&M University, PhD"
    },
    {
      "type": "Graduate",
      "institution": "Colorado State University, MS"
    }
  ],
  "publications": [
    {
      "title": "Weinfurtner RJ, Ataya D, Funaro K, Bhatt A, Abdalah M, Stringfield O, Raghunand N, Thompson Z, Lee MC, Czerniecki B, Muller AS, Soliman H, Han H. Quantitative habitat concentration analysis of triple negative breast cancer on MRI correlates with pathologic response to combination neoadjuvant immuno/chemotherapy. Clin Imaging",
      "pubmed_id": "40945432",
      "year": "2025",
      "journal": "127:110618",
      "authors": ""
    },
    {
      "title": "Mayfield JD, Ataya D, Abdalah M, Stringfield O, Bui MM, Raghunand N, Niell B, El Naqa I. Presurgical Upgrade Prediction of DCIS to Invasive Ductal Carcinoma Using Time-dependent Deep Learning Models with DCE MRI. Radiol Artif Intell",
      "pubmed_id": "38900042",
      "pmc_id": "PMC11427917",
      "year": "2024",
      "journal": "6(5):e230348",
      "authors": ""
    },
    {
      "title": "Arias-Lorza AM, Costello JR, Hingorani SR, Von Hoff DD, Korn RL, Raghunand N. Magnetic resonance imaging of tumor response to stroma-modifying pegvorhyaluronidase alpha (PEGPH20) therapy in early-phase clinical trials. Sci Rep",
      "pubmed_id": "38773189",
      "pmc_id": "PMC11109088",
      "year": "2024",
      "journal": "14(1):11570",
      "authors": ""
    },
    {
      "title": "Pandey S, Kutuk T, Abdalah MA, Stringfield O, Ravi H, Mills MN, Graham JA, Latifi K, Moreno WA, Ahmed KA, Raghunand N. Prediction of radiologic outcome-optimized dose plans and post-treatment magnetic resonance images: A proof-of-concept study in breast cancer brain metastases treated with stereotactic radiosurgery. Phys Imaging Radiat Oncol",
      "pubmed_id": "39040435",
      "pmc_id": "PMC11261135",
      "year": "2024",
      "journal": "31:100602",
      "authors": ""
    },
    {
      "title": "Jeong D, Morse B, Polk SL, Chen DT, Li J, Hodul P, Centeno BA, Costello J, Jiang K, Machado S, El Naqa I, Farah PT, Huynh T, Raghunand N, Mok S, Dam A, Malafa M, Qayyum A, Fleming JB, Permuth JB. Pancreatic Cyst Size Measurement on Magnetic Resonance Imaging Compared to Pathology. Cancers (Basel)",
      "pubmed_id": "38201633",
      "pmc_id": "PMC10778543",
      "year": "2024",
      "journal": "16(1)",
      "authors": ""
    },
    {
      "title": "Arias-Lorza AM, Costello JR, Hingorani SR, Von Hoff DD, Korn RL, Raghunand N. Tumor Response to Stroma-Modifying Therapy: Magnetic Resonance Imaging Findings in Early-Phase Clinical Trials of Pegvorhyaluronidase alpha (PEGPH20). Res Sq",
      "pubmed_id": "37720027",
      "pmc_id": "PMC10503830",
      "year": "2023",
      "authors": ""
    },
    {
      "title": "Ravi H, Hawkins SH, Stringfield O, Pereira M, Chen DT, Enderling H, Michael Yu HH, Arrington JA, Sahebjam S, Raghunand N. Rules-based Volumetric Segmentation of Multiparametric MRI for Response Assessment in Recurrent High-Grade Glioma. Res Sq",
      "pubmed_id": "37790451",
      "pmc_id": "PMC10543497",
      "year": "2023",
      "authors": ""
    },
    {
      "title": "Ravi H, Arias-Lorza AM, Costello JR, Han HS, Jeong DK, Klinz SG, Sachdev JC, Korn RL, Raghunand N. Pretherapy Ferumoxytol-enhanced MRI to Predict Response to Liposomal Irinotecan in Metastatic Breast Cancer. Radiol Imaging Cancer",
      "pubmed_id": "36734848",
      "pmc_id": "PMC10077095",
      "year": "2023",
      "journal": "5(2):e220022",
      "authors": ""
    },
    {
      "title": "Weinfurtner RJ, Abdalah M, Stringfield O, Ataya D, Williams A, Mooney B, Rosa M, Lee MC, Khakpour N, Laronga C, Czerniecki B, Diaz R, Ahmed K, Washington I, Latifi K, Niell B, Montejo M, Raghunand N. Quantitative Changes in Intratumoral Habitats on MRI Correlate With Pathologic Response in Early-stage ER/PR+ HER2− Breast Cancer Treated With Preoperative Stereotactic Ablative Body Radiotherapy. J Breast Imaging",
      "pubmed_id": "36686407",
      "pmc_id": "PMC9851176",
      "year": "2022",
      "journal": "4(3):273-284",
      "authors": ""
    },
    {
      "title": "Youssef I, Poch M, Raghunand N, Pow-Sang J, Johnstone PAS. Analysis of MRI radiomic pelvimetry and correlation with margin status after robotic prostatectomy. Can J Urol",
      "pubmed_id": "35150217",
      "year": "2022",
      "journal": "29(1):10976-10978",
      "authors": ""
    }
  ],
  "grants": [
    {
      "description": "Title: Radiomics and Pathomics to Predict Upstaging of DCIS  \nAward Number: 5R01CA249016-05  \nSponsor: National Cancer Institute (NCI)  \nNiell, B. (PD/PI), Raghunand, N. (PD/PI)",
      "source": "NCI",
      "period": "9016-05"
    },
    {
      "description": "Title: SOW#02: A Phase 1, Multicenter, Open-Label, Dose Escalation, and Dose Expansion Study to Assess the Safety, Tolerability, Pharmacokinetics, Pharmacodynamics, and Antitumor Activity of DCSZ11 as a Monotherapy in Patients with Advanced or Metastatic Solid Tumors  \nAward Number: SOW# 02  \nSponsor: IMAGING ENDPOINTS II, LLC  \nRaghunand, N. (PD/PI)"
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/RaghunandNatarajan_14306.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=14306"
  },
  "content_hash": "1e48234d6a65410bd28a9c543c639fd7119daa4aa4654cf63b4bc4de68041863",
  "researcher_name": "Natarajan Raghunand",
  "department": "Metabolism and Physiology"
}