{
  "profile_url": "https://www.moffitt.org/research-science/researchers/nate-parker/",
  "last_updated": "2025-11-21T22:50:26.060237",
  "researcher_id": "29407",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "health outcomes and behavior",
  "research_program": "health outcomes & behavior",
  "overview": "Dr. Parker conducts behavioral research in exercise oncology.",
  "research_interests": [
    "Dr. Parker’s research focuses on designing and evaluating exercise interventions, particularly involving resistance training, to improve cancer treatment outcomes and cancer survivorship.\n  *"
  ],
  "associations": [
    "Health Outcomes and Behavior",
    "Gastrointestinal Oncology",
    "Health Outcomes & Behavior Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of Texas School of Public Health, MPH"
    },
    {
      "type": "Graduate",
      "institution": "University of Houston, PhD"
    }
  ],
  "publications": [
    {
      "title": "The Impact of Edema on Skeletal Muscle Changes among Patients with Pancreatic Ductal Adenocarcinoma",
      "pubmed_id": "40553455",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Davis EW, Park MA, Basinski TL, Arnoletti JP, Bloomston M, Carson TL, Biachi De Castria T, Chen DT, Cortizas EM, Crowder SL, Genilo-Delgado M, Douglas WG, Huguet KL, Jiang K, Hodul PJ, Karolak A, Kim DW, Koomen JM, Menon AA, Mo Q, Mok SR, Molina-Vega MA, Moreno-Urazan L, Ahmed S, Parker NH, Pimiento JM, Rasool G, Sparks LM, Stewart PA, Tassielli AF, Teer JK, Trevino JG, Velanovich V, Wang X, Whelan CJ, Judge SM, Judge AR, Fleming JB, Malafa MP, Jeong D, Permuth JB",
      "journal": "Cancer Epidemiol Biomarkers Prev"
    },
    {
      "title": "A retrospective cohort study of physical activity and survival in patients treated with immune checkpoint inhibitors",
      "pubmed_id": "40971247",
      "pmc_id": "PMC12579459",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Parker NH, Ramos JD, Tarhini AA, Schell MJ, Egan KM, Kanetsky PA",
      "journal": "Cancer Epidemiol Biomarkers Prev"
    },
    {
      "title": "Multimodal AI-driven Biomarker for Early Detection of Cancer Cachexia",
      "pubmed_id": "41001462",
      "pmc_id": "PMC12458964",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Ahmed S, Parker N, Park M, Davis EW, Jeong D, Permuth JB, Schabath MB, Yilmaz Y, Rasool G",
      "journal": "medRxiv"
    },
    {
      "title": "Resistance exercise combined with protein supplementation for skeletal muscle mass in people with pancreatic cancer undergoing neoadjuvant chemotherapy: Study protocol for the REBUILD trial",
      "pubmed_id": "40315221",
      "pmc_id": "PMC12047797",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Gonzalo-Encabo P, Gardiner J, Norris MK, Wilson RL, Normann AJ, Nguyen D, Parker N, Tjogas D, Brais LK, Meyerhardt JA, Rosenthal MH, Wolpin BM, Uno H, Dieli-Conwright CM",
      "journal": "PLoS One"
    },
    {
      "title": "Correction: Park et al",
      "pubmed_id": "40149388",
      "pmc_id": "PMC11941415",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Park MA, Whelan CJ, Ahmed S, Boeringer T, Brown J, Carson TL, Crowder SL, Gage K, Gregg C, Jeong DK, Jim HSL, Judge AR, Mason TM, Parker N, Pillai S, Qayyum A, Rajasekhara S, Rasool G, Tinsley SM, Schabath MB, Stewart P, West J, McDonald P, Permuth JB",
      "journal": "Defining and Addressing Research Priorities in Cancer Cachexia through Transdisciplinary Collaboration"
    },
    {
      "title": "Nutrition in head and neck cancer care: a roadmap and call for research",
      "pubmed_id": "40449504",
      "year": "2025",
      "publication_date": "2025 Jun",
      "authors": "Chen X, Beilman B, Gibbs HD, Hamilton JL, Parker N, Bur AM, Caudell JJ, Gan GN, Hamilton-Reeves JM, Jim HSL, Kirtane K, Lominska C, Crowder SL, Arthur AE",
      "journal": "Lancet Oncol"
    },
    {
      "title": "Sarcopenia and Skeletal Muscle Loss after CAR T-cell Therapy in Diffuse Large B-cell Lymphoma",
      "pubmed_id": "40238583",
      "pmc_id": "PMC12213223",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Jhaveri K, Thapa R, Ercan D, Saha A, Noble J, Singh P, Fahrmann J, Saini N, Wu R, Dennison JB, Hanash S, Jenq RR, Modi K, Figura N, Chavez J, Shah B, Nishihori T, Lazaryan A, Khimani F, Bachmeier C, Gage K, Mishra A, Perna F, Davila ML, Spiegel J, Rejeski K, Subklewe M, Locke FL, Freeman C, Parker N, Jain MD",
      "journal": "Clin Cancer Res"
    },
    {
      "title": "Feasibility, Acceptability, and Outcomes of Project Rally: Pilot Study of a YMCA-Based Pickleball Program for Cancer Survivors",
      "pubmed_id": "39942445",
      "pmc_id": "PMC11817839",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Parker NH, de Cerqueira Santos A, Mintrone R, Turner K, Sutton SK, O'Connor T, Huang J, Lael M, Cruff S, Grassia K, De Vera MT, Bean M, Carmella R, Vadaparampil ST, Vidrine JI",
      "journal": "Healthcare (Basel)"
    },
    {
      "title": "Cancer-Related Cognitive Impairment and the Potential of Dietary Interventions for the Prevention and Mitigation of Neurodegeneration",
      "pubmed_id": "39570793",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Crowder SL, Gudenkauf LM, Hoogland AI, Han HS, Small BJ, Carson TL, Parker NH, Booth-Jones M, Jim HSL",
      "journal": "Cancer Res"
    },
    {
      "title": "Race-based differences in serum biomarkers for cancer-associated cachexia in a diverse cohort of patients with pancreatic ductal adenocarcinoma",
      "pubmed_id": "39989973",
      "pmc_id": "PMC11844656",
      "year": "2025",
      "publication_date": "2025 Feb",
      "authors": "Permuth J, Park M, Davis E, Alhassan S, Arnoletti J, Basinski T, McKee A, Bloomston M, Carson T, de Castria TB, Chen DT, Cortizas E, Crowder S, Delgado MG, Douglas W, Fleming J, Hodul P, Huguet K, Jiang K, Kim DW, Koomen J, Luthra A, Malafa M, Menon A, Morales R, Merchant N, Meredith K, Mo Q, Molina-Vega M, Moreno-Urazan L, Olumoyin K, Parker N, Pimiento J, Rasool G, Rejniak K, Sansil S, Sparks L, Stewart P, Tassielli A, Teer J, Tran DV, Trevino J, Velanovich V, Whelan C, Jeong D, Judge S, Judge A",
      "journal": "Res Sq"
    }
  ],
  "grants": [
    {
      "description": "Title: Exercise Prehabilitation for Locoregional Esophageal Cancer  \nAward Number: N/A  \nSponsor: SALGI ESOPHAGEAL CANCER RESEAR  \nParker, N. (PD/PI), Pimiento, J. (Co-PD/PI)",
      "title": "Exercise Prehabilitation for Locoregional Esophageal Cancer",
      "sponsor": "SALGI ESOPHAGEAL CANCER RESEAR",
      "investigators": [
        {
          "name": "Parker, N.",
          "role": "PD/PI"
        },
        {
          "name": "Pimiento, J.",
          "role": "Co-PD/PI"
        }
      ]
    },
    {
      "description": "Title: Tele-Resistance Training During Chemotherapy for Advanced Upper Gastrointestinal Cancer  \nAward Number: 5K22CA262352-03  \nSponsor: National Cancer Institute (NCI)  \nParker, N. (PD/PI)",
      "title": "Tele-Resistance Training During Chemotherapy for Advanced Upper Gastrointestinal Cancer",
      "award_number": "5K22CA262352-03",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Parker, N.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: AI-Driven Early Detection of Cachexia in Pancreatic Cancer and Feasibility of Diet and Exercise Interventions  \nAward Number: 25C62  \nSponsor: Florida Department of Health  \nRasool, G. (PD/PI), Parker, N. (Co-PD/PI), Permuth, J. (Co-PD/PI), Shafer, S. (Co-PD/PI)",
      "title": "AI-Driven Early Detection of Cachexia in Pancreatic Cancer and Feasibility of Diet and Exercise Interventions",
      "award_number": "25C62",
      "sponsor": "Florida Department of Health",
      "investigators": [
        {
          "name": "Rasool, G.",
          "role": "PD/PI"
        },
        {
          "name": "Parker, N.",
          "role": "Co-PD/PI"
        },
        {
          "name": "Permuth, J.",
          "role": "Co-PD/PI"
        },
        {
          "name": "Shafer, S.",
          "role": "Co-PD/PI"
        }
      ]
    }
  ],
  "participating_trials": [
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-21742/",
      "trial_id": "21742",
      "title": "Remote Resistance Exercise Powering Survivors- Gastrointestinal Oncology (Remote REPS-:GI)",
      "condition": "Gastrointestinal Tumor",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23088/",
      "trial_id": "23088",
      "title": "Remote Exercise and Nutritional Prehabilitation for Pancreatic Cancer: A Randomized Pilot Study",
      "condition": "Gastrointestinal Tumor",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23121/",
      "trial_id": "23121",
      "title": "Exercise Prehabilitation for Locoregional Esophageal Cancer: A Pilot Study",
      "condition": "Gastrointestinal Tumor",
      "status": "Open"
    }
  ],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/ParkerNate_29407.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=29407"
  },
  "content_hash": "f9e54efc25a53fdc34e3bdb8056d35857d52434d3daeec2330cf2716684d6b0d",
  "researcher_name": "nate parker",
  "department": "health outcomes & behavior"
}