{
  "profile_url": "https://www.moffitt.org/research-science/researchers/peter-kanetsky",
  "last_updated": "2025-10-21T16:35:27.655866",
  "researcher_id": "13006",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "Cancer Epidemiology",
  "research_program": "Cancer Epidemiology Program",
  "overview": "Dr. Kanetsky investigates genetic and non-genetic risk factors for development, progression, and/or treatment response for melanoma and testicular germ cell tumors. He also leads intervention studies to assess precision prevention for skin cancer.",
  "research_interests": [
    "Dr. Kanetsky has made seminal contributions to our understanding of melanoma and testicular germ cell tumors. Melanoma is a potentially lethal form of skin cancer and is the sixth most diagnosed cancer in Floridians. The high level of sun exposure, the most important environmental risk factor for melanoma, in the Sunshine State is partially responsible for the escalating occurrence of melanoma, especially among young adults. Increasing prevention behaviors such as responsible sun seeking and skin examinations can help ebb the rising tide of melanoma diagnoses, and Dr. Kanetsky’s research seeks to determine whether knowledge of genetics can affect melanoma risk behaviors. Testicular germ cell cancers are the most common cancer in men between the ages of 15 and 35. Although highly treatable, standard chemotherapies have unpleasant and sometimes severe adverse consequences that can lead to decreased quality of life among these young men. Dr. Kanetsky plays a leadership role in an international genetic research consortium that addresses a spectrum of scientific questions focused on testicular germ cell tumors to better serve this adolescent and young adult male population. Dr. Kanetsky’s research projects encompass the investigation of (i) inherited genetic factors and sun exposure on risk of melanoma and melanoma-related traits, (ii) influence of genes on survival outcomes among melanoma patients treated with immunotherapy, (iii) whether knowledge of genetic susceptibility affects positive change in melanoma risk reduction behaviors, and (iv) inherited genetics and risk of testicular germ cell tumors, tumor-related phenotypes, and survival outcomes.\n  *"
  ],
  "associations": [
    "Cancer Epidemiology",
    "Cutaneous Oncology",
    "Cancer Epidemiology Program",
    "Melanoma & Skin Cancer Center of Excellence"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "Columbia University School of Public Health, MPH"
    },
    {
      "type": "Graduate",
      "institution": "Columbia University, PhD"
    },
    {
      "type": "Fellowship",
      "institution": "University of Pennsylvania",
      "specialty": "Biostatistics and Epidemiology"
    }
  ],
  "publications": [
    {
      "title": "Association of Inherited Genetic Variants with Multiple Primary Melanoma",
      "pubmed_id": "40036058",
      "pmc_id": "PMC12067251",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Gibbs DC, Small BM, Autuori I, Leong SF, Ali E, Kenney J, Luo L, Kanetsky PA, Busam KJ, Cust AE, Anton-Culver H, Gallagher RP, Zanetti R, Rosso S, Sacchetto L, Edmiston SN, Conway K, Ollila DW, Begg CB, Berwick M, Orlow I, Thomas NE",
      "journal": "Cancer Epidemiol Biomarkers Prev"
    },
    {
      "title": "Identification of genes associated with testicular germ cell tumor susceptibility through a transcriptome-wide association study",
      "pubmed_id": "39999848",
      "pmc_id": "PMC11947167",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Ugalde-Morales E, Wilf R, Pluta J, Ploner A, Fan M, Damra M, Aben KK, Anson-Cartwright L, Chen C, Cortessis VK, Daneshmand S, Ferlin A, Gamulin M, Gietema JA, Gonzalez-Niera A, Grotmol T, Hamilton RJ, Harland M, Haugen TB, Hauser R, Hildebrandt MAT, Karlsson R, Kiemeney LA, Kim J, Lessel D, Lothe RA, Loveday C, Chanock SJ, McGlynn KA, Meijer C, Nead KT, Nsengimana J, Popovic M, Rafnar T, Richiardi L, Rocca MS, Schwartz SM, Skotheim RI, Stefansson K, Stewart DR, Turnbull C, Vaughn DJ, Winge SB, Zheng T, Monteiro AN, Almstrup K, Kanetsky PA, Nathanson KL, Wiklund F",
      "journal": "Am J Hum Genet"
    },
    {
      "title": "Association of MC1R variants with melanoma risk and interaction with sun exposure: An M-SKIP project",
      "pubmed_id": "39425518",
      "pmc_id": "PMC12008258",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Stefanaki I, D'Ecclesiis O, Vignati S, Gaeta A, Kypreou K, Caini S, Gandini S, Nagore E, Sera F, Botta F, Newton-Bishop J, Polsky D, Lazovich D, Kanetsky PA, Puig S, Gruis NA, Landi MT, Fargnoli MC, Stratigos A, Guida G, Ghiorzo P, Menin C, García-Borrón JC, Little J, Nan H, Raimondi S",
      "journal": "J Eur Acad Dermatol Venereol"
    },
    {
      "title": "Racial/ethnic differences in trends of testicular germ cell tumor incidence in the United States, 1992-2021",
      "pubmed_id": "39760469",
      "pmc_id": "PMC11702318",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Almeida AA, Wojt A, Metayer C, Kanetsky PA, Graubard BI, Alvarez CS, McGlynn KA",
      "journal": "Cancer"
    },
    {
      "title": "Changes in Skin Cancer-Related Behaviors, Distress, and Beliefs in Response to Receipt of Low- to Moderate-Penetrance Genetic Test Results for Skin Cancer Risk",
      "pubmed_id": "39682213",
      "pmc_id": "PMC11640494",
      "year": "2024",
      "publication_date": "2024 Nov",
      "authors": "Khadka M, Lacson JCA, Sutton SK, Kim Y, Vadaparampil ST, Soto-Torres B, Hay JL, Kanetsky PA",
      "journal": "Cancers (Basel)"
    },
    {
      "title": "Influence of the COVID-19 pandemic on sun habits of patients with melanoma: a cross-sectional study",
      "pubmed_id": "38787523",
      "year": "2024",
      "publication_date": "2024 May",
      "authors": "Trepanowski N, Hathaway CA, Chang MS, Hay JL, Samatham R, Geller AC, Swetter SM, Tworoger SS, Kanetsky PA, Leachman SA, Hartman RI",
      "journal": "Arch Dermatol Res"
    },
    {
      "title": "Germline Exome Sequencing for Men with Testicular Germ Cell Tumor Reveals Coding Defects in Chromosomal Segregation and Protein-targeting Genes",
      "pubmed_id": "37246069",
      "pmc_id": "PMC10676450",
      "year": "2024",
      "publication_date": "2024 Apr",
      "authors": "Pyle LC, Kim J, Bradfield J, Damrauer SM, D'Andrea K, Einhorn LH, Godse R, Hakonarson H, Kanetsky PA, Kember RL, Jacobs LA, Maxwell KN, Rader DJ, Vaughn DJ, Weathers B, Wubbenhorst B, Regeneron Genetics Center Research Team, Cancer Genomics Research Laboratory, Greene MH, Nathanson KL, Stewart DR",
      "journal": "Eur Urol"
    },
    {
      "title": "Skin cancer prevention behaviors, beliefs, distress, and worry among hispanics in Florida and Puerto Rico",
      "pubmed_id": "37957686",
      "pmc_id": "PMC10644628",
      "year": "2023",
      "publication_date": "2023 Nov",
      "authors": "Lacson JCA, Soto-Torres B, Sutton SK, Doyle SH, Kim Y, Roetzheim RG, Vadaparampil ST, Kanetsky PA",
      "journal": "BMC Public Health"
    },
    {
      "title": "Sex-Specific Associations of MDM2 and MDM4 Variants with Risk of Multiple Primary Melanomas and Melanoma Survival in Non-Hispanic Whites",
      "pubmed_id": "37345045",
      "pmc_id": "PMC10216616",
      "year": "2023",
      "publication_date": "2023 May",
      "authors": "Ward SV, Autuori I, Luo L, LaPilla E, Yoo S, Sharma A, Busam KJ, Olilla DW, Dwyer T, Anton-Culver H, Zanetti R, Sacchetto L, Cust AE, Gallagher RP, Kanetsky PA, Rosso S, Begg CB, Berwick M, Thomas NE, Orlow I",
      "journal": "Cancers (Basel)"
    },
    {
      "title": "Recruiting African American Prostate Cancer Survivors for a Population-based Biobank Study",
      "pubmed_id": "36958853",
      "pmc_id": "PMC10308568",
      "year": "2023",
      "publication_date": "2023 Jun",
      "authors": "Li X, Roy S, Damonte J, Park HY, Hoogland AI, Jamison K, Komrokji KR, Yeo CD, Kim Y, Dhillon J, Gudenkauf LM, Oswald LB, Jim HSL, Yamoah K, Pow-Sang JM, Kanetsky PA, Gwede CK, Park JY, Gonzalez BD",
      "journal": "Cancer Epidemiol Biomarkers Prev"
    }
  ],
  "grants": [
    {
      "description": "Title: A Hybrid Effectiveness-Implementation Trial to Integrate Precision Skin Cancer Risk Feedback in Federally Qualified Health Centers  \nAward Number: 5R01CA291735-02  \nSponsor: National Cancer Institute (NCI)  \nKanetsky, P. (PD/PI)",
      "title": "A Hybrid Effectiveness-Implementation Trial to Integrate Precision Skin Cancer Risk Feedback in Federally Qualified Health Centers",
      "award_number": "5R01CA291735-02",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Kanetsky, P.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Cancer and Non-Cancer Pleiotropic Effects of a Melanoma Polygenic Risk Score  \nAward Number: NA  \nSponsor: Moffitt Cancer Center  \nKanetsky, P. (PD/PI), Wang, X. (Co-PD/PI)",
      "title": "Cancer and Non-Cancer Pleiotropic Effects of a Melanoma Polygenic Risk Score",
      "award_number": "NA",
      "sponsor": "Moffitt Cancer Center",
      "investigators": [
        {
          "name": "Kanetsky, P.",
          "role": "PD/PI"
        },
        {
          "name": "Wang, X.",
          "role": "Co-PD/PI"
        }
      ]
    },
    {
      "description": "Title: Post Genome-wide Association Studies in Testicular Germ Cell Tumors  \nAward Number: 5U01CA164947-09  \nSponsor: National Cancer Institute (NCI)  \nKanetsky, P. (PD/PI)",
      "title": "Post Genome-wide Association Studies in Testicular Germ Cell Tumors",
      "award_number": "5U01CA164947-09",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Kanetsky, P.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/KanetskyPeter_13006.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=13006"
  },
  "content_hash": "eb1f8b0bda67af14ac6dd77d9324b4151828a6eb57e6dc8984afdd7e85e855e0",
  "researcher_name": "Peter Kanetsky",
  "department": "Cancer Epidemiology"
}