{
  "profile_url": "https://www.moffitt.org/research-science/researchers/philippe-spiess/",
  "last_updated": "2025-11-21T22:50:26.401653",
  "researcher_id": "4110",
  "degrees": [
    "MD"
  ],
  "title": "",
  "primary_program": "genitourinary oncology",
  "research_program": "molecular medicine",
  "overview": "My main areas of research interests include developing novel therapeutic agents in the management of locally advanced and metastatic renal carcinoma.",
  "research_interests": [
    "My main areas of research interests include developing novel therapeutic agents in the management of locally advanced and metastatic renal carcinoma. As well, I have interests in developing multi-modality therapeutic strategies in the management of locally advanced and locally recurrent prostate cancer, with the aim of optimizing treatment outcomes while minimizing morbidity.\n  *"
  ],
  "associations": [
    "Genitourinary Oncology",
    "Tumor Microenvironment and Metastasis",
    "Center for Immunization & Infection Research in Cancer",
    "Cancer Chemoprevention Research Interest Group",
    "Molecular Medicine Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "McGill University, Montreal, Canada, MS"
    },
    {
      "type": "Medical School",
      "institution": "University of Toronto, Ontario, Canada",
      "degree": "MD"
    },
    {
      "type": "Residency",
      "institution": "McGill University, Montreal, Canada",
      "specialty": "Urology"
    },
    {
      "type": "Fellowship",
      "institution": "University of Texas MD Anderson Cancer Center, Houston, TX",
      "specialty": "Urologic Oncology"
    }
  ],
  "publications": [
    {
      "title": "Cisplatin-ineligible patients with muscle-invasive bladder cancer demonstrate poor long-term survival following immediate radical cystectomy",
      "pubmed_id": "40932312",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Fazili A, Jazayeri SB, Rose KM, Guske C, Wen L, Durant A, Prunty M, Bukavina L, Tyson MD, Grass GD, Xu H, Spiess PE, Gilbert SM, Sexton WJ, Zemp L, Pessoa RR, Poch M, Lerner SP, Li R",
      "journal": "BJU Int"
    },
    {
      "title": "Evaluating the Evolving Treatment Landscape of Systemic Therapies in Penile Cancer",
      "pubmed_id": "41008800",
      "pmc_id": "PMC12468617",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Jaime-Casas S, Barragan-Carrillo R, Eskenazi F, Dugarte JP, Chahoud J, Spiess PE, Medina LG",
      "journal": "Cancers (Basel)"
    },
    {
      "title": "Low-grade non-muscle-invasive bladder cancer: molecular landscape, treatment strategies and emerging therapies",
      "pubmed_id": "40931081",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Wen L, Miyagi H, Spiess PE, Yu A, Mendelsohn CL, Tan WS, Psutka SP, Lerner SP, Cheng L, Dyrskjøt L, Meeks JJ, Shariat SF, Gontero P, Pradere B, Steinberg GD, Kamat AM, Li R",
      "journal": "Nat Rev Urol"
    },
    {
      "title": "Impact of Systemic Therapy for Renal Cell Carcinoma With a Tumor Thrombus: Results From the Intercontinental Collaboration on Renal Cell Carcinoma Database",
      "pubmed_id": "41125506",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Sandberg M, Russell G, Feldman D, Hayes M, David RB, Miller J, Patel K, Aljabi B, Byun SS, Faba OR, Cannoletta D, Letowski T, Villoldo G, Marchinena PG, Mourao T, Ciancio G, Peyton CC, Zanotti R, Chang S, Spiess PE, Mehrazin R, Abreu D, Zequi SC, Rodriguez A",
      "journal": "Clin Genitourin Cancer"
    },
    {
      "title": "Management and optimization of chronic renal insufficiency in the setting of kidney cancer A Systematic Review",
      "pubmed_id": "40658472",
      "pmc_id": "PMC12539876",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Cobb JK, Miyagi H, Chahoud J, Bassil C, Spiess PE",
      "journal": "Int Braz J Urol"
    },
    {
      "title": "Feasibility and Functional Reactivity of Expanded Tumor-infiltrating Lymphocytes from Non-clear-cell Renal Cell Carcinoma",
      "pubmed_id": "40962596",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Potez M, Jazayeri SB, Guske C, Miller J, Ali J, Carter M, Khambati F, Dhillon J, Sexton W, Zemp L, Manley B, Souza GR, Spiess PE, Beatty M, Pilon-Thomas S, Chahoud J",
      "journal": "Eur Urol"
    },
    {
      "title": "The opportunities and barriers for developing tumour-infiltrating lymphocyte therapy for patients with advanced genitourinary cancers",
      "pubmed_id": "41006825",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Potez M, Roman Souza G, Spiess PE, Pilon-Thomas S, Chahoud J",
      "journal": "Nat Rev Urol"
    },
    {
      "title": "Standardization of Radiation Therapy to Inguinal and Pelvic Lymph Nodes in Locally Advanced Cancer of the Penis, as Defined by the International Penile Advanced Cancer Trial (InPACT)",
      "pubmed_id": "40180061",
      "pmc_id": "PMC12396133",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Cooper S, Nicholson S, Crook J, Watkin N, Pettaway C, Barber J, Mitra A, Woodley O, Millin A, Hall E, Pathmanathan A, Penegar S, Burnett S, Spiess P, Miles E, Hoffman K, Yang H, Tree AC",
      "journal": "Int J Radiat Oncol Biol Phys"
    },
    {
      "title": "Computational Histology Artificial Intelligence (CHAI) Enhances Risk Stratification of High-grade Ta Non-muscle-invasive Bladder Cancer in a Multicenter Cohort: Comparison to Current European Association of Urology and American Urological Association Stra",
      "pubmed_id": "40514253",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Chang SS, Launer B, Narayan V, Patil D, O'Donnell MA, Hensley PJ, Taylor JA, Li R, Fernandez MI, Zhang H, Krishna V, Vrabac D, Abuzeid WM, Nimgaonkar V, Watson D, Royce TJ, Kiedrowski LA, Joshi A, Konety BR, Spiess PE, Williams SB, Packiam VT, Kamat AM, Lotan Y, Daneshmand S",
      "journal": "Eur Urol"
    },
    {
      "title": "Predictors and Patterns of Nonurothelial Recurrence After Nephroureterectomy for Upper Tract Urothelial Carcinoma (UCAN Collaboration)",
      "pubmed_id": "40526449",
      "pmc_id": "PMC12355653",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Katims AB, Tin AL, Assel M, Hensley P, Li R, Margulis V, Matin S, Pallauf M, Clark RK, Raman JD, Singla N, Spiess PE, Coleman J",
      "journal": "J Urol"
    }
  ],
  "grants": [
    {
      "description": "Title: Advancements in HPV-related Penile Cancer  \nAward Number: N/A  \nSponsor: R.S. EVANS FOUNDATION  \nSpiess, P. (PD/PI)",
      "title": "Advancements in HPV-related Penile Cancer",
      "sponsor": "R.S. EVANS FOUNDATION",
      "investigators": [
        {
          "name": "Spiess, P.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": ""
    }
  ],
  "participating_trials": [
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-19319/",
      "trial_id": "19319",
      "title": "InPACT- International Penile Advanced Cancer Trial (International Rare Cancers Initiative Study)",
      "condition": "Genitourinary",
      "intervention": "Ifosfamide (); Not Applicable (); Radiotherapy (); Taxol (paclitaxel); cisplatin (); paclitaxel ()",
      "status": "Open"
    }
  ],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/SpiessPhilippe_4110.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=4110"
  },
  "content_hash": "3c4a1f1c602a9dc706f29c0eb1a9d39a6b71c607a751ac54d89542f4799101fa",
  "researcher_name": "philippe spiess",
  "department": "tumor microenvironment and metastasis"
}