{
  "profile_url": "https://www.moffitt.org/research-science/researchers/philippe-spiess",
  "last_updated": "2025-10-21T16:38:50.144262",
  "researcher_id": "4110",
  "degrees": [
    "MD"
  ],
  "title": "",
  "primary_program": "Genitourinary Oncology",
  "research_program": "Molecular Medicine Program",
  "overview": "My main areas of research interests include developing novel therapeutic agents in the management of locally advanced and metastatic renal carcinoma.",
  "research_interests": [
    "My main areas of research interests include developing novel therapeutic agents in the management of locally advanced and metastatic renal carcinoma. As well, I have interests in developing multi-modality therapeutic strategies in the management of locally advanced and locally recurrent prostate cancer, with the aim of optimizing treatment outcomes while minimizing morbidity.\n  *"
  ],
  "associations": [
    "Genitourinary Oncology",
    "Tumor Microenvironment and Metastasis",
    "Center for Immunization & Infection Research in Cancer",
    "Cancer Chemoprevention Research Interest Group",
    "Molecular Medicine Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "McGill University, Montreal, Canada, MS"
    },
    {
      "type": "Medical School",
      "institution": "University of Toronto, Ontario, Canada",
      "degree": "MD"
    },
    {
      "type": "Residency",
      "institution": "McGill University, Montreal, Canada",
      "specialty": "Urology"
    },
    {
      "type": "Fellowship",
      "institution": "University of Texas MD Anderson Cancer Center, Houston, TX",
      "specialty": "Urologic Oncology"
    }
  ],
  "publications": [
    {
      "title": "Cisplatin-ineligible patients with muscle-invasive bladder cancer demonstrate poor long-term survival following immediate radical cystectomy",
      "pubmed_id": "40932312",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Fazili A, Jazayeri SB, Rose KM, Guske C, Wen L, Durant A, Prunty M, Bukavina L, Tyson MD, Grass GD, Xu H, Spiess PE, Gilbert SM, Sexton WJ, Zemp L, Pessoa RR, Poch M, Lerner SP, Li R",
      "journal": "BJU Int"
    },
    {
      "title": "Low-grade non-muscle-invasive bladder cancer: molecular landscape, treatment strategies and emerging therapies",
      "pubmed_id": "40931081",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Wen L, Miyagi H, Spiess PE, Yu A, Mendelsohn CL, Tan WS, Psutka SP, Lerner SP, Cheng L, Dyrskjøt L, Meeks JJ, Shariat SF, Gontero P, Pradere B, Steinberg GD, Kamat AM, Li R",
      "journal": "Nat Rev Urol"
    },
    {
      "title": "Standardization of Radiation Therapy to Inguinal and Pelvic Lymph Nodes in Locally Advanced Cancer of the Penis, as Defined by the International Penile Advanced Cancer Trial (InPACT)",
      "pubmed_id": "40180061",
      "pmc_id": "PMC12396133",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Cooper S, Nicholson S, Crook J, Watkin N, Pettaway C, Barber J, Mitra A, Woodley O, Millin A, Hall E, Pathmanathan A, Penegar S, Burnett S, Spiess P, Miles E, Hoffman K, Yang H, Tree AC",
      "journal": "Int J Radiat Oncol Biol Phys"
    },
    {
      "title": "Management and optimization of chronic renal insufficiency in the setting of kidney cancer A Systematic Review",
      "pubmed_id": "40658472",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Cobb JK, Miyagi H, Chahoud J, Bassil C, Spiess PE",
      "journal": "Int Braz J Urol"
    },
    {
      "title": "Human papillomavirus vaccination and its effect on genital men's health",
      "pubmed_id": "40898707",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Barrera Cardenas JC, Spiess PE, García-Perdomo HA",
      "journal": "Considerations for a public health strategy"
    },
    {
      "title": "Computational Histology Artificial Intelligence (CHAI) Enhances Risk Stratification of High-grade Ta Non-muscle-invasive Bladder Cancer in a Multicenter Cohort: Comparison to Current European Association of Urology and American Urological Association Stra",
      "pubmed_id": "40514253",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Chang SS, Launer B, Narayan V, Patil D, O'Donnell MA, Hensley PJ, Taylor JA, Li R, Fernandez MI, Zhang H, Krishna V, Vrabac D, Abuzeid WM, Nimgaonkar V, Watson D, Royce TJ, Kiedrowski LA, Joshi A, Konety BR, Spiess PE, Williams SB, Packiam VT, Kamat AM, Lotan Y, Daneshmand S",
      "journal": "Eur Urol"
    },
    {
      "title": "Predictors and Patterns of Nonurothelial Recurrence After Nephroureterectomy for Upper Tract Urothelial Carcinoma (UCAN Collaboration)",
      "pubmed_id": "40526449",
      "pmc_id": "PMC12355653",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Katims AB, Tin AL, Assel M, Hensley P, Li R, Margulis V, Matin S, Pallauf M, Clark RK, Raman JD, Singla N, Spiess PE, Coleman J",
      "journal": "J Urol"
    },
    {
      "title": "Oncologic and survival outcomes in patients undergoing radical nephroureterectomy with preoperative or iatrogenic dialysis dependence",
      "pubmed_id": "40754548",
      "year": "2025",
      "publication_date": "2025 Nov",
      "authors": "Lee MS, Hensley PJ, Igel D, Li R, Clark RK, Bingham N, Pallauf M, Thapa P, Boorjian SA, Raman JD, Singla N, Coleman J, Margulis V, Spiess PE, Matin SF, Potretzke AM",
      "journal": "Urol Oncol"
    },
    {
      "title": "Neoadjuvant toripalimab plus nimotuzumab combined with taxol-based chemotherapy in locally advanced penile squamous cell carcinoma",
      "pubmed_id": "40215977",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "An X, Guo SJ, Yan R, Xue T, Xiong LB, Ma HL, Xue C, Zhang YC, Li JB, Chen MT, Li ZS, Liu TY, Zhang ZL, Dong P, Li YH, Yao K, Hu ZQ, Chen XF, Luo JX, Lei YH, Liang PY, Liu ZZ, Qi L, Xu WF, Cao ZG, Chen NH, Li X, Sheng XN, Luo GH, Shi BK, Xie Q, Liu ZW, Zhou FJ, Spiess PE, Shi YX, Han H",
      "journal": "Cancer Cell"
    },
    {
      "title": "Authors' Reply to the Letter to the Editor by May et al: Optimized Prognostic Stratification in PSCC",
      "pubmed_id": "40340844",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Chahoud J, Spiess PE",
      "journal": "J Natl Compr Canc Ne"
    }
  ],
  "grants": [
    {
      "description": "Title: Advancements in HPV-related Penile Cancer  \nAward Number: N/A  \nSponsor: R.S. EVANS FOUNDATION  \nSpiess, P. (PD/PI)",
      "title": "Advancements in HPV-related Penile Cancer",
      "sponsor": "R.S. EVANS FOUNDATION",
      "investigators": [
        {
          "name": "Spiess, P.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": ""
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/SpiessPhilippe_4110.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=4110"
  },
  "content_hash": "4c8ddc57f4b5ce524da4109dc48dbab2dee3a34b283fde4b51d122e48a9585a8",
  "researcher_name": "Philippe Spiess",
  "department": "Tumor Microenvironment and Metastasis"
}