{
  "profile_url": "https://www.moffitt.org/research-science/researchers/rachid-baz/",
  "last_updated": "2025-11-21T22:50:26.475105",
  "researcher_id": "4646",
  "degrees": [
    "MD"
  ],
  "title": "",
  "primary_program": "malignant hematology",
  "research_program": "molecular medicine",
  "overview": "Dr. Baz’s research is to develop and investigate new therapeutic agents for the treatment of patients with multiple myeloma.",
  "research_interests": [
    "Dr. Baz is a very active researcher in the field and specifically, he has an interest in clinical trials investigating new agents for patients with relapsed and refractory multiple myeloma. In addition, Dr. Baz collaborates closely with many different investigators within the Moffitt Myeloma Working Group (MMWG) and within the myeloma scientific community in general with the goal of improving outcomes of patients with plasma cell dyscrasias. For example, most of the currently approved agents in the myeloma field have been evaluated at Moffitt in phase I and II clinical trials.\n  *"
  ],
  "associations": [
    "Malignant Hematology",
    "Pentecost Family Myeloma Research Center",
    "Molecular Medicine Program"
  ],
  "education": [
    {
      "type": "Medical School",
      "institution": "American University of Beirut",
      "degree": "MD"
    },
    {
      "type": "Residency",
      "institution": "Cleveland Clinic Foundation",
      "position": "Intern",
      "specialty": "al Medicine"
    },
    {
      "type": "Residency",
      "institution": "Cleveland Clinic Foundation",
      "specialty": "Hematology and Medical Oncology"
    },
    {
      "type": "Board Certification",
      "institution": "Internal Medicine",
      "certification": "Hematology"
    }
  ],
  "publications": [
    {
      "title": "Target antigen and plasma cell phenotype are critical factors for sensitivity to response-adapted daratumumab therapy",
      "pubmed_id": "40983035",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Meads MB, Zhao X, Noyes DR, Sudalagunta P, Achille A, Zhang C, Renatino Canevarolo R, Silva M, Magaletti D, DeAvila D, Toska S, Oates A, Lastorino D, Idiaquez DW, Song J, Sansil S, Yoder SJ, Grajales-Cruz AF, Blue BJ, Freeman CL, Kim J, Alsina M, Brayer J, Siqueira Silva A, Song X, Shain KH, Baz RC",
      "journal": "Blood"
    },
    {
      "title": "Genomics Define Malignant Transformation in Myeloma Precursor Conditions",
      "pubmed_id": "41061199",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Maura F, Bergsagel PL, Ziccheddu B, Kumar S, Maclachlan K, Derkach A, Garces JJ, Firestone R, Braggio E, Asmann Y, Durante M, Diamond BT, Papadimitriou M, Hultcrantz M, Marella A, Castellano G, Maeda A, Lionetti M, Matera A, Pioggia S, Da Vià MC, de Magistris C, Leongamornlert D, DeAvila D, Sudalagunta PR, Canevarolo RR, Siegel EM, Agius P, Teer J, McPherson A, Yamashita Y, Silva AS, Blaney P, Baz R, Patel KK, Campbell P, Morgan G, Fonseca R, Landgren O, Orlowski RZ, Shain KH, Bolli N, Usmani S, Rajkumar SV",
      "journal": "J Clin Oncol"
    },
    {
      "title": "NCCN Guidelines® Insights: Multiple Myeloma, Version 1",
      "pubmed_id": "40340857",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Kumar SK, Callander NS, Adekola K, Anderson LD, Baljevic M, Baz R, Campagnaro E, Costello C, D'Angelo C, Derman B, Devarakonda S, Elsedawy N, Godara A, Godby K, Hillengass J, Holmberg L, Htut M, Huff CA, Hultcrantz M, Kang Y, Larson S, Lee HC, Liedtke M, Martin T, Omel J, Robinson T, Rosenberg A, Schroeder MA, Sherbenou D, Suvannasankha A, Valent J, Varshavsky-Yanovsky AN, Vogl D, Kovach E, Kumar R"
    },
    {
      "title": "Teclistamab for patients with heavily pretreated relapsed/refractory multiple myeloma and renal impairment",
      "pubmed_id": "40198766",
      "pmc_id": "PMC12274829",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Dima D, Afrough A, Goel U, Grajales-Cruz A, Khouri J, Julian K, Pasvolsky O, Banerjee R, Razzo B, Ferreri CJ, Vazquez Martinez MA, Davis JA, Sannareddy A, Castaneda Puglianini O, Raza S, Portuguese AJ, Gaballa MR, Rana M, Lieberman-Cribbin A, DeJarnette S, Gonzalez R, Chen A, Herr MM, Mikkilineni L, Hosoya H, Ouchveridze E, Kaur G, Rossi AC, Shune L, Anwer F, Lin Y, Richard S, Sborov DW, Baz RC, Garfall A, Lee HC, Anderson LD, Cowan AJ, Patel KK, Voorhees PM, Sidana S, Susanibar-Adaniya SP, Hansen DK, Atrash S",
      "journal": "Blood Adv"
    },
    {
      "title": "Cytopenias and infections following ciltacabtagene autoleucel in heavily-pretreated relapsed or refractory multiple myeloma",
      "pubmed_id": "40637727",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Dima D, Logue JM, Waqar SHB, Peres LC, Colin-Leitzinger CM, De Avila G, Smith EC, Skelson L, Matte KL, Blue B, Hovanky VN, Gaballa M, Pasvolsky O, Oswald LB, Fortuna GGM, Wagner CB, DeJarnette S, Dillard C, Perna F, Mikkilineni L, Hosoya H, Freeman CL, Shain KH, Baz RC, Grajales-Cruz A, Puglianini OC, Alsina M, Locke FL, Shune LO, Sborov DW, Patel KK, Sidana S, Hansen DK",
      "journal": "Haematologica"
    },
    {
      "title": "The Functional Transcriptomic Landscape Informs Therapeutic Strategies in Multiple Myeloma",
      "pubmed_id": "39476082",
      "pmc_id": "PMC11733535",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Sudalagunta PR, Canevarolo RR, Meads MB, Silva M, Zhao X, Cubitt CL, Sansil SS, DeAvila G, Alugubelli RR, Bishop RT, Tungesvik A, Zhang Q, Hampton O, Teer JK, Welsh EA, Yoder SJ, Shah BD, Hazlehurst L, Gatenby RA, Van Domelen DR, Chai Y, Wang F, DeCastro A, Bloomer AM, Siegel EM, Lynch CC, Sullivan DM, Alsina M, Nishihori T, Brayer J, Cleveland JL, Dalton W, Walker CJ, Landesman Y, Baz R, Silva AS, Shain KH",
      "journal": "Cancer Res"
    },
    {
      "title": "Enhanced CAR-T cell function and mitochondrial fitness from earlier unfractionated stem cell product in multiple myeloma",
      "pubmed_id": "40253586",
      "pmc_id": "PMC12461620",
      "year": "2025",
      "publication_date": "2025 Aug",
      "authors": "Freeman CL, Abraham-Miranda J, Menges M, Atkins RM, Noble J, Liu H, Corallo S, Cuadrado Delgado LA, Ribickas AJ, Savid-Frontera C, de Avila G, Castaneda Puglianini OA, Ochoa-Bayona J, Hansen DK, Alsina M, Baz R, Nishihori T, Shain KH, Locke FL",
      "journal": "Mol Ther"
    },
    {
      "title": "Cardiovascular adverse events and outcomes after anti-BCMA CAR-T for relapsed and refractory multiple myeloma",
      "pubmed_id": "40229239",
      "pmc_id": "PMC11997198",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Palfi S, Peres LC, Koelmeyer H, Alsina M, Baz RC, Blue BJ, Corallo S, De Avila G, Freeman C, Gonzalez R, Grajales-Cruz A, Harvey K, Liu HD, Nishihori T, Oliveira GH, Oswald LB, Castaneda Puglianini O, Selvakumar S, Sharma AB, Wang E, Shain KH, Jain M, Locke FL, Alomar M, Hansen DK, Lee DH",
      "journal": "Blood Cancer J"
    },
    {
      "title": "Tumor burden quantified by soluble B-cell maturation antigen and metabolic tumor volume determines myeloma CAR-T outcomes",
      "pubmed_id": "39652773",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Freeman CL, Noble J, Menges M, Villanueva R, Nakashima JY, Figura NB, Tonseth RP, Idiaquez DW, Skelson L, Smith EC, Abraham-Miranda J, Corallo S, De Avila G, Castaneda Puglianini O, Liu HD, Alsina M, Nishihori T, Shain KH, Baz RC, Blue BJ, Grajales-Cruz A, Koomen JM, Atkins RM, Hansen DK, Siqueira Silva A, Kim J, Balagurunathan Y, Locke FL",
      "journal": "Blood"
    },
    {
      "title": "Epigenetic Plasticity Drives Carcinogenesis and Multi-Therapy Resistance in Multiple Myeloma",
      "pubmed_id": "40321765",
      "pmc_id": "PMC12048002",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Renatino Canevarolo R, Sudalagunta PR, Meads MB, Silva M, Zhao X, Magaletti D, Alugubelli RR, DeAvila G, Persi E, Maura F, Bell ET, Bishop RT, Cubitt CL, Sansil SS, Zhang W, Teer JK, Teng M, Yoder SJ, Siegel EM, Shah BD, Nishihori T, Hazlehurst LA, Lynch CC, Landgren O, Hampton O, Gatenby RA, Sullivan DM, Brayer JB, Dalton WS, Cleveland JL, Alsina M, Baz R, Shain KH, Silva AS",
      "journal": "Res Sq"
    }
  ],
  "grants": [
    {
      "description": "Title: Educational Program on the Implementation and Therapy Management of B-cell Maturation Antigen (BCMA) targeting Bi-Specific Antibodies in Relapsed Myeloma in Florida and Puerto Rico  \nAward Number: 99517835  \nSponsor: PFIZER INC.  \nAlsina, M. (PD/PI), Baz, R. (Co-PD/PI)",
      "title": "Educational Program on the Implementation and Therapy Management of B-cell Maturation Antigen (BCMA) targeting Bi-Specific Antibodies in Relapsed Myeloma in Florida and Puerto Rico",
      "award_number": "99517835",
      "sponsor": "PFIZER INC.",
      "investigators": [
        {
          "name": "Alsina, M.",
          "role": "PD/PI"
        },
        {
          "name": "Baz, R.",
          "role": "Co-PD/PI"
        }
      ]
    },
    {
      "description": "Title: A Multi-omic evaluation of Carfilzomib-related Cardiotoxicity  \nAward Number: 1R01HL151659  \nSponsor: National Heart, Lung, and Blood Institute (NHLBI)  \nBaz, R. (PD/PI)",
      "title": "A Multi-omic evaluation of Carfilzomib-related Cardiotoxicity",
      "award_number": "1R01HL151659",
      "sponsor": "National Heart, Lung, and Blood Institute (NHLBI)",
      "investigators": [
        {
          "name": "Baz, R.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "participating_trials": [],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/BazRachid_4646.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=4646"
  },
  "content_hash": "903d8610a9d6305a3f1774929a534ef65ef2b9a5e1e2665a6b63c9db0778a023",
  "researcher_name": "rachid baz",
  "department": ""
}