{
  "profile_url": "https://www.moffitt.org/research-science/researchers/robert-haile",
  "last_updated": "2025-10-21T16:35:49.643875",
  "researcher_id": "unknown",
  "degrees": [],
  "title": "",
  "primary_program": "Cancer Epidemiology",
  "research_program": "Cancer Epidemiology Program",
  "overview": "Cancer epidemiology. Genetic epidemiology. Cancer disparities.",
  "research_interests": [
    "I have been conducting cancer research for 35 years, with a focus on cancer epidemiology, genetic epidemiology, and most recently cancer disparities. My interest at Moffitt is developing major initiatives that move population sciences towards intervention trials and translational impact. The first four grant applications that will be submitted are on the following topics: 1) Cancer Grand Challenge on Cancer Avoidance, with colleagues from Moffitt, Harvard, Oxford, and the DKFZ (German CAncer REsearch Center) in Heidelberg; 2) large R01 to establish a multi-institutional registry of Lynch Syndrome families who have been historically understudied (rural, low SES White, Hispanic, African American) to support future intervention trials to increase cascade testing, uptake of genetic counseling, screening, pan-cancer early detection tests, and vaccine trials; 3) intervention trials focused on MASLD and MASH, precursor conditions to liver cancer that are associated with metabolic disorder and obesity; 4) self-sampling of HPV as part of a strategy to prevent cervical cancer or detect it early (goal is for Moffitt to lead a statewide effort)..\n  *"
  ],
  "associations": [
    "Cancer Epidemiology",
    "Cancer Epidemiology Program"
  ],
  "education": [],
  "publications": [
    {
      "title": "Clinical Applications of Minimal Residual Disease Assessments by Tumor-Informed and Tumor-Uninformed Circulating Tumor DNA in Colorectal Cancer",
      "pubmed_id": "34572774",
      "pmc_id": "PMC8471730",
      "year": "2021",
      "publication_date": "2021 Sep",
      "authors": "Gong J, Hendifar A, Gangi A, Zaghiyan K, Atkins K, Nasseri Y, Murrell Z, Figueiredo JC, Salvy S, Haile R, Hitchins M",
      "journal": "Cancers (Basel)"
    },
    {
      "title": "Development of a DNA Methylation-Based Diagnostic Signature to Distinguish Benign Oncocytoma From Renal Cell Carcinoma",
      "pubmed_id": "33015531",
      "pmc_id": "PMC7529536",
      "year": "2020",
      "publication_date": "2020 Sep",
      "authors": "Brennan K, Metzner TJ, Kao CS, Massie CE, Stewart GD, Haile RW, Brooks JD, Hitchins MP, Leppert JT, Gevaert O",
      "journal": "JCO Precis Oncol"
    },
    {
      "title": "Methylated SEPTIN9 plasma test for colorectal cancer detection may be applicable to Lynch syndrome",
      "pubmed_id": "31275589",
      "pmc_id": "PMC6577308",
      "year": "2019",
      "publication_date": "2019 May",
      "authors": "Hitchins MP, Vogelaar IP, Brennan K, Haraldsdottir S, Zhou N, Martin B, Alvarez R, Yuan X, Kim S, Guindi M, Hendifar AE, Kalady MF, DeVecchio J, Church JM, de la Chapelle A, Hampel H, Pearlman R, Christensen M, Snyder C, Lanspa SJ, Haile RW, Lynch HT",
      "journal": "BMJ Open Gastroenterol"
    },
    {
      "title": "A systematic review of studies of DNA methylation in the context of a weight loss intervention",
      "pubmed_id": "28517981",
      "year": "2017",
      "publication_date": "2017 May",
      "authors": "Aronica L, Levine AJ, Brennan K, Mi J, Gardner C, Haile RW, Hitchins MP",
      "journal": "Epigenomics"
    },
    {
      "title": "",
      "authors": ""
    }
  ],
  "grants": [
    {
      "description": "Title: Discovery and verification of methylated circulating tumor DNA markers for the detection of colorectal cancer in subjects under 50 years of age  \nAward Number: 7R01CA252042-05  \nSponsor: National Institutes of Health (NIH)  \nHaile, R. (PD/PI), Hitchins, M. (PD/PI)",
      "title": "Discovery and verification of methylated circulating tumor DNA markers for the detection of colorectal cancer in subjects under 50 years of age",
      "award_number": "7R01CA252042-05",
      "sponsor": "National Institutes of Health (NIH)",
      "source": "NIH",
      "investigators": [
        {
          "name": "Haile, R.",
          "role": "PD/PI"
        },
        {
          "name": "Hitchins, M.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/HaileRobert_42708.jpg",
  "contact": {},
  "content_hash": "7191801164a50a9304e2064d275a790f34fe6aa5f953c3ffddc049f5b1e9d218",
  "researcher_name": "Robert Haile",
  "department": "Cancer Epidemiology"
}