{
  "profile_url": "https://www.moffitt.org/research-science/researchers/roger-li",
  "last_updated": "2025-10-21T16:40:06.549850",
  "researcher_id": "20904",
  "degrees": [
    "MD"
  ],
  "title": "",
  "primary_program": "Genitourinary Oncology",
  "research_program": "Immuno-Oncology Program",
  "overview": "My research interest is in the conduct of investigational clinical trials in urothelial cancer and translational research to identify potential biomarkers to inform therapeutic efficacy. My current research builds upon my past achievements and aims to identify clinically actionable biomarkers to predict treatment response as well as to leverage the insights generated to design more innovative and efficacious therapies.",
  "research_interests": [
    "To achieve this, I am leveraging samples collected from several clinical trials I led employing novel therapeutic strategies in patients with muscle invasive bladder cancer, BCG unresponsive CIS-containing NMIBC, as well as intermediate risk NMIBC.\n  *"
  ],
  "associations": [
    "Genitourinary Oncology",
    "Immunology",
    "Immuno-Oncology Program"
  ],
  "education": [
    {
      "type": "Medical School",
      "institution": "University of California, Irvine School of Medicine",
      "degree": "MD"
    },
    {
      "type": "Internship",
      "institution": "Loma Linda University Medical Center"
    },
    {
      "type": "Residency",
      "institution": "Loma Linda University Medical Center",
      "specialty": ""
    },
    {
      "type": "Fellowship",
      "institution": "University of Texas, MD Anderson Cancer Center",
      "specialty": ""
    }
  ],
  "publications": [
    {
      "title": "Cisplatin-ineligible patients with muscle-invasive bladder cancer demonstrate poor long-term survival following immediate radical cystectomy",
      "pubmed_id": "40932312",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Fazili A, Jazayeri SB, Rose KM, Guske C, Wen L, Durant A, Prunty M, Bukavina L, Tyson MD, Grass GD, Xu H, Spiess PE, Gilbert SM, Sexton WJ, Zemp L, Pessoa RR, Poch M, Lerner SP, Li R",
      "journal": "BJU Int"
    },
    {
      "title": "Low-grade non-muscle-invasive bladder cancer: molecular landscape, treatment strategies and emerging therapies",
      "pubmed_id": "40931081",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Wen L, Miyagi H, Spiess PE, Yu A, Mendelsohn CL, Tan WS, Psutka SP, Lerner SP, Cheng L, Dyrskjøt L, Meeks JJ, Shariat SF, Gontero P, Pradere B, Steinberg GD, Kamat AM, Li R",
      "journal": "Nat Rev Urol"
    },
    {
      "title": "The association between prior pelvic radiotherapy for cancer and surgical outcomes in patients undergoing radical cystectomy for bladder cancer: An analysis of national surgical quality improvement program targeted cystectomy database",
      "pubmed_id": "41006132",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Titus RS, Mundra V, Velasquez EL, Xu J, Riveros C, Ranganathan S, Porika A, Reddy R, Kaushik D, Kukreja J, Li R, Wallis CJD, Satkunasivam R",
      "journal": "Urol Oncol"
    },
    {
      "title": "Cost-effectiveness Analysis of Treatments for Bacillus Calmette-Guérin-unresponsive Carcinoma in Situ of the Bladder",
      "pubmed_id": "41046180",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Myers AA, Talwar R, Duan Z, Hensley P, Lotan Y, Williams SB, Luckenbaugh AN, Li R, Kassouf W, Necchi A, Packiam VT, Shore N, Steinberg GD, Witjes JA, Schmidt B, Porten S, Hahn NM, Bree KK, Toumazis I, Zhao H, Kamat AM",
      "journal": "Eur Urol"
    },
    {
      "title": "Intermediate-risk Non-muscle-invasive Bladder Cancer: Recommendations for Definitions, Risk Stratification, Management Strategies, and Clinical Trial Design from the International Bladder Cancer Group",
      "pubmed_id": "41076366",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Li R, Hensley PJ, Babjuk M, Bukavina L, Psutka SP, Lerner SP, O'Donnell MA, Lotan Y, Bree KK, Redorta JP, McConkey DJ, Lee BH, Mariappan P, Mertens LS, Soloway MS, Svatek RS, Tan WS, Williams SB, Gupta S, Buckley R, Kamat AM",
      "journal": "Eur Urol Oncol"
    },
    {
      "title": "Re: Thomas Dreyer, Simone Brandt, Knud Fabrin, et al",
      "pubmed_id": "41107180",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Jazayeri B, Wang X, Li R",
      "journal": "Use of the Xpert Bladder Cancer Monitor Urinary Biomarker Test for Guiding Cystoscopy in High-grade Non-muscle-invasive Bladder Cancer: Results from the Randomized Controlled DaBlaCa-"
    },
    {
      "title": "Computational Histology Artificial Intelligence (CHAI) Enhances Risk Stratification of High-grade Ta Non-muscle-invasive Bladder Cancer in a Multicenter Cohort: Comparison to Current European Association of Urology and American Urological Association Stra",
      "pubmed_id": "40514253",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Chang SS, Launer B, Narayan V, Patil D, O'Donnell MA, Hensley PJ, Taylor JA, Li R, Fernandez MI, Zhang H, Krishna V, Vrabac D, Abuzeid WM, Nimgaonkar V, Watson D, Royce TJ, Kiedrowski LA, Joshi A, Konety BR, Spiess PE, Williams SB, Packiam VT, Kamat AM, Lotan Y, Daneshmand S",
      "journal": "Eur Urol"
    },
    {
      "title": "Predictors and Patterns of Nonurothelial Recurrence After Nephroureterectomy for Upper Tract Urothelial Carcinoma (UCAN Collaboration)",
      "pubmed_id": "40526449",
      "pmc_id": "PMC12355653",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Katims AB, Tin AL, Assel M, Hensley P, Li R, Margulis V, Matin S, Pallauf M, Clark RK, Raman JD, Singla N, Spiess PE, Coleman J",
      "journal": "J Urol"
    },
    {
      "title": "Oncologic and survival outcomes in patients undergoing radical nephroureterectomy with preoperative or iatrogenic dialysis dependence",
      "pubmed_id": "40754548",
      "year": "2025",
      "publication_date": "2025 Nov",
      "authors": "Lee MS, Hensley PJ, Igel D, Li R, Clark RK, Bingham N, Pallauf M, Thapa P, Boorjian SA, Raman JD, Singla N, Coleman J, Margulis V, Spiess PE, Matin SF, Potretzke AM",
      "journal": "Urol Oncol"
    },
    {
      "title": "The Financial Burden of Localized and Metastatic Bladder Cancer",
      "pubmed_id": "39730299",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Scilipoti P, Moschini M, Li R, Lerner SP, Black PC, Necchi A, Rouprêt M, Shariat SF, Gupta S, Morgans AK, Psutka SP, Kamat AM",
      "journal": "Eur Urol"
    }
  ],
  "grants": [
    {
      "description": "Title: Clinical Risk Stratification and Tumor Heterogeneity Assessment in Upper Tract Urothelial Carcinoma  \nAward Number: 1447186  \nSponsor: American Urological Association (AUA)  \nDi N. (PD/PI), Li, R. ()",
      "title": "Clinical Risk Stratification and Tumor Heterogeneity Assessment in Upper Tract Urothelial Carcinoma",
      "award_number": "1447186",
      "sponsor": "American Urological Association (AUA)  \nDi N. (PD/PI),",
      "investigators": [
        {
          "name": "Li, R.",
          "role": ""
        }
      ]
    },
    {
      "description": "Title: A Phase 1 Study of CG0070 in Intermediate Risk Non-Muscle Invasive Bladder Cancer  \nAward Number: BCAN CDA  \nSponsor: BLADDER CANCER ADVOCACY NETWOR  \nLi, R. (PD/PI)",
      "title": "A Phase 1 Study of CG0070 in Intermediate Risk Non-Muscle Invasive Bladder Cancer",
      "award_number": "BCAN CDA",
      "sponsor": "BLADDER CANCER ADVOCACY NETWOR",
      "investigators": [
        {
          "name": "Li, R.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Identifying Histopathologic and Molecular Characteristics that Predicts Recurrence in Low Grade Non-Muscle Invasive Bladder Cancer  \nAward Number: N/A  \nSponsor: HOPE FOUNDATION  \nLi, R. (PD/PI)",
      "title": "Identifying Histopathologic and Molecular Characteristics that Predicts Recurrence in Low Grade Non-Muscle Invasive Bladder Cancer",
      "sponsor": "HOPE FOUNDATION",
      "investigators": [
        {
          "name": "Li, R.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: The Role of ctDNA in the Management of Urothelial Cancer  \nAward Number: 21VA019-AR1, Second Amendment  \nSponsor: PREDICINE, INC  \nLi, R. (PD/PI)",
      "title": "The Role of ctDNA in the Management of Urothelial Cancer",
      "award_number": "21VA019-AR1, Second Amendment",
      "sponsor": "PREDICINE, INC",
      "investigators": [
        {
          "name": "Li, R.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Identifying Risk Factors for Progression and Recurrence in NMIBC Using Artificial Intelligence  \nAward Number: 22VA014-S2  \nSponsor: VALAR LABS INC  \nLi, R. (PD/PI)",
      "title": "Identifying Risk Factors for Progression and Recurrence in NMIBC Using Artificial Intelligence",
      "award_number": "22VA014-S2",
      "sponsor": "VALAR LABS INC",
      "investigators": [
        {
          "name": "Li, R.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Impact of Tertiary Lymphoid Structures (TLSs) in Oncolytic Virus-Induced Tumor Elimination  \nAward Number: HT94252510568  \nSponsor: Department of Defense (DOD)  \nLi, R. (PD/PI)",
      "title": "Impact of Tertiary Lymphoid Structures (TLSs) in Oncolytic Virus-Induced Tumor Elimination",
      "award_number": "HT94252510568",
      "sponsor": "Department of Defense (DOD)",
      "source": "DOD",
      "investigators": [
        {
          "name": "Li, R.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Urinary ctDNA for Bladder Cancer Monitoring  \nAward Number: NA  \nSponsor: Moffitt Cancer Center  \nLi, R. (PD/PI)",
      "title": "Urinary ctDNA for Bladder Cancer Monitoring",
      "award_number": "NA",
      "sponsor": "Moffitt Cancer Center",
      "investigators": [
        {
          "name": "Li, R.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Decoding the Resistance Mechanisms to Oncolytic Virotherapy in Muscle Invasive Bladder Cancer  \nAward Number: W81XWH-22-1-0395  \nSponsor: Department of Defense (DOD)  \nLi, R. (PD/PI)",
      "title": "Decoding the Resistance Mechanisms to Oncolytic Virotherapy in Muscle Invasive Bladder Cancer",
      "award_number": "W81XWH-22-1-0395",
      "sponsor": "Department of Defense (DOD)",
      "source": "DOD",
      "investigators": [
        {
          "name": "Li, R.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/LiRoger_20904.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=20904"
  },
  "content_hash": "3082059b8d0989d14304353a5a5b33d4c261272433b3fbcb3d7a97b218c6e9ce",
  "researcher_name": "Roger Li",
  "department": "Immunology"
}