{
  "profile_url": "https://www.moffitt.org/research-science/researchers/sara-tinsley-vance/",
  "last_updated": "2025-11-21T22:50:26.779222",
  "researcher_id": "unknown",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "",
  "research_program": "health outcomes & behavior",
  "overview": "My research career is centered around improving the quality of life for individuals and their families with hematologic malignancies. I am working on a National Institute of Nursing Research Institute-supported career development award (K23) to develop a quality-of-life decision-making model for older adults with acute myeloid leukemia. My next step is testing the model in a randomized controlled trial to investigate whether it improves goal-concordant care through shared decision-making. Other research includes the study of sex differences in health-related quality of life and symptoms among patients diagnosed with a hematologic malignancy.",
  "research_interests": [
    "My research interests include health-related quality of life among patients diagnosed with hematologic malignancies and how this can inform shared decision-making between the patient, their caregivers, and the healthcare team. I am analyzing data from ~ 200 patients measured over six time points during treatment to build a model for sharing with prospective patients. Other areas of research include sex-related differences in quality of life and symptoms and cancer -related cachexia and sarcopenia.\n  *"
  ],
  "associations": [
    "Health Outcomes & Behavior Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of South Florida, PhD"
    },
    {
      "type": "Graduate",
      "institution": "University of South Florida, MS"
    }
  ],
  "publications": [
    {
      "title": "Advancing drug development in myelodysplastic syndromes",
      "pubmed_id": "39786387",
      "pmc_id": "PMC11914162",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Mina A, McGraw KL, Cunningham L, Kim N, Jen EY, Calvo KR, Ehrlich LA, Aplan PD, Garcia-Manero G, Foran JM, Garcia JS, Zeidan AM, DeZern AE, Komrokji RS, Sekeres MA, Scott BL, Buckstein RJ, Tinsley-Vance S, Verma A, Wroblewski T, Pavletic SZ, Norsworthy KJ",
      "journal": "Blood Adv"
    },
    {
      "title": "Correction: Park et al",
      "pubmed_id": "40149388",
      "pmc_id": "PMC11941415",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Park MA, Whelan CJ, Ahmed S, Boeringer T, Brown J, Carson TL, Crowder SL, Gage K, Gregg C, Jeong DK, Jim HSL, Judge AR, Mason TM, Parker N, Pillai S, Qayyum A, Rajasekhara S, Rasool G, Tinsley SM, Schabath MB, Stewart P, West J, McDonald P, Permuth JB",
      "journal": "Defining and Addressing Research Priorities in Cancer Cachexia through Transdisciplinary Collaboration"
    },
    {
      "title": "Cost-Utility Analysis of a Group Mindfulness Program Compared to an Education Support Program for Breast Cancer Survivors With Cognitive Impairment: Evidence From a Randomized Controlled Trial",
      "pubmed_id": "40696563",
      "year": "2025",
      "publication_date": "2025 Jul",
      "authors": "Meng H, Lengacher CA, Tate R, Rodríguez C, Kip KE, Park JY, Hueluer G, Nguyen AT, Morgan S, Tinsley S, Veal B, Joshi A, Krothapalli M, Nidamanur S, Cox C, Padgett LS, Moscoso M, Bornstein E, Lucas JM, Fonseca T, Donovan KA, Chamkeri R, Reich RR",
      "journal": "Psychooncology"
    },
    {
      "title": "Efficacy of Mindfulness-Based Stress Reduction for Breast Cancer (MBSR(BC)) a Treatment for Cancer-related Cognitive Impairment (CRCI): A Randomized Controlled Trial",
      "pubmed_id": "39291332",
      "pmc_id": "PMC11839530",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Lengacher CA, Reich RR, Rodriguez CS, Nguyen AT, Park JY, Meng H, Tinsley S, Hueluer G, Donovan KA, Moscoso MS, Bornstein E, Kiluk J, Nidamanur S, Padgett LS, Lucas JM, Fonseca T, Joshi A, Lin KJ, Goodman M, Kip KE",
      "journal": "J Integr Complement Med"
    },
    {
      "title": "A Randomized Clinical Trial of Mindfulness-Based Stress Reduction Program Among Breast Cancer Survivors Post-Treatment: Evaluating Mediators of Cognitive Improvement",
      "pubmed_id": "39711191",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Lengacher CA, Hueluer G, Wang JR, Reich RR, Meng H, Park JY, Kip KE, Morgan S, Joshi A, Tinsley S, Krothapalli M, Nidamanur S, Cox C, Kiluk J, Lucas JM, Fonseca T, Moscoso MS, Bornstein E, Donovan KA, Padgett LS, Chamkeri R, Patel D, Hornback E, Rodríguez CCS",
      "journal": "J Integr Complement Med"
    },
    {
      "title": "The Moderating Role of Genetics on the Effectiveness of the Mindfulness-Based Stress Reduction for Breast Cancer (MBSR(BC)) Program on Cognitive Impairment",
      "pubmed_id": "39413359",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Park JY, Lengacher CA, Rodriguez CS, Meng H, Kip KE, Morgan S, Joshi A, Hueluer G, Wang JR, Tinsley S, Cox C, Kiluk J, Donovan KA, Moscoso M, Bornstein E, Lucas JM, Fonseca T, Krothapalli M, Padgett LS, Nidamanur S, Hornback E, Patel D, Chamkeri R, Reich RR",
      "journal": "Biol Res Nurs"
    },
    {
      "title": "Data-driven, harmonised classification system for myelodysplastic syndromes: a consensus paper from the International Consortium for Myelodysplastic Syndromes",
      "pubmed_id": "39393368",
      "year": "2024",
      "publication_date": "2024 Nov",
      "authors": "Komrokji RS, Lanino L, Ball S, Bewersdorf JP, Marchetti M, Maggioni G, Travaglino E, Al Ali NH, Fenaux P, Platzbecker U, Santini V, Diez-Campelo M, Singh A, Jain AG, Aguirre LE, Tinsley-Vance SM, Schwabkey ZI, Chan O, Xie Z, Brunner AM, Kuykendall AT, Bennett JM, Buckstein R, Bejar R, Carraway HE, DeZern AE, Griffiths EA, Halene S, Hasserjian RP, Lancet J, List AF, Loghavi S, Odenike O, Padron E, Patnaik MM, Roboz GJ, Stahl M, Sekeres MA, Steensma DP, Savona MR, Taylor J, Xu ML, Sweet K, Sallman DA, Nimer SD, Hourigan CS, Wei AH, Sauta E, D'Amico S, Asti G, Castellani G, Delleani M, Campagna A, Borate UM, Sanz G, Efficace F, Gore SD, Kim TK, Daver N, Garcia-Manero G, Rozman M, Orfao A, Wang SA, Foucar MK, Germing U, Haferlach T, Scheinberg P, Miyazaki Y, Iastrebner M, Kulasekararaj A, Cluzeau T, Kordasti S, van de Loosdrecht AA, Ades L, Zeidan AM, Della Porta MG",
      "journal": "Lancet Haematol"
    },
    {
      "title": "Lived experiences of lymphoma patients with sexual dysfunction and related sexual distress during cancer treatment",
      "year": "2024",
      "publication_date": "2024 Nov",
      "authors": "Durosier Mertilus DS, Rodriguez CS, Lengacher CA, Donovan KA, Sokol L, Tinsley-Vance SM, Szalacha LA",
      "journal": "Discov Public Health"
    },
    {
      "title": "Defining and Addressing Research Priorities in Cancer Cachexia through Transdisciplinary Collaboration",
      "pubmed_id": "39001427",
      "pmc_id": "PMC11240731",
      "year": "2024",
      "publication_date": "2024 Jun",
      "authors": "Park MA, Whelan CJ, Ahmed S, Boeringer T, Brown J, Crowder SL, Gage K, Gregg C, Jeong DK, Jim HSL, Judge AR, Mason TM, Parker N, Pillai S, Qayyum A, Rajasekhara S, Rasool G, Tinsley SM, Schabath MB, Stewart P, West J, McDonald P, Permuth JB",
      "journal": "Cancers (Basel)"
    },
    {
      "title": "Patterns of lower risk myelodysplastic syndrome progression: factors predicting progression to high-risk myelodysplastic syndrome and acute myeloid leukemia",
      "pubmed_id": "38299605",
      "pmc_id": "PMC11215361",
      "year": "2024",
      "publication_date": "2024 Jul",
      "authors": "Jain AG, Ball S, Aguirre L, Al Ali N, Kaldas D, Tinsley-Vance S, Kuykendall A, Chan O, Sweet K, Lancet JE, Padron E, Sallman DA, Komrokji R",
      "journal": "Haematologica"
    }
  ],
  "grants": [
    {
      "description": "Title: Predictors of Quality of Life in Patients with Chronic Lymphocytic Leukemia  \nAward Number: N/A  \nSponsor: NCCN  \nTinsley V. (PD/PI)",
      "title": "Predictors of Quality of Life in Patients with Chronic Lymphocytic Leukemia",
      "sponsor": "NCCN  \nTinsley V. (PD/PI)"
    }
  ],
  "participating_trials": [
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-22696/",
      "trial_id": "22696",
      "title": "Specialty Compared to Oncology Delivered Palliative Care for Patients with Acute Myeloid Leukemia SCOPE-Leukemia",
      "condition": "Malignant Hematology",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23558/",
      "trial_id": "23558",
      "title": "Predictors of Health-Related Quality of Life in Adults with Chronic Lymphocytic Leukemia or Small Lymphocytic Lymphoma.",
      "condition": "Malignant Hematology",
      "status": "Open"
    }
  ],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/TinsleyVanceSara_2298.jpg",
  "contact": {},
  "content_hash": "54b064146fd73873b236ad769681e14fa925d823551df5e43ead9e77a65b237b",
  "researcher_name": "sara tinsley vance",
  "department": ""
}