{
  "profile_url": "https://www.moffitt.org/research-science/researchers/sonam-puri/",
  "last_updated": "2025-11-21T22:50:26.920713",
  "researcher_id": "unknown",
  "degrees": [
    "MD"
  ],
  "title": "",
  "primary_program": "thoracic oncology",
  "research_program": "molecular medicine",
  "overview": "My clinical and research interest within thoracic oncology include clinical and translational research in small cell and EGFR mutation positive lung cancer.",
  "research_interests": [
    "My research interests include 1. Designing and conducting clinical trials for novel targeted therapies and immunotherapies in lung cancer. Over the past five years, I have advanced my expertise as a clinical investigator in lung cancer, playing key roles in multiple clinical studies. A notable experience was my critical role in the \"Osi + Ipi study,\" a phase 1 trial of Osimertinib and ipilimumab in EGFR-mutated NSCLC I was instrumental in-patient recruitment, regulatory coordination, and data analysis, leading to the successful completion of study accrual in February 2024. Building on this, I spearheaded an investigator-initiated phase 1 study integrating tumor-treating fields into therapy for locally advanced/stage III NSCLC. As the principal investigator at the Huntsman Cancer Institute (HCI), I led the project from protocol development to securing FDA IDE approval, with the trial activating in March 2024. I am now extending this work at MCC, continuing as the site PI while collaborating with translational and basic science teams to advance our understanding of lung cancer biology. 2. Engaging with biotechnology partners to explore new technologies to deepen our understanding of disease progression and improve prognostic accuracy in patients with lung cancer eg of research in this area include CNSide for CSF-derived tumor cells and FitBit® for prognosis assessment. 3. Improving our understanding of molecular Subtyping and innovative therapeutics for Small Cell Lung Cancer In addition to my work in NSCLC, I have a strong interest in SCLC. I have led multi-institutional collaborations with Dr. Owonikoko (University of Maryland), Dr. Oliver (Duke University), and Dr. Liu (Georgetown University), focusing on the molecular subtyping of high-grade neuroendocrine malignancies, including both lung and extrapulmonary small cell carcinoma. I have presented the data from these collaborations at prominent national and international meetings, including ASCO 2021 and ESMO 2022. These presentations were well-received, and publications based on this work are forthcoming, where I will serve as the first author. Furthermore, I have served as the site PI for three SCLC studies, including a trial with tarlatamab that recently received FDA approval for recurrent SCLC. This achievement underscores my ongoing commitment to advancing therapies for this challenging disease and highlights my proactive approach to driving innovation in lung cancer treatment.\n  *"
  ],
  "associations": [
    "Thoracic Oncology",
    "Molecular Medicine Program"
  ],
  "education": [],
  "publications": [
    {
      "title": "Multi-Institution Analysis of Tarlatamab for the Treatment of EGFR-Mutant Transformed Small Cell Lung Cancer",
      "pubmed_id": "41166675",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Cooper AJ, Herzberg B, Parma M, Wang K, Alder L, Weber UM, Patil T, Joshi U, Puri S, Saqi A, Clark P, Gay CM, Cascone T, Singhi EK, Blumenschein G, Skoulidis F, Tu J, Stinchcombe TE, Rudin CM, Shu CA, Byers LA, Yu H, Zhang B",
      "journal": "JCO Precis Oncol"
    },
    {
      "title": "Basal cell of origin resolves neuroendocrine-tuft lineage plasticity in cancer",
      "pubmed_id": "40963028",
      "year": "2025",
      "publication_date": "2025 Nov",
      "authors": "Ireland AS, Xie DA, Hawgood SB, Barbier MW, Zuo LY, Hanna BE, Lucas-Randolph S, Tyson DR, Witt BL, Govindan R, Dowlati A, Moser JC, Thomas A, Puri S, Rudin CM, Chan JM, Elliott A, Oliver TG",
      "journal": "Nature"
    },
    {
      "title": "Human Immunodeficiency Virus-Associated Differences in the Tumor Immune Microenvironment of Lung, Breast, and Prostate Cancers",
      "pubmed_id": "40183760",
      "pmc_id": "PMC12133412",
      "year": "2025",
      "publication_date": "2025 Jun",
      "authors": "Fenlon J, Van Bibber N, Mahlow J, Yamoah K, Soupir AC, Nguyen JV, Moran Segura C, Spivak AM, Knudsen BS, Zhou Q, Hu-Lieskovan S, Puri S, Zhang W, DeRose YS, Suneja G, Coghill AE",
      "journal": "Cancer Epidemiol Biomarkers Prev"
    },
    {
      "title": "Augmenting Prognostication: Utilizing Activity Trackers to Enhance Survival Prediction in Metastatic Non-Small Cell Lung Cancer",
      "pubmed_id": "39572323",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Jo Y, Puri S, Haaland B, Coletta AM, Chipman JJ, Embrey K, Kerrigan KC, Patel SB, Moynahan K, Gumbleton M, Akerley WL",
      "journal": "Clin Lung Cancer"
    },
    {
      "title": "Pulmonary neuroendocrine neoplasms: the molecular landscape, therapeutic challenges, and diagnosis and management strategies",
      "pubmed_id": "39756451",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Sen T, Dotsu Y, Corbett V, Puri S, Sen U, Boyle TA, Mack P, Hirsch F, Aljumaily R, Naqash AR, Sukrithan V, Karim NA",
      "journal": "Lancet Oncol"
    },
    {
      "title": "The Association Between Body Composition, Overall Survival, Treatment Decisions, and Patient-Reported Outcomes in Metastatic Non-Small-Cell Lung Cancer",
      "pubmed_id": "39764691",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Coletta AM, Lee H, Puri S, Culleton S, Covington MF, Yap JT, Maslana KE, Haaland B, Akerley W",
      "journal": "Cancer Med"
    },
    {
      "title": "Therapy for Stage IV Non-Small Cell Lung Cancer Without Driver Alterations: ASCO Living Guideline, Version 2025",
      "pubmed_id": "40674687",
      "year": "2025",
      "publication_date": "2025 Aug",
      "authors": "Owen DH, Halmos B, Puri S, Qin A, Ismaila N, Abu Rous F, Alluri K, Freeman-Daily J, Malhotra N, Marrone KA, Bazhenova L"
    },
    {
      "title": "Basal cell of origin resolves neuroendocrine-tuft lineage plasticity in cancer",
      "pubmed_id": "39605338",
      "pmc_id": "PMC11601426",
      "year": "2024",
      "publication_date": "2024 Nov",
      "authors": "Ireland AS, Hawgood SB, Xie DA, Barbier MW, Lucas-Randolph S, Tyson DR, Zuo LY, Witt BL, Govindan R, Dowlati A, Moser JC, Puri S, Rudin CM, Chan JM, Elliott A, Oliver TG",
      "journal": "bioRxiv"
    },
    {
      "title": "A Phase I First-in-Human Study of ABBV-011, a Seizure-Related Homolog Protein 6-Targeting Antibody-Drug Conjugate, in Patients with Small Cell Lung Cancer",
      "pubmed_id": "39287821",
      "pmc_id": "PMC11565168",
      "year": "2024",
      "publication_date": "2024 Nov",
      "authors": "Morgensztern D, Ready N, Johnson ML, Dowlati A, Choudhury N, Carbone DP, Schaefer E, Arnold SM, Puri S, Piotrowska Z, Hegde A, Chiang AC, Iams W, Tolcher A, Nosaki K, Kozuki T, Li T, Santana-Davila R, Akamatsu H, Murakami H, Yokouchi H, Wang S, Zha J, Li R, Robinson RR, Hingorani P, Jeng EE, Furqan M",
      "journal": "Clin Cancer Res"
    },
    {
      "title": "Therapy for Stage IV Non-Small Cell Lung Cancer With Driver Alterations: ASCO Living Guideline, Version 2024",
      "pubmed_id": "39531596",
      "year": "2024",
      "publication_date": "2024 Dec",
      "authors": "Bazhenova L, Ismaila N, Abu Rous F, Alluri K, Freeman-Daily J, Halmos B, Malhotra N, Marrone KA, Puri S, Qin A, Leighl NB"
    }
  ],
  "grants": [],
  "participating_trials": [
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-21074/",
      "trial_id": "21074",
      "title": "A Phase 2 Randomized Study of Osimertinib Versus Osimertinib Plus Chemotherapy for Patients with Metastatic EGFR-Mutant Lung Cancers That Have Detectable EGFRMutant cfDNA in Plasma After Initiation of Osimertinib",
      "condition": "Thoracic",
      "intervention": "AZD9291 (Osimertinib); Alimta (Pemetrexed); Osimertinib (); Paraplatin (carboplatin); Pemetrexed (); carboplatin ()",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-22441/",
      "trial_id": "22441",
      "title": "An Open-Label, Phase 1/2 Study of ORIC-114 as a Single Agent or in Combination with Chemotherapy, in Patients with Advanced Solid Tumors Harboring an EGFR or HER2 Alteration",
      "condition": "Thoracic",
      "intervention": "Alimta (Pemetrexed); ORIC-114 (); Paraplatin (carboplatin); Pemetrexed (); carboplatin ()",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23420/",
      "trial_id": "23420",
      "title": "A Phase 1/2, First in Human, Dose Escalation and Dose Expansion Study of BHV-1510 (Previously PBI-410) as Monotherapy and in Combination with Anti-Cancer Agents in Participants with Advanced Solid Tumors",
      "condition": "Thoracic",
      "intervention": "BHV-1510 (); Cemiplimab (); REGN2810 (Cemiplimab)",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23535/",
      "trial_id": "23535",
      "title": "A Phase 2b, Open-Label, Two-cohort Study of Subcutaneous Amivantamab in Combination with Lazertinib as First-Line Treatment, or Subcutaneous Amivantamab in Combination with Platinum-Based Chemotherapy as Second-line Treatment, for Common EGFR-Mutated Locally Advanced or Metastatic Non-Small Cell Lung Cancer",
      "condition": "Thoracic",
      "intervention": "Alimta (Pemetrexed); Amivantamab (); JNJ-61186372 (Amivantamab); JNJ-73841937 (Lazertinib); Lazertinib (); Paraplatin (carboplatin); Pemetrexed (); carboplatin ()",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23580/",
      "trial_id": "23580",
      "title": "A Phase 1/2 Open-Label, Multicenter, First-in-Human Study of the Safety, Tolerability, Pharmacokinetics, and Antitumor Activity of BH-30643 in Adult Subjects with Locally Advanced or Metastatic NSCLC Harboring EGFR and/or HER2 Mutations (SOLARA)",
      "condition": "Thoracic",
      "intervention": "BH-30643 ()",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23581/",
      "trial_id": "23581",
      "title": "A Phase 1b Study Evaluating the Safety, Tolerability, Pharmacokinetics, and Efficacy of Tarlatamab in Combination with YL201 with or without Anti-PD-L1 in Subjects with Extensive Stage Small Cell Lung Cancer",
      "condition": "Thoracic",
      "intervention": "AMP-514 (Durvalumab); Atezolizumab (Tecentriq); Durvalumab (); MEDI4736 (Durvalumab); Tarlatamab (AMG 757); YL201 ()",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23582/",
      "trial_id": "23582",
      "title": "A Phase II, multisite, open-label, single arm trial of BNT327 in combination with docetaxel in second-line stage IV non-small cell lung cancer (NSCLC) following chemoimmunotherapy",
      "condition": "Thoracic",
      "intervention": "BNT327 (); Taxotere (docetaxel); docetaxel ()",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23584/",
      "trial_id": "23584",
      "title": "A Phase I Dose Finding and Phase II Randomized Trial of Iadademstat Combined with Immune Checkpoint Inhibition Maintenance After Initial Chemoimmunotherapy in Patients with Extensive-Stage Small Cell Lung Cancer",
      "condition": "Thoracic",
      "intervention": "AMP-514 (Durvalumab); Atezolizumab (Tecentriq); Durvalumab (); Iadademstat (); MEDI4736 (Durvalumab)",
      "status": "OPEN (SUSPENDED)"
    }
  ],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/PuriSonam_22270.jpg",
  "contact": {},
  "content_hash": "009121a7a1fbba86d02f2da9a41d6ff00f1974b482bb3b0bb84bfe80979e7f5e",
  "researcher_name": "sonam puri",
  "department": ""
}