{
  "count": 118,
  "programs": {
    "BioEngineering": 3,
    "Molecular Oncology": 13,
    "Biostatistics and Bioinformatics": 15,
    "Metabolism and Physiology": 7,
    "Genitourinary Oncology": 4,
    "Integrated Mathematical Oncology": 8,
    "Diagnostic Imaging and Interventional Radiology": 2,
    "Machine Learning": 5,
    "Radiation Oncology": 1,
    "Tumor Microenvironment and Metastasis": 7,
    "Pathology": 4,
    "Cancer Epidemiology": 13,
    "Gynecologic Oncology": 1,
    "Drug Discovery": 7,
    "Thoracic Oncology": 3,
    "Malignant Hematology": 4,
    "Immunology": 8,
    "Gastrointestinal Oncology": 2,
    "Cutaneous Oncology": 2,
    "Neuro-Oncology": 3,
    "Sarcoma": 1,
    "Blood and Marrow Transplant and Cellular Immunotherapy": 3,
    "Breast Oncology": 2
  },
  "departments": {
    "BioEngineering": 2,
    "Molecular Oncology": 15,
    "Tumor Microenvironment and Metastasis": 19,
    "Biostatistics and Bioinformatics": 14,
    "Metabolism and Physiology": 7,
    "Integrated Mathematical Oncology": 10,
    "Machine Learning": 11,
    "Cancer Epidemiology": 13,
    "Drug Discovery": 11,
    "Immunology": 16
  },
  "top_research_interests": {
    "Dr. Sawyer’s current research interests include visualizing the interactions between cancer cells and the tumor microenvironment using bio-printing techniques and precision engineering approaches using an ex vivo platform pioneered in his laboratory. Dr. Sawyer will build the new department at Moffitt Magnolia Campus prior to moving to the Moffitt Center for Innovation at Speros FL. There, the Department of BioEngineering will partner with other departments to accelerate the advances in cancer research and treatment.\n  *": 1,
    "We are interested in the following areas: (1) Role and regulation of mitochondrial antioxidant system in cancer cells. (2) Mitochondria and redox signaling crosstalk in cancer cells. (3) Redox vulnerabilities of human malignancies, focusing on selenoproteins. (4) The impact of onco-viral infection (EBV, HBV and HPV) on the redox status of cancer cells.\n  *": 1,
    "My laboratory will adopt an interdisciplinary approach, combining principles from engineering and systems biology to develop integrated tools and methodologies for basic cancer research. Specifically, my group will focus on three key objectives: 1) develop 3D ex vivo microtumor models for therapeutic drug screen, 2) investigate the physical science of cancer on immune evasion, drug delivery, and tumor progression, 3) define biophysical stressors that contribute to tumor invasion, metastasis, and dormancy.\n  *": 1,
    "My primary research focus is on the identification of predictive cancer biomarkers to optimize cancer therapy as a personalized medicine. I have developed the CONCORD and PDXGEM pipelines, which analyze gene expression patterns and gene co-expression networks across cancer cell lines, patient-derived tumor xenografts, and cancer patients. These pipelines enable the prediction of therapeutic response and facilitate drug repurposing. My recent research has centered on discovering molecular cancer biomarkers, conducting metagenomic and genetic association studies to improve cancer diagnosis, prognosis, and treatment outcomes.\n  *": 1,
    "My research interests focus on the development of new statistical methods and software for integrative analysis of multi-omics data typically generated from microarray and next generation sequencing experiments. My clinical research collaborations primarily focus on design and analysis of clinical trials and examination of clinical and treatment factors predictive of clinical outcomes. My collaborations in basic science and genomic studies mainly focus on statistical analysis and mining of the data generated by experiments using microarray or high-throughput sequencing technology.\n  *": 1,
    "Dr. Teer's research interests are focused on developing methods to analyze, interpret and visualize massively-parallel sequencing information in cancer genetics. This includes developing and applying computational methods and graphical tools to better detect genetic variations from sequencing data, understand the functional context of sequence changes, and visualize the results of large-scale genomics studies.\n  *": 1,
    "Dr. Teng’s research areas include: 1) Integrative approaches in decoding enhancer functions in cancers; 2) Computational modeling of viral-tumorigenesis and immune responses in DNA virus-related cancers; 3) Machine learning in identifying clonal hematopoiesis biomarkers in solid tumors. \n  *": 1,
    "Our lab is interested in the mechanisms connecting the decline of the energetic metabolism that occurs during aging with aging-related diseases being cancer a prime example. We focus on how a switch in the functioning of mitochondria to promote reactive oxygen species production over ATP changes the biophysical microenvironment of the cell with particular emphasis in the nucleus. We also aim at determining how these metabolic changes impact chromatin structure and gene expression. Our hypothesis is that reactive metabolites including, but not limited to reactive oxygen species, chemically modify chromatin components that provide it with specific structural patterns. These include histones, lamins, lncRNA and DNA itself. Since chromatin structure regulates gene accessibility and transcription efficiency our work postulates that changes in metabolism establish the biophysical environment where transcription happens. With that in mind we aim at developing therapeutic strategies to mitigate the effects of these metabolites on chromatin (chromatin protective agents) to improve cancer clinical care.\n  *": 1,
    "Cells have energetic and anabolic needs for growth and proliferation. Dr. DeNicola's research is focused on understanding how cells meet these needs and the mechanisms governing the regulation of tumor metabolism in vivo. While cell culture systems are useful for querying the activity of metabolic pathways, many factors in vivo likely play a major role in the regulation of cellular metabolism, including tumor/stroma interactions, contact with the extracellular matrix, local hypoxia and nutrient availability and nutrient intake by the host. The DeNicola laboratory investigates the influence of both genomic alterations and the microenvironment on cellular metabolism in vivo. Mutations in KEAP1 and NRF2, which lead to NRF2 hyperactivation, are commonly found in cancers and lead to metabolic deregulation. Despite the identification of the first KEAP1 mutations in 2006, the precise mechanisms by which NRF2 promotes tumorigenesis are unclear owing to the lack of genetically engineered KEAP1 and NRF2 mutant mouse models that recapitulate the human disease. Dr. DeNicola and others, have identified that NRF2 activation leads to profound deregulation of cellular metabolism, including the promotion of serine biosynthesis, which is critical for the proliferation of KEAP1 and NRF2 mutant cells. However, the activity of these pathways in KEAP1/NRF2 mutant lung tumors in vivo is not established. A major research focus of her lab is investigating how NRF2 promotes tumorigenesis and metabolic deregulation in vivo using genetically engineered mouse model systems. The DeNicola laboratory also focuses on how the microenvironment affects metabolic dependencies. Much of the understanding of tumor metabolism comes from cell culture experiments in which other cell types typically found in tumors, such as fibroblasts and immune cells, are absent. However, these cells have the potential to significantly affect tumor metabolism in vivo by both providing and/or competing for metabolites that the tumor cells require. Her laboratory is examining how the metabolic interaction between epithelial tumor cells with fibroblasts and immune cells affects the metabolism and growth of these compartments.\n  *": 1,
    "Evolution of tumor invasiveness and adaptive tumor microenvironment particularly in multiple myeloma; cancer metabolism\n  *": 1
  }
}