{
  "profile_url": "https://www.moffitt.org/research-science/researchers/susan-vadaparampil/",
  "last_updated": "2025-11-21T22:50:27.021213",
  "researcher_id": "2926",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "health outcomes and behavior",
  "research_program": "health outcomes & behavior",
  "overview": "Increasing uptake, utilization, and positive health outcomes related to cancer prevention and control in clinical and community settings.",
  "research_interests": [
    "Dr. Susan Vadaparampil is Associate Center Director of Community Outreach, Engagement, and Equity at Moffitt Cancer Center in Tampa, FL. She is also a Senior Member in the Health Outcomes and Behavior Program in the Division of Population Sciences and Professor in the Department of Oncologic Sciences at the University of South Florida College of Medicine. Dr. Vadaparampil has developed a research program applying behavioral science, epidemiology, health services, and clinical perspectives to improve utilization of cancer prevention and control innovations across the cancer continuum. She has developed patient and provider focused interventions to address underutilization of genetic counseling and testing, HPV vaccination, HCV screening, and reproductive health issues for adolescent and young adult patients. Her work in has been influenced by transdisciplinary collaboration, focused on health equity, and contributed to both the scientific literature and clinical practice. She has published over 230 scientific manuscripts and her work has been funded through research grants from the National Institutes of Health, the American Cancer Society, and other organizations. Dr. Vadaparampil partners with clinical, community, and advocacy organizations to reduce the burden of cancer in our community In addition, she has a long-standing commitment to the training the next generation of cancer prevention and control scientists. She currently serves as the Co-Program Director for Moffitt Cancer Center’s NCI-funded Behavioral Oncology Postdoctoral T32 Training Program. \n  *"
  ],
  "associations": [
    "Health Outcomes and Behavior",
    "Breast Oncology",
    "Health Outcomes & Behavior Program",
    "Cancer Chemoprevention Research Interest Group",
    "Melanoma & Skin Cancer Center of Excellence"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of Florida, MS"
    },
    {
      "type": "Graduate",
      "institution": "Indiana University, PhD"
    },
    {
      "type": "Graduate",
      "institution": "Johns Hopkins University, MPH"
    }
  ],
  "publications": [
    {
      "title": "Factors Associated With Guideline-Concordant Cervical Cancer Screening Exit: A Mixed Methods Study",
      "pubmed_id": "40925755",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Olson A, Fuzzell L, Brownstein NC, Fontenot HB, Michel A, Lake P, Vadaparampil ST, Perkins RB",
      "journal": "Womens Health Issues"
    },
    {
      "title": "Barriers to endocrine therapy adherence: perspectives of Black breast cancer survivors and their providers",
      "pubmed_id": "38520598",
      "pmc_id": "PMC11664442",
      "year": "2025",
      "publication_date": "2025 Oct",
      "authors": "Lee KT, Gonzalez BD, Geiss C, Fulton HJ, Charles D, Vadaparampil ST, Henry NL, Jim HSL, Hershman DL, Tworoger SS, Gwede CK",
      "journal": "J Cancer Surviv"
    },
    {
      "title": "Design of a cluster randomized multi-level intervention to decrease barriers to minority cancer patient referral and enrollment to cancer clinical trials: The ACT WONDER2S study",
      "pubmed_id": "40992541",
      "year": "2025",
      "publication_date": "2025 Nov",
      "authors": "Rollison DE, Garcia MA, Amorrortu RP, Zhao Y, Mittman B, Turner K, Kirtane K, Soliman H, Byrne MM, Meade C, Gwede CK, Eschrich S, Yin J, Stanley NB, Fuzzell L, Hernandez D, Tapia-Kwan E, Vadaparampil ST",
      "journal": "Contemp Clin Trials"
    },
    {
      "title": "Investigating structural inequities in area-level socioeconomic and health care access measures among people with HIV and cancer (2004-2020)",
      "pubmed_id": "40305646",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Islam JY, Suneja G, Lin YC, McGee-Avila JK, Turner K, Alishahi Tabriz A, Vadaparampil ST, D'Souza G, Friedman MR, Guo Y, Camacho-Rivera M",
      "journal": "Cancer"
    },
    {
      "title": "Development and Evaluation of an HPV Vaccine Champion Training: a Strategy to Boost Adolescent Vaccination in Community Health Centers in Florida",
      "pubmed_id": "40448885",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Owens HN, Arevalo M, Whitmer A, Fuzzell L, Geiss C, Turner K, Chung-Bridges K, Endemano E, Parras D, Christy SM, Vadaparampil ST",
      "journal": "J Cancer Educ"
    },
    {
      "title": "Development and pilot of Trainers in Oncofertility Reproductive Communication and Health (TORCH) program",
      "pubmed_id": "40413370",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Jalili D, Zabar S, Rose J, Shah R, Tancer L, Augusto B, Vadaparampil ST, Quinn GP",
      "journal": "J Cancer Surviv"
    },
    {
      "title": "Inequities by race and ethnicity in cancer treatment receipt among people living with HIV and cancer in the U",
      "pubmed_id": "40394520",
      "pmc_id": "PMC12090492",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Islam JY, Guo Y, McGee-Avila JK, Turner K, Tabriz AA, Lin YC, Vadaparampil ST, Coghill AE, Camacho-Rivera M, Suneja G",
      "journal": "S"
    },
    {
      "title": "Population-specific patterns in assessing molecular subtypes of young black females with triple-negative breast cancer",
      "pubmed_id": "40069179",
      "pmc_id": "PMC11897140",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Rajagopal PS, Reid S, Fan R, Venton L, Weidner A, Roberson ML, Vadaparampil S, Wang X, Yoder S, Rosa M, Sanders M, Gonzalez-Ericsson P, Hirbo J, Whisenant JG, Pietenpol J, Ye F, Pal T, Lehmann BD",
      "journal": "NPJ Breast Cancer"
    },
    {
      "title": "Inequities in palliative care delivery to patients with HIV and stage IV cancers in the United States (2004-2020)",
      "pubmed_id": "39579085",
      "pmc_id": "PMC11897894",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Islam JY, Guo Y, Turner K, Tabriz AA, Lin YC, Vidot DC, Vadaparampil ST, Coghill AE, ScD MC, Suneja G",
      "journal": "JNCI Cancer Spectr"
    },
    {
      "title": "Quality of English- and Spanish-language online content about prostate cancer genetics: Insights into potential contributors to prostate cancer disparities",
      "pubmed_id": "40129444",
      "pmc_id": "PMC11930542",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Abusamra SM, Cholán VO, Giri VN, Vadaparampil ST, Pérez-Rosas V, Rivera A, Nolasco TS, Camacho MR, Byrne N, Loeb S",
      "journal": "BJUI Compass"
    }
  ],
  "grants": [
    {
      "description": "Title: Development of Systems and Education for Cervical Cancer prevention (DOSE-CC)   \nAward Number: 1R01CA299475-01  \nSponsor: National Cancer Institute (NCI)  \nVadaparampil, S. (PD/PI)",
      "title": "Development of Systems and Education for Cervical Cancer prevention (DOSE-CC)",
      "award_number": "1R01CA299475-01",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Vadaparampil, S.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Advancing Clinical Trials: Working through Outreach, Navigation and Digital Enabled Referral and Recruitment Strategies (ACT WONDERS)  \nAward Number: 4U01CA274971-04  \nSponsor: National Cancer Institute (NCI)  \nVadaparampil, S. (PD/PI)",
      "title": "Advancing Clinical Trials: Working through Outreach, Navigation and Digital Enabled Referral and Recruitment Strategies (ACT WONDERS)",
      "award_number": "4U01CA274971-04",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Vadaparampil, S.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Behavioral Oncology Education & Career Development  \nAward Number: 5T32CA090314-22  \nSponsor: National Cancer Institute (NCI)  \nSimmons, V. (PD/PI), Vadaparampil, S. (PD/PI)",
      "title": "Behavioral Oncology Education & Career Development",
      "award_number": "5T32CA090314-22",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Simmons, V.",
          "role": "PD/PI"
        },
        {
          "name": "Vadaparampil, S.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Enriching Communication Skills for Health Professionals in Oncofertility and Trainers in Oncofertility Reproductive Communication and Health  \nAward Number: 5R25CA142519-14  \nSponsor: National Cancer Institute (NCI)  \nVadaparampil, S. (PD/PI)",
      "title": "Enriching Communication Skills for Health Professionals in Oncofertility and Trainers in Oncofertility Reproductive Communication and Health",
      "award_number": "5R25CA142519-14",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Vadaparampil, S.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Promoting Equity in Genetic Evaluation for Prostate Cancer Among Hispanic/Latinx Men  \nAward Number: HT94252311040  \nSponsor: Department of Defense (DOD)  \nVadaparampil, S. (PD/PI)",
      "title": "Promoting Equity in Genetic Evaluation for Prostate Cancer Among Hispanic/Latinx Men",
      "award_number": "HT94252311040",
      "sponsor": "Department of Defense (DOD)",
      "source": "DOD",
      "investigators": [
        {
          "name": "Vadaparampil, S.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: HPV MISTICS: Multilevel Intervention Strategies Targeting Immunization in Community Settings  \nAward Number: 22B01  \nSponsor: Florida Department of Health  \nVadaparampil, S. (PD/PI), Christy, S. (Co-PD/PI)",
      "title": "HPV MISTICS: Multilevel Intervention Strategies Targeting Immunization in Community Settings",
      "award_number": "22B01",
      "sponsor": "Florida Department of Health",
      "investigators": [
        {
          "name": "Vadaparampil, S.",
          "role": "PD/PI"
        },
        {
          "name": "Christy, S.",
          "role": "Co-PD/PI"
        }
      ]
    }
  ],
  "participating_trials": [
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-21902/",
      "trial_id": "21902",
      "title": "HPV Multilevel Intervention Strategies Targeting Immunization in Community Settings (HPV MISTICS)",
      "condition": "Healthy Subjects",
      "status": "OPEN (SUSPENDED)"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-22140/",
      "trial_id": "22140",
      "title": "Working through Outreach, Navigation and Digital Enabled Referral and Recruitment Strategies (ACT WONDERS)",
      "condition": "Multiple",
      "status": "OPEN (SUSPENDED)"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-22569/",
      "trial_id": "22569",
      "title": "REFLECT: Reproductive Education and Fertility Links for Cancer Treatment",
      "condition": "Multiple",
      "status": "Open"
    }
  ],
  "lab_page_url": "http://lab.moffitt.org/crisp/",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/VadaparampilSusan_2926.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=2926"
  },
  "content_hash": "54a5e2ce39a2c7d0c581caaf63c7a99f0725c6f65902e5433828c43ba99e30bc",
  "researcher_name": "susan vadaparampil",
  "department": "health outcomes & behavior"
}