{
  "profile_url": "https://www.moffitt.org/research-science/researchers/sylvia-crowder/",
  "last_updated": "2025-11-21T22:50:27.048038",
  "researcher_id": "27908",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "health outcomes and behavior",
  "research_program": "health outcomes & behavior",
  "overview": "Dr. Crowder’s independent program of research focuses on utilizing interdisciplinary, mixed-methods designs to investigate the complex relationships among dietary patterns, eating behaviors, nutritional status, and patient-centered survivorship outcomes such as quality of life and symptom burden in cancer survivors. Her goal is to develop new and beneficial dietary recommendations and medical nutrition therapies for cancer patients and survivors.",
  "research_interests": [
    "Dr. Crowder’s independent program of research focuses on utilizing interdisciplinary, mixed-methods designs to investigate the complex relationships among dietary patterns, eating behaviors, nutritional status, and patient-centered survivorship outcomes such as quality of life and symptom burden in cancer survivors. Her goal is to develop new and beneficial dietary recommendations and medical nutrition therapies for cancer patients and survivors.\n  *"
  ],
  "associations": [
    "Health Outcomes and Behavior",
    "Health Outcomes & Behavior Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of Illinois, PhD"
    },
    {
      "type": "Fellowship",
      "institution": "Moffitt Cancer Center",
      "specialty": "Health Outcomes and Behavior"
    }
  ],
  "publications": [
    {
      "title": "The Impact of Edema on Skeletal Muscle Changes among Patients with Pancreatic Ductal Adenocarcinoma",
      "pubmed_id": "40553455",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Davis EW, Park MA, Basinski TL, Arnoletti JP, Bloomston M, Carson TL, Biachi De Castria T, Chen DT, Cortizas EM, Crowder SL, Genilo-Delgado M, Douglas WG, Huguet KL, Jiang K, Hodul PJ, Karolak A, Kim DW, Koomen JM, Menon AA, Mo Q, Mok SR, Molina-Vega MA, Moreno-Urazan L, Ahmed S, Parker NH, Pimiento JM, Rasool G, Sparks LM, Stewart PA, Tassielli AF, Teer JK, Trevino JG, Velanovich V, Wang X, Whelan CJ, Judge SM, Judge AR, Fleming JB, Malafa MP, Jeong D, Permuth JB",
      "journal": "Cancer Epidemiol Biomarkers Prev"
    },
    {
      "title": "Genetic predisposition to persistent fatigue after a diagnosis of colorectal cancer",
      "pubmed_id": "40889272",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Kazemian E, Mo Q, Matejcic M, Tsai YY, Sobieski D, Li X, Hoogland AI, Crowder SL, Gonzalez BD, Oswald LB, Sleight AG, Nguyen N, Loroña NC, Damerell V, Komrokji KR, Mooney K, Playdon MC, Ulrich CM, Li CI, Shibata D, Toriola AT, Ose J, Peoples AR, Hardikar S, Kahlert C, Siegel EM, Bower JE, Schmit SL, Gigic B, Jim HSL, Figueiredo JC",
      "journal": "J Natl Cancer Inst"
    },
    {
      "title": "Diet and physical activity intervention preferences for young adult cancer survivors",
      "pubmed_id": "40447925",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Crowder SL, Hu B, Hoogland AI, Gudenkauf LM, Li X, Rodriguez Y, Irizarry-Arroyo NE, Oswald LB, Gonzalez BD, Small BJ, Galligan A, Jim HSL, Stern M",
      "journal": "J Cancer Surviv"
    },
    {
      "title": "Correction: Park et al",
      "pubmed_id": "40149388",
      "pmc_id": "PMC11941415",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Park MA, Whelan CJ, Ahmed S, Boeringer T, Brown J, Carson TL, Crowder SL, Gage K, Gregg C, Jeong DK, Jim HSL, Judge AR, Mason TM, Parker N, Pillai S, Qayyum A, Rajasekhara S, Rasool G, Tinsley SM, Schabath MB, Stewart P, West J, McDonald P, Permuth JB",
      "journal": "Defining and Addressing Research Priorities in Cancer Cachexia through Transdisciplinary Collaboration"
    },
    {
      "title": "Nutrition in head and neck cancer care: a roadmap and call for research",
      "pubmed_id": "40449504",
      "year": "2025",
      "publication_date": "2025 Jun",
      "authors": "Chen X, Beilman B, Gibbs HD, Hamilton JL, Parker N, Bur AM, Caudell JJ, Gan GN, Hamilton-Reeves JM, Jim HSL, Kirtane K, Lominska C, Crowder SL, Arthur AE",
      "journal": "Lancet Oncol"
    },
    {
      "title": "Breast Cancer Survivors' Diet and Physical Activity Preferences and Barriers: How COVID-19 Changed the Intervention Landscape",
      "pubmed_id": "39840373",
      "pmc_id": "PMC11750260",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Chen X, Chiu C, Cheung HHT, Crowder SL, Chen X, Trinh L, Arthur AE",
      "journal": "Curr Dev Nutr"
    },
    {
      "title": "Cancer-Related Cognitive Impairment and the Potential of Dietary Interventions for the Prevention and Mitigation of Neurodegeneration",
      "pubmed_id": "39570793",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Crowder SL, Gudenkauf LM, Hoogland AI, Han HS, Small BJ, Carson TL, Parker NH, Booth-Jones M, Jim HSL",
      "journal": "Cancer Res"
    },
    {
      "title": "Race-based differences in serum biomarkers for cancer-associated cachexia in a diverse cohort of patients with pancreatic ductal adenocarcinoma",
      "pubmed_id": "39989973",
      "pmc_id": "PMC11844656",
      "year": "2025",
      "publication_date": "2025 Feb",
      "authors": "Permuth J, Park M, Davis E, Alhassan S, Arnoletti J, Basinski T, McKee A, Bloomston M, Carson T, de Castria TB, Chen DT, Cortizas E, Crowder S, Delgado MG, Douglas W, Fleming J, Hodul P, Huguet K, Jiang K, Kim DW, Koomen J, Luthra A, Malafa M, Menon A, Morales R, Merchant N, Meredith K, Mo Q, Molina-Vega M, Moreno-Urazan L, Olumoyin K, Parker N, Pimiento J, Rasool G, Rejniak K, Sansil S, Sparks L, Stewart P, Tassielli A, Teer J, Tran DV, Trevino J, Velanovich V, Whelan C, Jeong D, Judge S, Judge A",
      "journal": "Res Sq"
    },
    {
      "title": "Associations Between Dietary Patterns and Quality of Life in a Longitudinal Cohort of Colorectal Cancer Survivors",
      "pubmed_id": "39599646",
      "pmc_id": "PMC11597155",
      "year": "2024",
      "publication_date": "2024 Nov",
      "authors": "Smith KS, Gudenkauf LM, Hoogland AI, Li X, Hoobler R, Playdon MC, Gigic B, Small BJ, Gonzalez BD, Oswald LB, Byrd DA, Greathouse KL, Ulrich CM, Li CI, Shibata D, Toriola AT, Peoples AR, Siegel EM, Figueiredo JC, Jim HSL, Crowder SL",
      "journal": "Nutrients"
    },
    {
      "title": "Defining and Addressing Research Priorities in Cancer Cachexia through Transdisciplinary Collaboration",
      "pubmed_id": "39001427",
      "pmc_id": "PMC11240731",
      "year": "2024",
      "publication_date": "2024 Jun",
      "authors": "Park MA, Whelan CJ, Ahmed S, Boeringer T, Brown J, Crowder SL, Gage K, Gregg C, Jeong DK, Jim HSL, Judge AR, Mason TM, Parker N, Pillai S, Qayyum A, Rajasekhara S, Rasool G, Tinsley SM, Schabath MB, Stewart P, West J, McDonald P, Permuth JB",
      "journal": "Cancers (Basel)"
    }
  ],
  "grants": [
    {
      "description": "Title: AI-Driven Early Detection of Cachexia in Pancreatic Cancer and Feasibility of Diet and Exercise Interventions  \nAward Number: 25C62  \nSponsor: Florida Department of Health  \nRasool, G. (PD/PI), Parker, N. (Co-PD/PI), Permuth, J. (Co-PD/PI), Shafer, S. (Co-PD/PI)",
      "title": "AI-Driven Early Detection of Cachexia in Pancreatic Cancer and Feasibility of Diet and Exercise Interventions",
      "award_number": "25C62",
      "sponsor": "Florida Department of Health",
      "investigators": [
        {
          "name": "Rasool, G.",
          "role": "PD/PI"
        },
        {
          "name": "Parker, N.",
          "role": "Co-PD/PI"
        },
        {
          "name": "Permuth, J.",
          "role": "Co-PD/PI"
        },
        {
          "name": "Shafer, S.",
          "role": "Co-PD/PI"
        }
      ]
    },
    {
      "description": "Title: The MIND-BC Study: MIND diet for Breast cancer Cognition  \nAward Number: 1R01CA299480-01  \nSponsor: National Cancer Institute (NCI)  \nShafer, S. (PD/PI)",
      "title": "The MIND-BC Study: MIND diet for Breast cancer Cognition",
      "award_number": "1R01CA299480-01",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Shafer, S.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "participating_trials": [
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23571/",
      "trial_id": "23571",
      "title": "The MIND-BC Study: MIND Diet for Breast Cancer Cognition",
      "condition": "Breast",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23670/",
      "trial_id": "23670",
      "title": "Culinary Medicine at Moffitt: Creating a Recipe for Nutrition",
      "condition": "Healthy Subjects",
      "status": "Open"
    }
  ],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/CrowderSylvia_27908.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=27908"
  },
  "content_hash": "53d21136838e004d042c16b477edbb23d72bfdde2de3003e6ede3da7f7b8dd01",
  "researcher_name": "sylvia crowder",
  "department": "health outcomes & behavior"
}