{
  "profile_url": "https://www.moffitt.org/research-science/researchers/tiffany-carson/",
  "last_updated": "2025-11-21T22:50:27.157053",
  "researcher_id": "28107",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "health outcomes and behavior",
  "research_program": "health outcomes & behavior",
  "overview": "Dr. Carson's research focuses on cancer risk reduction and prevention for all populations, primarily by helping individuals achieve healthier weights. Using a bio-behavioral model, Dr. Carson's research program examines how social, behavioral, and biological factors intersect to influence health outcomes.",
  "research_interests": [
    "Dr. Carson's research focuses on cancer risk reduction and prevention for all populations, primarily by helping individuals achieve healthier weights. Using a bio-behavioral model, Dr. Carson's research program examines how social, behavioral, and biological factors intersect to influence health outcomes.\n  *"
  ],
  "associations": [
    "Health Outcomes and Behavior",
    "Gastrointestinal Oncology",
    "Health Outcomes & Behavior Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "University of Alabama at Birmingham, PhD"
    },
    {
      "type": "Graduate",
      "institution": "University of Alabama at Birmingham, MPH"
    },
    {
      "type": "Fellowship",
      "institution": "Center for Obesity Research, University of Arkansas for Medical Sciences",
      "specialty": ""
    }
  ],
  "publications": [
    {
      "title": "The Impact of Edema on Skeletal Muscle Changes among Patients with Pancreatic Ductal Adenocarcinoma",
      "pubmed_id": "40553455",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Davis EW, Park MA, Basinski TL, Arnoletti JP, Bloomston M, Carson TL, Biachi De Castria T, Chen DT, Cortizas EM, Crowder SL, Genilo-Delgado M, Douglas WG, Huguet KL, Jiang K, Hodul PJ, Karolak A, Kim DW, Koomen JM, Menon AA, Mo Q, Mok SR, Molina-Vega MA, Moreno-Urazan L, Ahmed S, Parker NH, Pimiento JM, Rasool G, Sparks LM, Stewart PA, Tassielli AF, Teer JK, Trevino JG, Velanovich V, Wang X, Whelan CJ, Judge SM, Judge AR, Fleming JB, Malafa MP, Jeong D, Permuth JB",
      "journal": "Cancer Epidemiol Biomarkers Prev"
    },
    {
      "title": "Correction: Park et al",
      "pubmed_id": "40149388",
      "pmc_id": "PMC11941415",
      "year": "2025",
      "publication_date": "2025 Mar",
      "authors": "Park MA, Whelan CJ, Ahmed S, Boeringer T, Brown J, Carson TL, Crowder SL, Gage K, Gregg C, Jeong DK, Jim HSL, Judge AR, Mason TM, Parker N, Pillai S, Qayyum A, Rajasekhara S, Rasool G, Tinsley SM, Schabath MB, Stewart P, West J, McDonald P, Permuth JB",
      "journal": "Defining and Addressing Research Priorities in Cancer Cachexia through Transdisciplinary Collaboration"
    },
    {
      "title": "Lifestyle Behaviors and Needs After Breast Cancer Diagnosis: A Qualitative Assessment",
      "pubmed_id": "39033310",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Sauls RM, Buro AW, Brown N, Riccardi D, Mallory M, Hoover S, Laronga C, Pabbathi S, Carson TL",
      "journal": "Am J Health Promot"
    },
    {
      "title": "Cancer-Related Cognitive Impairment and the Potential of Dietary Interventions for the Prevention and Mitigation of Neurodegeneration",
      "pubmed_id": "39570793",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Crowder SL, Gudenkauf LM, Hoogland AI, Han HS, Small BJ, Carson TL, Parker NH, Booth-Jones M, Jim HSL",
      "journal": "Cancer Res"
    },
    {
      "title": "Race-based differences in serum biomarkers for cancer-associated cachexia in a diverse cohort of patients with pancreatic ductal adenocarcinoma",
      "pubmed_id": "39989973",
      "pmc_id": "PMC11844656",
      "year": "2025",
      "publication_date": "2025 Feb",
      "authors": "Permuth J, Park M, Davis E, Alhassan S, Arnoletti J, Basinski T, McKee A, Bloomston M, Carson T, de Castria TB, Chen DT, Cortizas E, Crowder S, Delgado MG, Douglas W, Fleming J, Hodul P, Huguet K, Jiang K, Kim DW, Koomen J, Luthra A, Malafa M, Menon A, Morales R, Merchant N, Meredith K, Mo Q, Molina-Vega M, Moreno-Urazan L, Olumoyin K, Parker N, Pimiento J, Rasool G, Rejniak K, Sansil S, Sparks L, Stewart P, Tassielli A, Teer J, Tran DV, Trevino J, Velanovich V, Whelan C, Jeong D, Judge S, Judge A",
      "journal": "Res Sq"
    },
    {
      "title": "A case-control study of the association between the gut microbiota and colorectal cancer: exploring the roles of diet, stress, and race",
      "pubmed_id": "38468325",
      "pmc_id": "PMC10929127",
      "year": "2024",
      "publication_date": "2024 Mar",
      "authors": "Carson TL, Byrd DA, Smith KS, Carter D, Gomez M, Abaskaron M, Little RB, Holmes ST, van Der Pol WJ, Lefkowitz EJ, Morrow CD, Fruge AD",
      "journal": "Gut Pathog"
    },
    {
      "title": "Lifestyle interventions with dietary strategies after breast cancer diagnosis: a systematic review",
      "pubmed_id": "38551752",
      "year": "2024",
      "publication_date": "2024 Jul",
      "authors": "Buro AW, Nguyen T, Abaskaron M, Haver MK, Carson TL",
      "journal": "Breast Cancer Res Treat"
    },
    {
      "title": "Prospective Assessment of Quality of Life and Patient-Reported Toxicities Over the First Year After Chimeric Antigen Receptor T-Cell Therapy",
      "pubmed_id": "39306278",
      "pmc_id": "PMC11635818",
      "year": "2024",
      "publication_date": "2024 Dec",
      "authors": "Hoogland AI, Barata A, Li X, Irizarry-Arroyo N, Jain MD, Welniak T, Rodriguez Y, Oswald LB, Gudenkauf LM, Chavez JC, Khimani F, Lazaryan A, Liu HD, Nishihori T, Pinilla-Ibarz J, Shah BD, Crowder SL, Parker NH, Carson TL, Vinci CE, Pidala JA, Logue J, Locke FL, Jim HSL",
      "journal": "Transplant Cell Ther"
    },
    {
      "title": "Support Through Remote Observation and Nutrition Guidance (STRONG), a digital health intervention to reduce malnutrition among pancreatic cancer patients: A study protocol for a pilot randomized controlled trial",
      "pubmed_id": "38440777",
      "pmc_id": "PMC10910065",
      "year": "2024",
      "publication_date": "2024 Apr",
      "authors": "Turner K, Kim DW, Gonzalez BD, Gore LR, Gurd E, Milano J, Riccardi D, Byrne M, Al-Jumayli M, de Castria TB, Laber DA, Hoffe S, Costello J, Robinson E, Chadha JS, Rajasekhara S, Hume E, Hagen R, Nguyen OT, Nardella N, Parker N, Carson TL, Tabriz AA, Hodul P",
      "journal": "Contemp Clin Trials Commun"
    },
    {
      "title": "Survivors Overcoming and Achieving Resiliency (SOAR): Mindful Eating Practice for Breast Cancer Survivors in a Virtual Teaching Kitchen",
      "pubmed_id": "37836489",
      "pmc_id": "PMC10574766",
      "year": "2023",
      "publication_date": "2023 Sep",
      "authors": "Huang S, Riccardi D, Pflanzer S, Redwine LS, Gray HL, Carson TL, McDowell M, Thompson Z, Hubbard JJ, Pabbathi S",
      "journal": "Nutrients"
    }
  ],
  "grants": [
    {
      "description": "Title: SAMBAI: Societal, Ancestry and Molecular Biology Analyses of Inequalities  \nAward Number: CGCATF-2023/100032  \nSponsor: CANCER RESEARCH UK  \nCarson, T. (PD/PI)",
      "title": "SAMBAI: Societal, Ancestry and Molecular Biology Analyses of Inequalities",
      "award_number": "CGCATF-2023/100032",
      "sponsor": "CANCER RESEARCH UK",
      "investigators": [
        {
          "name": "Carson, T.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Determining the Structural- and Functional-Level Effects of Diet-Specific Interventions on the Gut Microbiota of a Diverse Sample of Southern United States Adults  \nAward Number: 5R01CA253219-05  \nSponsor: National Cancer Institute (NCI)  \nCarson, T. (PD/PI)",
      "title": "Determining the Structural- and Functional-Level Effects of Diet-Specific Interventions on the Gut Microbiota of a Diverse Sample of Southern United States Adults",
      "award_number": "5R01CA253219-05",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Carson, T.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: SAMBAI Establishing a comprehensive assessment of contributors to cancer inequities across the African diaspora  \nAward Number: 1OT2CA297573-01  \nSponsor: National Cancer Institute (NCI)  \nCarson, T. (PD/PI)",
      "title": "SAMBAI Establishing a comprehensive assessment of contributors to cancer inequities across the African diaspora",
      "award_number": "1OT2CA297573-01",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Carson, T.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Improving Weight Loss Outcomes of Black Women Using a Culturally Relevant, Stress Management Enhanced Behavioral Weight Loss Intervention  \nAward Number: 5R01DK125367-05  \nSponsor: National Cancer Institute (NCI)  \nCarson, T. (PD/PI)",
      "title": "Improving Weight Loss Outcomes of Black Women Using a Culturally Relevant, Stress Management Enhanced Behavioral Weight Loss Intervention",
      "award_number": "5R01DK125367-05",
      "sponsor": "National Cancer Institute (NCI)",
      "source": "NCI",
      "investigators": [
        {
          "name": "Carson, T.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "participating_trials": [
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-21224/",
      "trial_id": "21224",
      "title": "Determining the Structural- and Functional-Level Effects of Diet-specific Interventions on The Gut Microbiota of a Diverse Sample of Southern United States Adults",
      "condition": "Healthy Subjects",
      "status": "Open"
    }
  ],
  "lab_page_url": "http://carson.moffitt.org/",
  "google_scholar_url": "https://scholar.google.com/citations?hl=en&user=vFk8ipoAAAAJ&view_op=list_works&gmla=AJsN-F5tUfuC2BIoVJO8TMoB-iOeuf7nQC31tTZe3mNNNpomkZ0dVJ3PEmsGtzzPwg5CaoAPj29aiBxqeYlFjUoe7VPX-N6ZcgDN1JAQSqMdjQazfM0BclgadBJ9Ju5mcpdLhrrmXnLsvGeThuYNXzfNNlEK7UE4wsOsje465UP866ZGJGGoFQw",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/CarsonTiffany_28107.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=28107"
  },
  "content_hash": "d0de54eafcc49910c2154d53aad63e82b61ed8cca82b989b0d6f7f78f0ceaeaa",
  "researcher_name": "tiffany carson",
  "department": "health outcomes & behavior"
}