{
  "profile_url": "https://www.moffitt.org/research-science/researchers/yoga-balagurunathan",
  "last_updated": "2025-10-21T16:34:14.373130",
  "researcher_id": "11050",
  "degrees": [
    "PhD"
  ],
  "title": "",
  "primary_program": "Machine Learning",
  "research_program": "Cancer Biology & Evolution Program",
  "overview": "Dr. Balagurunathan’s research is focused on understanding the physiology of the tumor and its relationship to the underlying genome. His interests include data integration from various modalities (radiology, pathology, genome) to improve clinical decision support. His disease focus are prostate cancer, lung cancer and B-cell lymphomas.",
  "research_interests": [
    "Dr. Balagurunathan’s research is focused on understanding the physiology of the tumor and its relationship to the underlying genome. His interests include data integration from various modalities (radiology, pathology, genome) to improve clinical decision support, His diseasefoci are prostate cancer, lung cancer and B-cell lymphomas. \n  *"
  ],
  "associations": [
    "Machine Learning",
    "Genitourinary Oncology",
    "Diagnostic Imaging and Interventional Radiology",
    "Cancer Biology & Evolution Program"
  ],
  "education": [
    {
      "type": "Graduate",
      "institution": "Texas A&M University, PhD"
    },
    {
      "type": "Graduate",
      "institution": "College of Engineering Guindy, Anna University, ME"
    }
  ],
  "publications": [
    {
      "title": "Radiomic Features Prognosticate Treatment Response in CAR-T Cell Therapy",
      "pubmed_id": "40507312",
      "pmc_id": "PMC12153729",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Balagurunathan Y, Choi JW, Thompson Z, Jain M, Locke FL",
      "journal": "Cancers (Basel)"
    },
    {
      "title": "Challenges in Using Deep Neural Networks Across Multiple Readers in Delineating Prostate Gland Anatomy",
      "pubmed_id": "40392414",
      "year": "2025",
      "publication_date": "2025 May",
      "authors": "Abudalou S, Choi J, Gage K, Pow-Sang J, Yilmaz Y, Balagurunathan Y",
      "journal": "J Imaging Inform Med"
    },
    {
      "title": "AI-powered innovations in pancreatitis imaging: a comprehensive literature synthesis",
      "pubmed_id": "39133362",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Maletz S, Balagurunathan Y, Murphy K, Folio L, Chima R, Zaheer A, Vadvala H",
      "journal": "Abdom Radiol (NY)"
    },
    {
      "title": "Extracellular Microvesicle MicroRNAs and Imaging Metrics Improve the Detection of Aggressive Prostate Cancer: A Pilot Study",
      "pubmed_id": "40075682",
      "pmc_id": "PMC11898942",
      "year": "2025",
      "publication_date": "2025 Feb",
      "authors": "Avasthi KK, Choi JW, Glushko T, Manley BJ, Yu A, Park JY, Brown JS, Pow-Sang J, Gatenby R, Wang L, Balagurunathan Y",
      "journal": "Cancers (Basel)"
    },
    {
      "title": "Bridging Health Disparities in the Data-Driven World of Artificial Intelligence: A Narrative Review",
      "pubmed_id": "38955956",
      "year": "2025",
      "publication_date": "2025 Aug",
      "authors": "Murphy A, Bowen K, Naqa IME, Yoga B, Green BL",
      "journal": "J Racial Ethn Health Disparities"
    },
    {
      "title": "Tumor burden quantified by soluble B-cell maturation antigen and metabolic tumor volume determines myeloma CAR-T outcomes",
      "pubmed_id": "39652773",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Freeman CL, Noble J, Menges M, Villanueva R, Nakashima JY, Figura NB, Tonseth RP, Idiaquez DW, Skelson L, Smith EC, Abraham-Miranda J, Corallo S, De Avila G, Castaneda Puglianini O, Liu HD, Alsina M, Nishihori T, Shain KH, Baz RC, Blue BJ, Grajales-Cruz A, Koomen JM, Atkins RM, Hansen DK, Siqueira Silva A, Kim J, Balagurunathan Y, Locke FL",
      "journal": "Blood"
    },
    {
      "title": "5hmC-profiles in Puerto Rican Hispanic/Latino men with aggressive prostate cancer",
      "pubmed_id": "40265030",
      "pmc_id": "PMC12011585",
      "year": "2025",
      "publication_date": "2025 Apr",
      "authors": "Patel MS, Almubarak M, Matta J, Ortiz-Sanchez C, Encarnacion J, Ruiz-Deya G, Dutil J, Dhillon J, Yamoah K, Berglund A, Park H, Kilari D, Balagurunathan Y, Wang L, Park JY",
      "journal": "Front Oncol"
    },
    {
      "title": "Radiomic features of PET/CT imaging of large B cell lymphoma lesions predicts CAR T cell therapy efficacy",
      "pubmed_id": "39659779",
      "pmc_id": "PMC11629080",
      "year": "2024",
      "publication_date": "2024 Nov",
      "authors": "Balagurunathan Y, Wei Z, Qi J, Thompson Z, Dean E, Lu H, Vardhanabhuti S, Corallo S, Choi JW, Kim JJ, Mattie M, Jain M, Locke FL",
      "journal": "Front Oncol"
    },
    {
      "title": "Quantitative DCE Dynamics on Transformed MR Imaging Discriminates Clinically Significant Prostate Cancer",
      "pubmed_id": "39545376",
      "pmc_id": "PMC11565616",
      "year": "2024",
      "publication_date": "2024 Jan",
      "authors": "Wei Z, Iluppangama M, Qi J, Choi JW, Yu A, Gage K, Chumbalkar V, Dhillon J, Balaji KC, Venkataperumal S, Hernandez DJ, Park J, Yedjou C, Alo R, Gatenby RA, Pow-Sang J, Balagurunanthan Y",
      "journal": "Cancer Control"
    },
    {
      "title": "Extracellular microvesicle microRNAs, along with imaging metrics, improve detection of aggressive prostate cancer",
      "pubmed_id": "39228742",
      "pmc_id": "PMC11370497",
      "year": "2024",
      "publication_date": "2024 Aug",
      "authors": "Avasthi KK, Choi J, Glushko T, Manley BJ, Yu A, Pow-Sang J, Gatenby R, Wang L, Balagurunathan Y",
      "journal": "medRxiv"
    }
  ],
  "grants": [
    {
      "description": "Title: PROTEIN BIOMARKERS IN AFRICAN AMERICAN MINORITIES WITH PROSTATE CANCER  \nAward Number:   \nSponsor: Foundation Support-Rsch  \nBalagurunathan, Y. (PD/PI), Park, J. (Co-PD/PI)",
      "title": "PROTEIN BIOMARKERS IN AFRICAN AMERICAN MINORITIES WITH PROSTATE CANCER",
      "award_number": "",
      "sponsor": "Foundation Support-Rsch",
      "source": "Foundation",
      "investigators": [
        {
          "name": "Balagurunathan, Y.",
          "role": "PD/PI"
        },
        {
          "name": "Park, J.",
          "role": "Co-PD/PI"
        }
      ]
    }
  ],
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/BalagurunathanYoga_11050.jpg",
  "contact": {
    "contact_url": "https://eforms.moffitt.org/ContactResearchersForm?PERID=11050"
  },
  "content_hash": "a50acf73a7ac8874bdffe2356c5eb5619241290a34d0fd63a2e5354082963785",
  "researcher_name": "Yoga Balagurunathan",
  "department": "Machine Learning"
}