{
  "profile_url": "https://www.moffitt.org/research-science/researchers/yumeng-zhang/",
  "last_updated": "2025-11-21T22:50:27.498872",
  "researcher_id": "unknown",
  "degrees": [
    "MD"
  ],
  "title": "",
  "primary_program": "malignant hematology",
  "research_program": "immuno-oncology",
  "overview": "My research centers on lymphoma, with a specific emphasis on T-cell lymphoma and cutaneous lymphoma. I focus on developing novel therapeutic strategies and improving patient outcomes through rigorous clinical research. Developing Immune-Based Therapies for T Cell Lymphoma My research focuses on developing immune-based therapies for T cell lymphoma. This includes projects like clonal T-LGL in Cutaneous T-Cell Lymphoma (CTCL) and understanding the factors that influence the response to these therapies. A key goal is to translate these findings into clinical trials, enhancing treatment efficacy and patient outcomes. Improving Diversity and Access in Clinical Trials I am dedicated to improving diversity in clinical trials and increasing patient access through innovative clinical trial design and technological advancements. My work aims to ensure that clinical research is inclusive and that underrepresented populations have better access to participate in clinical trials, ultimately improving the applicability and impact of research findings. In summary, my research themes include advancing lymphoma treatment, developing immune-based therapies for T cell lymphoma, promoting diversity in clinical trials, addressing health disparities, integrating innovative monitoring technologies, and optimizing patient data management.",
  "research_interests": [
    "Dr. Yumeng Zhang became an assistant member of the Malignant Hematology Department at the renowned H. Lee Moffitt Cancer Center and Research Institute in 2023. Prior to this, she had completed her hematology and medical oncology fellowship training at the same institution, where she excelled as a chief fellow. An unwavering passion for cancer immunology and the research of rare cancers drives Dr. Zhang's journey into oncology. Her innovative work in clinical trial design and translational oncology has earned her accolades such as the ASCO Young Investigator Award, the Robert A. Winn Diversity in Clinical Trials Award, and grants including the NIH K05 and the Microbiome Pilot Grant. She also participated in prestigious workshops like the ASCO/AACR Vail Workshop and the SCION Workshop. Intrigued by the multifaceted nature of T-cell lymphoma, Dr. Zhang has outlined precise and ambitious objectives for her career. Her primary goal is to be recognized as a leading clinical investigator in the realm of T-cell lymphoma therapeutic development. Rather than solely relying on traditional treatment avenues, she emphasizes the integration of immune system modulation with targeted therapies. Such a pioneering approach sets the stage for groundbreaking therapeutic advancements in T-cell lymphoma. Furthermore, Dr. Zhang is dedicated to refining the treatment and management strategies for rare cancers, such as cutaneous T-cell lymphoma. She aspires to develop or augment a research platform designed explicitly for these rare malignancies. This envisioned platform promises to be pivotal in addressing the current challenges associated with these uncommon diseases' management and therapeutic evolution. Endowed with a drive for cancer immunology and rare cancer research and equipped with the extensive clinical experience gained at the H. Lee Moffitt Cancer Center and Research Institute, Yumeng Zhang is well on the way to making significant contributions to the field of oncology.\n  *"
  ],
  "associations": [
    "Malignant Hematology",
    "Immuno-Oncology Program"
  ],
  "education": [],
  "publications": [
    {
      "title": "Expanded CD4+CD57+ T-large granular lymphocytes: A diagnostic pitfall in blood staging of mycosis fungoides/Sézary syndrome",
      "pubmed_id": "40972673",
      "year": "2025",
      "publication_date": "2025 Sep",
      "authors": "Zhang Y, Qin D, Ozoya O, Glass F, Sokol L, Ryder CB",
      "journal": "Am J Clin Pathol"
    },
    {
      "title": "Cutaneous manifestations as the presenting signs of diffuse large B-cell lymphoma/high-grade B-cell lymphoma with MYC and BCL2 rearrangements",
      "pubmed_id": "39790106",
      "pmc_id": "PMC11714132",
      "year": "2025",
      "publication_date": "2025 Jan",
      "authors": "Piñero-Crespo G, Kucharik AH, Chen WS, Idiáquez DW, Doenges J, Zhang Y, Sokol L, Glass F",
      "journal": "JAAD Case Rep"
    },
    {
      "title": "Autologous Hematopoietic Cell Transplantation Consolidation for First Response is Associated With Longer Survival Among Patients With Nodal Peripheral T Cell Lymphoma",
      "pubmed_id": "38740140",
      "year": "2024",
      "publication_date": "2024 Sep",
      "authors": "Zhang Y, Rose A, Khadka S, Cao B, Eatrides J, Saeed H, Shah BD, Chavez J, Bello C, Lazaryan A, Khimani F, Ibarz JP, Liu HD, Locke FL, Jain MD, Zhang L, Kharfan-Dabaja MA, Kim J, Ayala E, Nishihori T, Sokol L",
      "journal": "Transplant Cell Ther"
    },
    {
      "title": "The Meat of the Matter",
      "pubmed_id": "38692295",
      "year": "2024",
      "publication_date": "2024 May",
      "authors": "Rutenberg D, Zhang Y, Montoya JG, Sinnott J, Contopoulos-Ioannidis DG",
      "journal": "N Engl J Med"
    },
    {
      "title": "High Pretreatment DHEA Is Associated with Inferior Immunotherapy Response in Metastatic Non-Small Cell Lung Cancer",
      "pubmed_id": "38539486",
      "pmc_id": "PMC10968948",
      "year": "2024",
      "publication_date": "2024 Mar",
      "authors": "Zhang Y, Darville L, Hogue S, Hallanger Johnson JE, Rose T, Kim Y, Bailey A, Gray JE, Robinson LA",
      "journal": "Cancers (Basel)"
    },
    {
      "title": "Sézary syndrome originates from heavily mutated hematopoietic progenitors",
      "pubmed_id": "37531660",
      "pmc_id": "PMC10514084",
      "year": "2023",
      "publication_date": "2023 Sep",
      "authors": "Harro CM, Sprenger KB, Chaurio RA, Powers JJ, Innamarato P, Anadon CM, Zhang Y, Biswas S, Mandal G, Mine JA, Cortina C, Nagy MZ, Martin AL, Handley KF, Borjas GJ, Chen PL, Pinilla-Ibarz J, Sokol L, Yu X, Conejo-Garcia JR",
      "journal": "Blood Adv"
    },
    {
      "title": "Clinical Response to Upfront Targeted Tyrosine Kinase Inhibitors among Patients with Myeloid/Lymphoid Neoplasms with Eosinophilia and Tyrosine Kinase Gene Fusion",
      "pubmed_id": "36624015",
      "year": "2023",
      "publication_date": "2023 Mar",
      "authors": "Zhang Y, Nguyen L, Lu CM, Wang E, Lauw MIS, Ball S, Dong N, Moscinski L, Chan O, Yun S, Sallman D, Sokol L, Shah B, Knepper T, Lancet J, Komrokji R, Padron E, Kuykendall A, Zhang L",
      "journal": "Clin Lymphoma Myeloma Leuk"
    },
    {
      "title": "Clinicopathologic characteristics, genetic features, and treatment options for acute lymphoblastic leukemia with JAK2 rearrangement-A 10-case study and literature review",
      "pubmed_id": "36958463",
      "year": "2023",
      "publication_date": "2023 Jun",
      "authors": "Zhang L, Shah B, Zhang Y, Tashkandi H, Xiao W, Fernandez-Pol S, Vergara-Lluri M, Hussaini M, Song J, Lancet J, Moscinski L, Yun S, Lu CM, Medeiros LJ, Tang G",
      "journal": "Hum Pathol"
    },
    {
      "title": "Hypomethylating agent and venetoclax in patients with chronic myelomonocytic leukemia: Is the combination indeed better?",
      "pubmed_id": "35179241",
      "year": "2022",
      "publication_date": "2022 May",
      "authors": "Ball S, Jain AG, Aguirre LE, Al Ali N, Zhang Y, Chan O, Kuykendall AT, Sweet KL, Lancet JE, Swoboda DM, Padron E, Komrokji RS, Sallman DA",
      "journal": "Am J Hematol"
    },
    {
      "title": "\"Alterations in the Skin Microbiota Are Associated With Symptom Severity in Mycosis Fungoides\"",
      "pubmed_id": "35656034",
      "pmc_id": "PMC9152451",
      "year": "2022",
      "publication_date": "2022 May",
      "authors": "Zhang Y, Seminario-Vidal L, Cohen L, Hussaini M, Yao J, Rutenberg D, Kim Y, Giuliano A, Robinson LA, Sokol L",
      "journal": "Front Cell Infect Microbiol"
    }
  ],
  "grants": [
    {
      "description": "Title: Evaluating Molecular Biology of Clonal Large Granular Lymphocytic (LGL) Proliferations in Peripheral Blood in Patients with Mycosis Fungoides/Sezary Syndrome (MF/SS)  \nAward Number:   \nSponsor: American Society of Clinical Oncology (ASCO)  \nZhang, Y. (PD/PI)",
      "title": "Evaluating Molecular Biology of Clonal Large Granular Lymphocytic (LGL) Proliferations in Peripheral Blood in Patients with Mycosis Fungoides/Sezary Syndrome (MF/SS)",
      "award_number": "",
      "sponsor": "American Society of Clinical Oncology (ASCO)",
      "investigators": [
        {
          "name": "Zhang, Y.",
          "role": "PD/PI"
        }
      ]
    },
    {
      "description": "Title: Enhancing Patient Diversity in the PLIGHT Trial: A Multilevel Strategy for Inclusive Enrollment for Asian Population in the Concurrent Phototherapy and POTELIGEO (mogamulizumab-kpkc) Pilot Study for Early-Stage Mycosis Fungoides  \nAward Number:   \nSponsor: VIRGINIA COMMONWEALTH UNIV  \nZhang, Y. (PD/PI)",
      "title": "Enhancing Patient Diversity in the PLIGHT Trial: A Multilevel Strategy for Inclusive Enrollment for Asian Population in the Concurrent Phototherapy and POTELIGEO (mogamulizumab-kpkc) Pilot Study for Early-Stage Mycosis Fungoides",
      "award_number": "",
      "sponsor": "VIRGINIA COMMONWEALTH UNIV",
      "investigators": [
        {
          "name": "Zhang, Y.",
          "role": "PD/PI"
        }
      ]
    }
  ],
  "participating_trials": [
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23455/",
      "trial_id": "23455",
      "title": "A phase I/IB study of Ropeginterferon in patients with Cutaneous T-Cell Lymphoma (CTCL)",
      "condition": "Malignant Hematology",
      "intervention": "Ropeginterferon alfa-2b (P1101) ()",
      "status": "Open"
    },
    {
      "trial_url": "https://www.moffitt.org/clinical-trials-and-studies/clinical-trial-23624/",
      "trial_id": "23624",
      "title": "A Phase 1/2 Open-label Study to Investigate the Safety of Sonrotoclax Ramp-up Schedule(s) in Adult Patients With Hematological Malignancies",
      "condition": "Malignant Hematology",
      "intervention": "Sonrotoclax (); Zanubrutinib ()",
      "status": "OPEN (SUSPENDED)"
    }
  ],
  "lab_page_url": "",
  "google_scholar_url": "",
  "photo_url": "https://www.moffitt.org/globalassets/images/researchers_bio/ZhangYumeng_25093.jpg",
  "contact": {},
  "content_hash": "b34a2a336899ddc38ec389fbed7abee57ba3a317c2887952b2f9b5724cbb14b2",
  "researcher_name": "yumeng zhang",
  "department": ""
}